[
    {
        "date": "2025-06-01",
        "sections": [],
        "title": "Seventh Sunday of Easter - Ascension",
        "url": "https://bible.usccb.org/bible/readings/060125.cfm"
    },
    {
        "date": "2025-06-08",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "When Pentecost day came round, they had all met together, when suddenly there came from heaven a sound as of a violent wind which filled the entire house in which they were sitting; and there appeared to them tongues as of fire; these separated and came to rest on the head of each of them. They were all filled with the Holy Spirit and began to speak different languages as the Spirit gave them power to express themselves. Now there were devout men living in Jerusalem from every nation under heaven, and at this sound they all assembled, and each one was bewildered to hear these men speaking his own language. They were amazed and astonished. 'Surely,' they said, 'all these men speaking are Galileans? How does it happen that each of us hears them in his own native language? Parthians, Medes and Elamites; people from Mesopotamia, Judaea and Cappadocia, Pontus and Asia, Phrygia and Pamphylia, Egypt and the parts of Libya round Cyrene; residents of Rome-",
                        "verses": [
                            {
                                "book": "Acts",
                                "link": "https://bible.usccb.org/bible/acts/2?1",
                                "text": "Acts 2:1-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 30) Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nBless the LORD, O my soul!\nO LORD, my God, you are great indeed!\nHow manifold are your works, O LORD!\nthe earth is full of your creatures;\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nMay the glory of the LORD endure forever;\nmay the LORD be glad in his works!\nPleasing to him be my theme;\nI will be glad in the LORD.\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nIf you take away their breath, they perish\nand return to their dust.\nWhen you send forth your spirit, they are created,\nand you renew the face of the earth.\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/104?1",
                                "text": "Psalm 104:1, 24, 29-30, 31, 34"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Because of that, I want to make it quite clear to you that no one who says 'A curse on Jesus' can be speaking in the Spirit of God, and nobody is able to say, 'Jesus is Lord' except in the Holy Spirit. There are many different gifts, but it is always the same Spirit; there are many different ways of serving, but it is always the same Lord. There are many different forms of activity, but in everybody it is the same God who is at work in them all.What I mean is this: every one of you is declaring, 'I belong to Paul,' or 'I belong to Apollos,' or 'I belong to Cephas,' or 'I belong to Christ.'",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1Corinthians/12?3",
                                "text": "1 Corinthians 12:3b-7, 12-13"
                            }
                        ]
                    },
                    {
                        "text": "and those who live by their natural inclinations can never be pleasing to God. You, however, live not by your natural inclinations, but by the Spirit, since the Spirit of God has made a home in you. Indeed, anyone who does not have the Spirit of Christ does not belong to him. But when Christ is in you, the body is dead because of sin but the spirit is alive because you have been justified; and if the Spirit of him who raised Jesus from the dead has made his home in you, then he who raised Christ Jesus from the dead will give life to your own mortal bodies through his Spirit living in you. So then, my brothers, we have no obligation to human nature to be dominated by it. If you do live in that way, you are doomed to die; but if by the Spirit you put to death the habits originating in the body, you will have life. All who are guided by the Spirit of God are sons of God; for what you received was not the spirit of slavery to bring you back into fear; you received the Spirit of adoption, enabling us to cry out, 'Abba, Father!' The Spirit himself joins with our spirit to bear witness that we are children of God.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/8?8",
                                "text": "Romans 8:8-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Sequence Veni, Sancte Spiritus",
                "readings": [
                    {
                        "text": "Come, Holy Spirit, come!\nAnd from your celestial home\n Shed a ray of light divine!\nCome, Father of the poor!\nCome, source of all our store!\n Come, within our bosoms shine.\nYou, of comforters the best;\nYou, the soul's most welcome guest;\n Sweet refreshment here below;\nIn our labor, rest most sweet;\nGrateful coolness in the heat;\n Solace in the midst of woe.\nO most blessed Light divine,\nShine within these hearts of yours,\n And our inmost being fill!\nWhere you are not, we have naught,\nNothing good in deed or thought,\n Nothing free from taint of ill.\nHeal our wounds, our strength renew;\nOn our dryness pour your dew;\n Wash the stains of guilt away:\nBend the stubborn heart and will;\nMelt the frozen, warm the chill;\n Guide the steps that go astray.\nOn the faithful, who adore\nAnd confess you, evermore\n In your sevenfold gift descend;\nGive them virtue's sure reward;\nGive them your salvation, Lord;\n Give them joys that never end. Amen.\n Alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "SEQUENCE"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nCome, Holy Spirit, fill the hearts of your faithful\nand kindle in them the fire of your love.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "In these words he indicated the kind of death by which Peter would give glory to God. After this he said, 'Follow me.' Peter turned and saw the disciple whom Jesus loved following them -- the one who had leant back close to his chest at the supper and had said to him, 'Lord, who is it that will betray you?' Seeing him, Peter said to Jesus, 'What about him, Lord?' Jesus answered, 'If I want him to stay behind till I come, what does it matter to you? You are to follow me.'",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/20?19",
                                "text": "John 20:19-23"
                            }
                        ]
                    },
                    {
                        "text": "I shall no longer call you servants, because a servant does not know the master's business; I call you friends, because I have made known to you everything I have learnt from my Father.So he said, 'I am, as Isaiah prophesied: A voice of one that cries in the desert: Prepare a way for the Lord. Make his paths straight!' Now those who had been sent were Pharisees, and they put this question to him, 'Why are you baptising if you are not the Christ, and not Elijah, and not the Prophet?'",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/14?15",
                                "text": "John 14:15-16, 23b-26"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Pentecost Sunday - Mass during the Day",
        "type_": "DAY",
        "url": "https://bible.usccb.org/bible/readings/060825-Day.cfm"
    },
    {
        "date": "2025-06-15",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "'Yahweh created me, first-fruits of his fashioning, before the oldest of his works. From everlasting, I was firmly set, from the beginning, before the earth came into being. The deep was not, when I was born, nor were the springs with their abounding waters. Before the mountains were settled, before the hills, I came to birth; before he had made the earth, the countryside, and the first elements of the world. When he fixed the heavens firm, I was there, when he drew a circle on the surface of the deep, when he thickened the clouds above, when the sources of the deep began to swell, when he assigned the sea its boundaries -- and the waters will not encroach on the shore -- when he traced the foundations of the earth, I was beside the master craftsman, delighting him day after day, ever at play in his presence,",
                        "verses": [
                            {
                                "book": "Proverbs",
                                "link": "https://bible.usccb.org/bible/proverbs/8?22",
                                "text": "Proverbs 8:22-31"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R (2a)  O Lord, our God, how wonderful your name in all the earth!\nWhen I behold your heavens, the work of your fingers,\n            the moon and the stars which you set in place —\nWhat is man that you should be mindful of him,\n            or the son of man that you should care for him?\nR O Lord, our God, how wonderful your name in all the earth!\nYou have made him little less than the angels,\n            and crowned him with glory and honor.\nYou have given him rule over the works of your hands,\n            putting all things under his feet:\nR O Lord, our God, how wonderful your name in all the earth!\nAll sheep and oxen,\n            yes, and the beasts of the field,\nThe birds of the air, the fishes of the sea,\n            and whatever swims the paths of the seas.\nR O Lord, our God, how wonderful your name in all the earth!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/8?4",
                                "text": "Psalm 8:4-5, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "So then, now that we have been justified by faith, we are at peace with God through our Lord Jesus Christ; it is through him, by faith, that we have been admitted into God's favour in which we are living, and look forward exultantly to God's glory. Not only that; let us exult, too, in our hardships, understanding that hardship develops perseverance, and perseverance develops a tested character, something that gives us hope,",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/5?1",
                                "text": "Romans 5:1-5"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nGlory to the Father, the Son, and the Holy Spirit;\nto God who is, who was, and who is to come.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Revelation",
                                "link": "https://bible.usccb.org/bible/revelation/1?8",
                                "text": "Cf. Revelation 1:8"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "While I was with them, I kept those you had given me true to your name. I have watched over them and not one is lost except one who was destined to be lost, and this was to fulfil the scriptures. But now I am coming to you and I say these things in the world to share my joy with them to the full. I passed your word on to them, and the world hated them, because they belong to the world no more than I belong to the world.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/16?12",
                                "text": "John 16:12-15"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of the Most Holy Trinity",
        "url": "https://bible.usccb.org/bible/readings/061525.cfm"
    },
    {
        "date": "2025-06-22",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "Melchizedek king of Salem brought bread and wine; he was a priest of God Most High. He pronounced this blessing: Blessed be Abram by God Most High, Creator of heaven and earth. And blessed be God Most High for putting your enemies into your clutches.",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/genesis/14?18",
                                "text": "Genesis 14:18-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R (4b)  You are a priest for ever, in the line of Melchizedek.\nThe LORD said to my Lord: \"Sit at my right hand\n            till I make your enemies your footstool.\"\nR You are a priest for ever, in the line of Melchizedek.\nThe scepter of your power the LORD will stretch forth from Zion:\n            \"Rule in the midst of your enemies.\"\nR You are a priest for ever, in the line of Melchizedek.\n\"Yours is princely power in the day of your birth, in holy splendor;\n            before the daystar, like the dew, I have begotten you.\"\nR You are a priest for ever, in the line of Melchizedek.\nThe LORD has sworn, and he will not repent:\n            \"You are a priest forever, according to the order of  Melchizedek.\"\nR You are a priest for ever, in the line of Melchizedek.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/110?1",
                                "text": "Psalm 110:1, 2, 3, 4"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "For the tradition I received from the Lord and also handed on to you is that on the night he was betrayed, the Lord Jesus took some bread, and after he had given thanks, he broke it, and he said, 'This is my body, which is for you; do this in remembrance of me.' And in the same way, with the cup after supper, saying, 'This cup is the new covenant in my blood. Whenever you drink it, do this as a memorial of me.'",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1corinthians/11?23",
                                "text": "1 Corinthians 11:23-26"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI am the living bread that came down from heaven, says the Lord;\nwhoever eats this bread will live forever.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?51",
                                "text": "John 6:51"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "But the crowds got to know and they went after him. He made them welcome and talked to them about the kingdom of God; and he cured those who were in need of healing. It was late afternoon when the Twelve came up to him and said, 'Send the people away, and they can go to the villages and farms round about to find lodging and food; for we are in a lonely place here.' He replied, 'Give them something to eat yourselves.' But they said, 'We have no more than five loaves and two fish, unless we are to go ourselves and buy food for all these people.' For there were about five thousand men. But he said to his disciples, 'Get them to sit down in parties of about fifty.' They did so and made them all sit down. Then he took the five loaves and the two fish, raised his eyes to heaven, and said the blessing over them; then he broke them and handed them to his disciples to distribute among the crowd.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/9?11",
                                "text": "Luke 9:11b-17"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of the Most Holy Body and Blood of Christ",
        "url": "https://bible.usccb.org/bible/readings/062225.cfm"
    },
    {
        "date": "2025-06-29",
        "sections": [],
        "title": "Solemnity of Saints Peter and Paul, Apostles",
        "url": "https://bible.usccb.org/bible/readings/062925.cfm"
    },
    {
        "date": "2025-07-06",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "They will never hunger or thirst, scorching wind and sun will never plague them; for he who pities them will lead them, will guide them to springs of water. I shall turn all my mountains into a road and my highways will be raised aloft. Look! Here they come from far away, look, these from the north and the west, those from the land of Sinim. Shout for joy, you heavens; earth, exult! Mountains, break into joyful cries! For Yahweh has consoled his people, is taking pity on his afflicted ones.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/66?10",
                                "text": "Isaiah 66:10-14c"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) Let all the earth cry out to God with joy.\nShout joyfully to God, all the earth,\n sing praise to the glory of his name;\n proclaim his glorious praise.\nSay to God, \"How tremendous are your deeds!\"\nR. Let all the earth cry out to God with joy.\n\"Let all on earth worship and sing praise to you,\n sing praise to your name!\"\nCome and see the works of God,\n his tremendous deeds among the children of Adam.\nR. Let all the earth cry out to God with joy.\nHe has changed the sea into dry land;\n through the river they passed on foot;\n therefore let us rejoice in him.\nHe rules by his might forever.\nR. Let all the earth cry out to God with joy. \nHear now, all you who fear God, while I declare\n what he has done for me.\nBlessed be God who refused me not\n my prayer or his kindness!\nR. Let all the earth cry out to God with joy.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/66?1",
                                "text": "Psalm 66:1-3, 4-5, 6-7, 16, 20"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "But as for me, it is out of the question that I should boast at all, except of the cross of our Lord Jesus Christ, through whom the world has been crucified to me, and I to the world. It is not being circumcised or uncircumcised that matters; but what matters is a new creation. Peace and mercy to all who follow this as their rule and to the Israel of God. After this, let no one trouble me; I carry branded on my body the marks of Jesus.",
                        "verses": [
                            {
                                "book": "Galatians",
                                "link": "https://bible.usccb.org/bible/Galatians/6?14",
                                "text": "Galatians 6:14-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet the peace of Christ control your hearts;\nlet the word of Christ dwell in you richly.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/3?15",
                                "text": "Colossians 3:15a, 16a"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "After this the Lord appointed seventy-two others and sent them out ahead of him in pairs, to all the towns and places he himself would be visiting. And he said to them, 'The harvest is rich but the labourers are few, so ask the Lord of the harvest to send labourers to do his harvesting. Start off now, but look, I am sending you out like lambs among wolves. Take no purse with you, no haversack, no sandals. Salute no one on the road. Whatever house you enter, let your first words be, \"Peace to this house!\" And if a man of peace lives there, your peace will go and rest on him; if not, it will come back to you. Stay in the same house, taking what food and drink they have to offer, for the labourer deserves his wages; do not move from house to house. Whenever you go into a town where they make you welcome, eat what is put before you. Cure those in it who are sick, and say, \"The kingdom of God is very near to you.\" But whenever you enter a town and they do not make you welcome, go out into its streets and say, \"We wipe off the very dust of your town that clings to our feet, and leave it with you. Yet be sure of this: the kingdom of God is very near.\"With the spirit and power of Elijah, he will go before him to reconcile fathers to their children and the disobedient to the good sense of the upright, preparing for the Lord a people fit for him.' Zechariah said to the angel, 'How can I know this? I am an old man and my wife is getting on in years.' The angel replied, 'I am Gabriel, who stand in God's presence, and I have been sent to speak to you and bring you this good news.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?1",
                                "text": "Luke 10:1-12, 17-20"
                            }
                        ]
                    },
                    {
                        "text": "After this the Lord appointed seventy-two others and sent them out ahead of him in pairs, to all the towns and places he himself would be visiting. And he said to them, 'The harvest is rich but the labourers are few, so ask the Lord of the harvest to send labourers to do his harvesting. Start off now, but look, I am sending you out like lambs among wolves. Take no purse with you, no haversack, no sandals. Salute no one on the road. Whatever house you enter, let your first words be, \"Peace to this house!\" And if a man of peace lives there, your peace will go and rest on him; if not, it will come back to you. Stay in the same house, taking what food and drink they have to offer, for the labourer deserves his wages; do not move from house to house. Whenever you go into a town where they make you welcome, eat what is put before you.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?1",
                                "text": "Luke 10:1-9"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fourteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/070625.cfm"
    },
    {
        "date": "2025-07-13",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "if you obey the voice of Yahweh your God, by keeping his commandments and decrees written in the book of this Law, and if you return to Yahweh your God with all your heart and soul. 'For this Law which I am laying down for you today is neither obscure for you nor beyond your reach. It is not in heaven, so that you need to wonder, \"Who will go up to heaven for us and bring it down to us, so that we can hear and practise it?\" Nor is it beyond the seas, so that you need to wonder, \"Who will cross the seas for us and bring it back to us, so that we can hear and practise it?\"",
                        "verses": [
                            {
                                "book": "Deuteronomy",
                                "link": "https://bible.usccb.org/bible/Deuteronomy/30?10",
                                "text": "Deuteronomy 30:10-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 33)  Turn to the Lord in your need, and you will live.I pray to you, O LORD, for the time of your favor, O God!In your great kindness answer me with your constant help.Answer me, O LORD, for bounteous is your kindness: in your great mercy turn toward me.R. Turn to the Lord in your need, and you will live.I am afflicted and in pain; let your saving help, O God, protect me.I will praise the name of God in song, and I will glorify him with thanksgiving.R. Turn to the Lord in your need, and you will live.\"See, you lowly ones, and be glad; you who seek God, may your hearts revive!For the LORD hears the poor, and his own who are in bonds he spurns not.\"R. Turn to the Lord in your need, and you will live.For God will save Zion and rebuild the cities of Judah.The descendants of his servants shall inherit it, and those who love his name shall inhabit it.R. Turn to the Lord in your need, and you will live.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/69?14",
                                "text": "Psalm 69:14, 17, 30-31, 33-34, 36, 37"
                            }
                        ]
                    },
                    {
                        "text": "R.(9a) Your words, Lord, are Spirit and life.\nThe law of the LORD is perfect,\n refreshing the soul;\nthe decree of the LORD is trustworthy,\n giving wisdom to the simple.\nR. Your words, Lord, are Spirit and life.\nThe precepts of the LORD are right,\n rejoicing the heart;\nthe command of the LORD is clear,\n enlightening the eye.\nR. Your words, Lord, are Spirit and life.\nThe fear of the LORD is pure,\n enduring forever;\nthe ordinances of the LORD are true,\n all of them just.\nR. Your words, Lord, are Spirit and life.\nThey are more precious than gold,\n than a heap of purest gold;\nsweeter also than syrup\n or honey from the comb.\nR. Your words, Lord, are Spirit and life.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/19?8",
                                "text": "Psalm 19:8, 9, 10, 11"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "He is the image of the unseen God, the first-born of all creation, for in him were created all things in heaven and on earth: everything visible and everything invisible, thrones, ruling forces, sovereignties, powers -- all things were created through him and for him. He exists before all things and in him all things hold together, and he is the Head of the Body, that is, the Church. He is the Beginning, the first-born from the dead, so that he should be supreme in every way; because God wanted all fullness to be found in him",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?15",
                                "text": "Colossians 1:15-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life;\nyou have the words of everlasting life.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?63",
                                "text": "Cf. John 6:63c, 68c"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "And now a lawyer stood up and, to test him, asked, 'Master, what must I do to inherit eternal life?' He said to him, 'What is written in the Law? What is your reading of it?' He replied, 'You must love the Lord your God with all your heart, with all your soul, with all your strength, and with all your mind, and your neighbour as yourself.' Jesus said to him, 'You have answered right, do this and life is yours.' But the man was anxious to justify himself and said to Jesus, 'And who is my neighbour?' In answer Jesus said, 'A man was once on his way down from Jerusalem to Jericho and fell into the hands of bandits; they stripped him, beat him and then made off, leaving him half dead. Now a priest happened to be travelling down the same road, but when he saw the man, he passed by on the other side. In the same way a Levite who came to the place saw him, and passed by on the other side. But a Samaritan traveller who came on him was moved with compassion when he saw him. He went up to him and bandaged his wounds, pouring oil and wine on them. He then lifted him onto his own mount and took him to an inn and looked after him. Next day, he took out two denarii and handed them to the innkeeper and said, \"Look after him, and on my way back I will make good any extra expense you have.\" Which of these three, do you think, proved himself a neighbour to the man who fell into the bandits' hands?'",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?25",
                                "text": "Luke 10:25-37"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fifteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/071325.cfm"
    },
    {
        "date": "2025-07-20",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Yahweh appeared to him at the Oak of Mamre while he was sitting by the entrance of the tent during the hottest part of the day. He looked up, and there he saw three men standing near him. As soon as he saw them he ran from the entrance of the tent to greet them, and bowed to the ground. 'My lord,' he said, 'if I find favour with you, please do not pass your servant by. Let me have a little water brought, and you can wash your feet and have a rest under the tree. Let me fetch a little bread and you can refresh yourselves before going further, now that you have come in your servant's direction.' They replied, 'Do as you say.' Abraham hurried to the tent and said to Sarah, 'Quick, knead three measures of best flour and make loaves.' Then, running to the herd, Abraham took a fine and tender calf and gave it to the servant, who hurried to prepare it. Then taking curds, milk and the calf which had been prepared, he laid all before them, and they ate while he remained standing near them under the tree. 'Where is your wife Sarah?' they asked him. 'She is in the tent,' he replied.",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/Genesis/18?1",
                                "text": "Genesis 18:1-10a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(1a) He who does justice will live in the presence of the Lord.\nOne who walks blamelessly and does justice;\nwho thinks the truth in his heart\nand slanders not with his tongue.\nR. He who does justice will live in the presence of the Lord.\nWho harms not his fellow man,\nnor takes up a reproach against his neighbor;\nby whom the reprobate is despised,\nwhile he honors those who fear the LORD.\nR. He who does justice will live in the presence of the Lord.\nWho lends not his money at usury\nand accepts no bribe against the innocent.\nOne who does these things\nshall never be disturbed.\nR. He who does justice will live in the presence of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/15?2",
                                "text": "Psalm 15:2-3, 3-4, 5"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "It makes me happy to be suffering for you now, and in my own body to make up all the hardships that still have to be undergone by Christ for the sake of his body, the Church, of which I was made a servant with the responsibility towards you that God gave to me, that of completing God's message, the message which was a mystery hidden for generations and centuries and has now been revealed to his holy people. It was God's purpose to reveal to them how rich is the glory of this mystery among the gentiles; it is Christ among you, your hope of glory:",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?24",
                                "text": "Colossians 1:24-28"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed are they who have kept the word with a generous heart\nand yield a harvest through perseverance.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/8?15",
                                "text": "Cf. Luke 8:15"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "In the course of their journey he came to a village, and a woman named Martha welcomed him into her house. She had a sister called Mary, who sat down at the Lord's feet and listened to him speaking. Now Martha, who was distracted with all the serving, came to him and said, 'Lord, do you not care that my sister is leaving me to do the serving all by myself? Please tell her to help me.' But the Lord answered, 'Martha, Martha,' he said, 'you worry and fret about so many things,",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?38",
                                "text": "Luke 10:38-42"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Sixteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/072025.cfm"
    },
    {
        "date": "2025-07-27",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Then Yahweh said, 'The outcry against Sodom and Gomorrah is so great and their sin is so grave, that I shall go down and see whether or not their actions are at all as the outcry reaching me would suggest. Then I shall know.' While the men left there and went to Sodom, Yahweh remained in Abraham's presence. Abraham stepped forward and said, 'Will you really destroy the upright with the guilty? Suppose there are fifty upright people in the city. Will you really destroy it? Will you not spare the place for the sake of the fifty upright in it? Do not think of doing such a thing: to put the upright to death with the guilty, so that upright and guilty fare alike! Is the judge of the whole world not to act justly?' Yahweh replied, 'If I find fifty upright people in the city of Sodom, I will spare the whole place because of them.' Abraham spoke up and said, 'It is presumptuous of me to speak to the Lord, I who am dust and ashes: Suppose the fifty upright were five short? Would you destroy the whole city because of five?' 'No,' he replied, 'I shall not destroy it if I find forty-five there.' Abraham persisted and said, 'Suppose there are forty to be found there?' 'I shall not do it,' he replied, 'for the sake of the forty.' Abraham said, 'I hope the Lord will not be angry if I go on: Suppose there are only thirty to be found there?' 'I shall not do it,' he replied, 'if I find thirty there.' He said, 'It is presumptuous of me to speak to the Lord: Suppose there are only twenty there?' 'I shall not destroy it,' he replied, 'for the sake of the twenty.'",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/Genesis/18?20",
                                "text": "Genesis 18:20-32"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(3a) Lord, on the day I called for help, you answered me.\nI will give thanks to you, O LORD, with all my heart,\nfor you have heard the words of my mouth;\nin the presence of the angels I will sing your praise;\nI will worship at your holy temple\nand give thanks to your name.\nR. Lord, on the day I called for help, you answered me.\nBecause of your kindness and your truth;\nfor you have made great above all things\nyour name and your promise.\nWhen I called you answered me;\nyou built up strength within me.\nR. Lord, on the day I called for help, you answered me.\nThe LORD is exalted, yet the lowly he sees,\nand the proud he knows from afar.\nThough I walk amid distress, you preserve me;\nagainst the anger of my enemies you raise your hand.\nR. Lord, on the day I called for help, you answered me.\nYour right hand saves me.\nThe LORD will complete what he has done for me;\nyour kindness, O LORD, endures forever;\nforsake not the work of your hands.\nR. Lord, on the day I called for help, you answered me.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/138?1",
                                "text": "Psalm 138:1-2, 2-3, 6-7, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "You have been buried with him by your baptism; by which, too, you have been raised up with him through your belief in the power of God who raised him from the dead. You were dead, because you were sinners and uncircumcised in body: he has brought you to life with him, he has forgiven us every one of our sins.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/2?12",
                                "text": "Colossians 2:12-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nYou have received a Spirit of adoption,\nthrough which we cry, Abba, Father.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/8?15",
                                "text": "Romans 8:15bc"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Now it happened that he was in a certain place praying, and when he had finished, one of his disciples said, 'Lord, teach us to pray, as John taught his disciples.' He said to them, 'When you pray, this is what to say: Father, may your name be held holy, your kingdom come; give us each day our daily bread, and forgive us our sins, for we ourselves forgive each one who is in debt to us. And do not put us to the test.' He also said to them, 'Suppose one of you has a friend and goes to him in the middle of the night to say, \"My friend, lend me three loaves, because a friend of mine on his travels has just arrived at my house and I have nothing to offer him;\" and the man answers from inside the house, \"Do not bother me. The door is bolted now, and my children are with me in bed; I cannot get up to give it to you.\" I tell you, if the man does not get up and give it to him for friendship's sake, persistence will make him get up and give his friend all he wants. 'So I say to you: Ask, and it will be given to you; search, and you will find; knock, and the door will be opened to you. For everyone who asks receives; everyone who searches finds; everyone who knocks will have the door opened. What father among you, if his son asked for a fish, would hand him a snake? Or if he asked for an egg, hand him a scorpion?",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/11?1",
                                "text": "Luke 11:1-13"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Seventeenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/072725.cfm"
    },
    {
        "date": "2025-08-03",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "What profit can we show for all our toil, toiling under the sun?For here is one who has laboured wisely, skilfully and successfully and must leave what is his own to someone who has not toiled for it at all. This is futile too, and grossly unjust; for what does he gain for all the toil and strain that he has undergone under the sun-",
                        "verses": [
                            {
                                "book": "Ecclesiastes",
                                "link": "https://bible.usccb.org/BIBLE/Ecclesiastes/1?2",
                                "text": "Ecclesiastes 1:2; 2:21-23"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) If today you hear his voice, harden not your hearts.\nYou turn man back to dust,\nsaying, “Return, O children of men.”\nFor a thousand years in your sight\n are as yesterday, now that it is past,\n or as a watch of the night.\nR. If today you hear his voice, harden not your hearts.\nYou make an end of them in their sleep;\n the next morning they are like the changing grass,\nWhich at dawn springs up anew,\nbut by evening wilts and fades.\nR. If today you hear his voice, harden not your hearts.\nTeach us to number our days aright,\n that we may gain wisdom of heart.\nReturn, O LORD! How long?\n Have pity on your servants!\nR. If today you hear his voice, harden not your hearts.\nFill us at daybreak with your kindness,\n that we may shout for joy and gladness all our days.\nAnd may the gracious care of the LORD our God be ours;\n prosper the work of our hands for us!\n Prosper the work of our hands!\nR. If today you hear his voice, harden not your hearts.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/90?3",
                                "text": "Psalm 90:3-4, 5-6, 12-13, 14 and 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Since you have been raised up to be with Christ, you must look for the things that are above, where Christ is, sitting at God's right hand. Let your thoughts be on things above, not on the things that are on the earth, because you have died, and now the life you have is hidden with Christ in God. But when Christ is revealed -- and he is your life-you, too, will be revealed with him in glory.That is why, ever since the day he told us, we have never failed to remember you in our prayers and ask that through perfect wisdom and spiritual understanding you should reach the fullest knowledge of his will and so be able to lead a life worthy of the Lord, a life acceptable to him in all its aspects, bearing fruit in every kind of good work and growing in knowledge of God,",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/3?1",
                                "text": "Colossians 3:1-5, 9-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed are the poor in spirit,\nfor theirs is the kingdom of heaven.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/5?3",
                                "text": "Matthew 5:3"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "A man in the crowd said to him, 'Master, tell my brother to give me a share of our inheritance.' He said to him, 'My friend, who appointed me your judge, or the arbitrator of your claims?' Then he said to them, 'Watch, and be on your guard against avarice of any kind, for life does not consist in possessions, even when someone has more than he needs.' Then he told them a parable, 'There was once a rich man who, having had a good harvest from his land, thought to himself, \"What am I to do? I have not enough room to store my crops.\" Then he said, \"This is what I will do: I will pull down my barns and build bigger ones, and store all my grain and my goods in them, and I will say to my soul: My soul, you have plenty of good things laid by for many years to come; take things easy, eat, drink, have a good time.\" But God said to him, \"Fool! This very night the demand will be made for your soul; and this hoard of yours, whose will it be then?\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?13",
                                "text": "Luke 12:13-21"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Eighteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/080325.cfm"
    },
    {
        "date": "2025-08-10",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "That night had been known in advance to our ancestors, so that, well knowing him in whom they had put their trust, they would be sure of his promises. Your people thus were waiting both for the rescue of the upright and for the ruin of the enemy; for by the very vengeance that you exacted on our adversaries, you glorified us by calling us to you.",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/Wisdom/18?6",
                                "text": "Wisdom 18:6-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (12b) Blessed the people the Lord has chosen to be his own.\nExult, you just, in the LORD;\n praise from the upright is fitting.\nBlessed the nation whose God is the LORD,\n the people he has chosen for his own inheritance.\nR. Blessed the people the Lord has chosen to be his own.\nSee, the eyes of the LORD are upon those who fear him,\n upon those who hope for his kindness,\nTo deliver them from death\n and preserve them in spite of famine.\nR. Blessed the people the Lord has chosen to be his own.\nOur soul waits for the LORD,\n who is our help and our shield.\nMay your kindness, O LORD, be upon us\n who have put our hope in you.\nR. Blessed the people the Lord has chosen to be his own.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/33?1",
                                "text": "Psalm 33:1, 12, 18-19, 20-22"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Only faith can guarantee the blessings that we hope for, or prove the existence of realities that are unseen.but to the Son he says: Your throne, God, is for ever and ever; and: the sceptre of his kingdom is a sceptre of justice; you love uprightness and detest evil. This is why God, your God, has anointed you with the oil of gladness, as none of your rivals. And again: Long ago, Lord, you laid earth's foundations, the heavens are the work of your hands. They pass away but you remain, they all wear out like a garment. Like a cloak you will roll them up, like a garment, and they will be changed. But you never alter and your years are unending. To which of the angels has God ever said: Take your seat at my right hand till I have made your enemies your footstool? Are they not all ministering spirits, sent to serve for the sake of those who are to inherit salvation?",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/11?1",
                                "text": "Hebrews 11:1-2, 8-19"
                            }
                        ]
                    },
                    {
                        "text": "Only faith can guarantee the blessings that we hope for, or prove the existence of realities that are unseen.but to the Son he says: Your throne, God, is for ever and ever; and: the sceptre of his kingdom is a sceptre of justice; you love uprightness and detest evil. This is why God, your God, has anointed you with the oil of gladness, as none of your rivals. And again: Long ago, Lord, you laid earth's foundations, the heavens are the work of your hands. They pass away but you remain, they all wear out like a garment.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/11?1",
                                "text": "Hebrews 11:1-2, 8-12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nStay awake and be ready!\nFor you do not know on what day your Lord will come.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/24?42",
                                "text": "Matthew 24;42a, 44"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "'There is no need to be afraid, little flock, for it has pleased your Father to give you the kingdom. 'Sell your possessions and give to those in need. Get yourselves purses that do not wear out, treasure that will not fail you, in heaven where no thief can reach it and no moth destroy it. For wherever your treasure is, that is where your heart will be too. 'See that you have your belts done up and your lamps lit. Be like people waiting for their master to return from the wedding feast, ready to open the door as soon as he comes and knocks. Blessed those servants whom the master finds awake when he comes. In truth I tell you, he will do up his belt, sit them down at table and wait on them. It may be in the second watch that he comes, or in the third, but blessed are those servants if he finds them ready. You may be quite sure of this, that if the householder had known at what time the burglar would come, he would not have let anyone break through the wall of his house. You too must stand ready, because the Son of man is coming at an hour you do not expect.' Peter said, 'Lord, do you mean this parable for us, or for everyone?' The Lord replied, 'Who, then, is the wise and trustworthy steward whom the master will place over his household to give them at the proper time their allowance of food? Blessed that servant if his master's arrival finds him doing exactly that. I tell you truly, he will put him in charge of everything that he owns. But if the servant says to himself, \"My master is taking his time coming,\" and sets about beating the menservants and the servant-girls, and eating and drinking and getting drunk, his master will come on a day he does not expect and at an hour he does not know. The master will cut him off and send him to the same fate as the unfaithful. 'The servant who knows what his master wants, but has got nothing ready and done nothing in accord with those wishes, will be given a great many strokes of the lash.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?32",
                                "text": "Luke 12:32-48"
                            }
                        ]
                    },
                    {
                        "text": "'See that you have your belts done up and your lamps lit. Be like people waiting for their master to return from the wedding feast, ready to open the door as soon as he comes and knocks. Blessed those servants whom the master finds awake when he comes. In truth I tell you, he will do up his belt, sit them down at table and wait on them. It may be in the second watch that he comes, or in the third, but blessed are those servants if he finds them ready. You may be quite sure of this, that if the householder had known at what time the burglar would come, he would not have let anyone break through the wall of his house.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?35",
                                "text": "Luke 12:35-40"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Nineteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/081025.cfm"
    },
    {
        "date": "2025-08-17",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The chief men then said to the king, 'You must have this man put to death: he is unquestionably disheartening the remaining soldiers in the city, and all the people too, by talking like this. This man is seeking not the welfare of the people but their ruin.' King Zedekiah answered, 'He is in your hands as you know, for the king is powerless to oppose you.'Do not be afraid of confronting them, for I am with you to rescue you, Yahweh declares.' Then Yahweh stretched out his hand and touched my mouth, and Yahweh said to me: 'There! I have put my words into your mouth.",
                        "verses": [
                            {
                                "book": "Jeremiah",
                                "link": "https://bible.usccb.org/bible/Jeremiah/38?4",
                                "text": "Jeremiah 38:4-6, 8-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (14b)  Lord, come to my aid!\nI have waited, waited for the LORD,\nand he stooped toward me.\nR. Lord, come to my aid!\nThe LORD heard my cry.\nHe drew me out of the pit of destruction,\n out of the mud of the swamp;\nhe set my feet upon a crag;\n he made firm my steps.\nR. Lord, come to my aid!\nAnd he put a new song into my mouth,\n a hymn to our God.\nMany shall look on in awe\n and trust in the LORD.\nR. Lord, come to my aid!\nThough I am afflicted and poor,\n yet the LORD thinks of me.\nYou are my help and my deliverer;\n O my God, hold not back!\nR. Lord, come to my aid!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/40?2",
                                "text": "Psalm 40:2, 3, 4, 18"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "With so many witnesses in a great cloud all around us, we too, then, should throw off everything that weighs us down and the sin that clings so closely, and with perseverance keep running in the race which lies ahead of us. Let us keep our eyes fixed on Jesus, who leads us in our faith and brings it to perfection: for the sake of the joy which lay ahead of him, he endured the cross, disregarding the shame of it, and has taken his seat at the right of God's throne. Think of the way he persevered against such opposition from sinners and then you will not lose heart and come to grief.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?1",
                                "text": "Hebrews 12:1-4"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/10?27",
                                "text": "John 10:27"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "'I have come to bring fire to the earth, and how I wish it were blazing already! There is a baptism I must still receive, and what constraint I am under until it is completed! 'Do you suppose that I am here to bring peace on earth? No, I tell you, but rather division. For from now on, a household of five will be divided: three against two and two against three;",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?49",
                                "text": "Luke 12:49-53"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twentieth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/081725.cfm"
    },
    {
        "date": "2025-08-24",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Raise your eyes and look around you: all are assembling, coming to you. By my life, declares Yahweh, you will put them all on like jewels, like a bride, you will fasten them on. For your desolate places and your ruins and your devastated country from now on will be too cramped for your inhabitants, and your devourers will be far away. Once more they will say in your hearing, the children of whom you were bereft, 'The place is too cramped for me, make room for me to live.'",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/66?18",
                                "text": "Isaiah 66:18-21"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(Mk 16:15) Go out to all the world and tell the Good News.\nor:\nR. Alleluia.\nPraise the LORD, all you nations;\nglorify him, all you peoples!\nR. Go out to all the world and tell the Good News.\nor:\nR. Alleluia.\nFor steadfast is his kindness toward us,\nand the fidelity of the LORD endures forever.\nR. Go out to all the world and tell the Good News.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/117?1",
                                "text": "Psalm 117:1, 2"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Have you forgotten that encouraging text in which you are addressed as sons? My son, do not scorn correction from the Lord, do not resent his training, for the Lord trains those he loves, and chastises every son he accepts.They pass away but you remain, they all wear out like a garment. Like a cloak you will roll them up, like a garment, and they will be changed. But you never alter and your years are unending.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?5",
                                "text": "Hebrews 12:5-7, 11-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI am the way, the truth and the life, says the Lord;\nno one comes to the Father, except through me.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/14?6",
                                "text": "John 14:6"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Through towns and villages he went teaching, making his way to Jerusalem. Someone said to him, 'Sir, will there be only a few saved?' He said to them, 'Try your hardest to enter by the narrow door, because, I tell you, many will try to enter and will not succeed. 'Once the master of the house has got up and locked the door, you may find yourself standing outside knocking on the door, saying, \"Lord, open to us,\" but he will answer, \"I do not know where you come from.\" Then you will start saying, \"We once ate and drank in your company; you taught in our streets,\" but he will reply, \"I do not know where you come from; away from me, all evil doers!\" 'Then there will be weeping and grinding of teeth, when you see Abraham and Isaac and Jacob and all the prophets in the kingdom of God, and yourselves thrown out. And people from east and west, from north and south, will come and sit down at the feast in the kingdom of God.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/13?22",
                                "text": "Luke 13:22-30"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-first Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/082425.cfm"
    },
    {
        "date": "2025-08-31",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "My child, be gentle in carrying out your business, and you will be better loved than a lavish giver.Do not stand out against fear of the Lord, do not practise it with a double heart.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/Sirach/3?17",
                                "text": "Sirach 3:17-18, 20, 28-29"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 11b)  God, in your goodness, you have made a home for the poor.\nThe just rejoice and exult before God;\nthey are glad and rejoice.\nSing to God, chant praise to his name;\nwhose name is the LORD.\nR. God, in your goodness, you have made a home for the poor.\nThe father of orphans and the defender of widows\nis God in his holy dwelling.\nGod gives a home to the forsaken;\nhe leads forth prisoners to prosperity.\nR. God, in your goodness, you have made a home for the poor.\nA bountiful rain you showered down, O God, upon your inheritance;\nyou restored the land when it languished;\nyour flock settled in it;\nin your goodness, O God, you provided it for the needy.\nR. God, in your goodness, you have made a home for the poor.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/68?4",
                                "text": "Psalm 68:4-5, 6-7, 10-11"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "What you have come to is nothing known to the senses: not a blazing fire, or gloom or total darkness, or a storm;",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?18",
                                "text": "Hebrews 12:18-19, 22-24a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nTake my yoke upon you, says the Lord,\nand learn from me, for I am meek and humble of heart.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/11?29",
                                "text": "Matthew 11:29ab"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Now there in front of him was a man with dropsy,But they were childless: Elizabeth was barren and they were both advanced in years. Now it happened that it was the turn of his section to serve, and he was exercising his priestly office before God when it fell to him by lot, as the priestly custom was, to enter the Lord's sanctuary and burn incense there. And at the hour of incense all the people were outside, praying. Then there appeared to him the angel of the Lord, standing on the right of the altar of incense. The sight disturbed Zechariah and he was overcome with fear. But the angel said to him, 'Zechariah, do not be afraid, for your prayer has been heard. Your wife Elizabeth is to bear you a son and you shall name him John.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/14?1",
                                "text": "Luke 14:1, 7-14"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-second Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/083125.cfm"
    },
    {
        "date": "2025-09-07",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "'What human being indeed can know the intentions of God? And who can comprehend the will of the Lord? For the reasoning of mortals is inadequate, our attitudes of mind unstable; for a perishable body presses down the soul, and this tent of clay weighs down the mind with its many cares. It is hard enough for us to work out what is on earth, laborious to know what lies within our reach; who, then, can discover what is in the heavens? And who could ever have known your will, had you not given Wisdom and sent your holy Spirit from above?",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/Wisdom/9?13",
                                "text": "Wisdom 9:13-18b"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) In every age, O Lord, you have been our refuge.\nYou turn man back to dust,\nsaying, “Return, O children of men.”\nFor a thousand years in your sight\n are as yesterday, now that it is past,\nor as a watch of the night.\nR. In every age, O Lord, you have been our refuge.\nYou make an end of them in their sleep;\n the next morning they are like the changing grass,\nWhich at dawn springs up anew,\n but by evening wilts and fades.\nR. In every age, O Lord, you have been our refuge.\nTeach us to number our days aright,\n that we may gain wisdom of heart.\nReturn, O LORD! How long?\nHave pity on your servants!\nR. In every age, O Lord, you have been our refuge.\nFill us at daybreak with your kindness,\n that we may shout for joy and gladness all our days.\nAnd may the gracious care of the LORD our God be ours;\n prosper the work of our hands for us!\nProsper the work of our hands!\nR. In every age, O Lord, you have been our refuge.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/90?3",
                                "text": "Psalm 90:3-4, 5-6, 12-13, 14 and 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "I am rather appealing to your love, being what I am, Paul, an old man, and now also a prisoner of Christ Jesus.I am sending him back to you -- that is to say, sending you my own heart. I should have liked to keep him with me; he could have been a substitute for you, to help me while I am in the chains that the gospel has brought me. However, I did not want to do anything without your consent; it would have been forcing your act of kindness, which should be spontaneous. I suppose you have been deprived of Onesimus for a time, merely so that you could have him back for ever, no longer as a slave, but something much better than a slave, a dear brother; especially dear to me, but how much more to you, both on the natural plane and in the Lord.",
                        "verses": [
                            {
                                "book": "Philemon",
                                "link": "https://bible.usccb.org/bible/philemon/1?9",
                                "text": "Philemon 9-10, 12-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet your face shine upon your servant;\nand teach me your laws.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/119?135",
                                "text": "Psalm 119:135"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Great crowds accompanied him on his way and he turned and spoke to them. 'Anyone who comes to me without hating father, mother, wife, children, brothers, sisters, yes and his own life too, cannot be my disciple. No one who does not carry his cross and come after me can be my disciple. 'And indeed, which of you here, intending to build a tower, would not first sit down and work out the cost to see if he had enough to complete it? Otherwise, if he laid the foundation and then found himself unable to finish the work, anyone who saw it would start making fun of him and saying, \"Here is someone who started to build and was unable to finish.\" Or again, what king marching to war against another king would not first sit down and consider whether with ten thousand men he could stand up to the other who was advancing against him with twenty thousand? If not, then while the other king was still a long way off, he would send envoys to sue for peace.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/14?25",
                                "text": "Luke 14:25-33"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-third Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/090725.cfm"
    },
    {
        "date": "2025-09-14",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "They left Mount Hor by the road to the Sea of Suph, to skirt round Edom. On the way the people lost patience. They spoke against God and against Moses, 'Why did you bring us out of Egypt to die in the desert? For there is neither food nor water here; we are sick of this meagre diet.' At this, God sent fiery serpents among the people; their bite brought death to many in Israel. The people came and said to Moses, 'We have sinned by speaking against Yahweh and against you. Intercede for us with Yahweh to save us from these serpents.' Moses interceded for the people, and Yahweh replied, 'Make a fiery serpent and raise it as a standard. Anyone who is bitten and looks at it will survive.'",
                        "verses": [
                            {
                                "book": "Numbers",
                                "link": "https://bible.usccb.org/bible/numbers/21?4",
                                "text": "Numbers 21:4b-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (see 7b) Do not forget the works of the Lord!\nHearken, my people, to my teaching;\nincline your ears to the words of my mouth.\nI will open my mouth in a parable,\nI will utter mysteries from of old.\nR. Do not forget the works of the Lord!\nWhile he slew them they sought him\nand inquired after God again,\nRemembering that God was their rock\nand the Most High God, their redeemer.\nR. Do not forget the works of the Lord!\nBut they flattered him with their mouths\nand lied to him with their tongues,\nThough their hearts were not steadfast toward him,\nnor were they faithful to his covenant.\nR. Do not forget the works of the Lord!\nBut he, being merciful, forgave their sin\nand destroyed them not;\nOften he turned back his anger\nand let none of his wrath be roused.\nR. Do not forget the works of the Lord!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/78?1",
                                "text": "Psalm 78:1bc-2, 34-35, 36-37, 38"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Who, being in the form of God, did not count equality with God something to be grasped. But he emptied himself, taking the form of a slave, becoming as human beings are; and being in every way like a human being, he was humbler yet, even to accepting death, death on a cross. And for this God raised him high, and gave him the name which is above all other names; so that all beings in the heavens, on earth and in the underworld, should bend the knee at the name of Jesus",
                        "verses": [
                            {
                                "book": "Philippians",
                                "link": "https://bible.usccb.org/bible/philippians/2?6",
                                "text": "Philippians 2:6-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nWe adore you, O Christ, and we bless you,\nbecause by your Cross you have redeemed the world.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "No one has gone up to heaven except the one who came down from heaven, the Son of man; as Moses lifted up the snake in the desert, so must the Son of man be lifted up so that everyone who believes may have eternal life in him. For this is how God loved the world: he gave his only Son, so that everyone who believes in him may not perish but may have eternal life.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/3?13",
                                "text": "John 3:13-17"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Exaltation of the Holy Cross",
        "url": "https://bible.usccb.org/bible/readings/091425.cfm"
    },
    {
        "date": "2025-09-21",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Listen to this, you who crush the needy and reduce the oppressed to nothing, you who say, 'When will New Moon be over so that we can sell our corn, and Sabbath, so that we can market our wheat? Then, we can make the bushel-measure smaller and the shekel-weight bigger, by fraudulently tampering with the scales. We can buy up the weak for silver and the poor for a pair of sandals, and even get a price for the sweepings of the wheat.'",
                        "verses": [
                            {
                                "book": "Amos",
                                "link": "https://bible.usccb.org/bible/Amos/8?4",
                                "text": "Amos 8:4-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1a, 7b) Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nPraise, you servants of the LORD,\n praise the name of the LORD.\nBlessed be the name of the LORD\n both now and forever.\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nHigh above all nations is the LORD;\n above the heavens is his glory.\nWho is like the LORD, our God, who is enthroned on high\n and looks upon the heavens and the earth below?\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nHe raises up the lowly from the dust;\n from the dunghill he lifts up the poor\nto seat them with princes,\n with the princes of his own people.\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/113?1",
                                "text": "Psalm 113:1-2, 4-6, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "I urge then, first of all that petitions, prayers, intercessions and thanksgiving should be offered for everyone, for kings and others in authority, so that we may be able to live peaceful and quiet lives with all devotion and propriety. To do this is right, and acceptable to God our Saviour: he wants everyone to be saved and reach full knowledge of the truth. For there is only one God, and there is only one mediator between God and humanity, himself a human being, Christ Jesus, who offered himself as a ransom for all. This was the witness given at the appointed time, of which I was appointed herald and apostle and -- I am telling the truth and no lie -- a teacher of the gentiles in faith and truth.",
                        "verses": [
                            {
                                "book": "1 Timothy",
                                "link": "https://bible.usccb.org/bible/1timothy/2?1",
                                "text": "1 Timothy 2:1-8"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/8?9",
                                "text": "Cf. 2 Corinthians 8:9"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "He also said to his disciples, 'There was a rich man and he had a steward who was denounced to him for being wasteful with his property. He called for the man and said, \"What is this I hear about you? Draw me up an account of your stewardship because you are not to be my steward any longer.\" Then the steward said to himself, \"Now that my master is taking the stewardship from me, what am I to do? Dig? I am not strong enough. Go begging? I should be too ashamed. Ah, I know what I will do to make sure that when I am dismissed from office there will be some to welcome me into their homes.\" 'Then he called his master's debtors one by one. To the first he said, \"How much do you owe my master?\" \"One hundred measures of oil,\" he said. The steward said, \"Here, take your bond; sit down and quickly write fifty.\" To another he said, \"And you, sir, how much do you owe?\" \"One hundred measures of wheat,\" he said. The steward said, \"Here, take your bond and write eighty.\" 'The master praised the dishonest steward for his astuteness. For the children of this world are more astute in dealing with their own kind than are the children of light.' 'And so I tell you this: use money, tainted as it is, to win you friends, and thus make sure that when it fails you, they will welcome you into eternal dwellings. Anyone who is trustworthy in little things is trustworthy in great; anyone who is dishonest in little things is dishonest in great. If then you are not trustworthy with money, that tainted thing, who will trust you with genuine riches? And if you are not trustworthy with what is not yours, who will give you what is your very own?",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?1",
                                "text": "Luke 16:1-13"
                            }
                        ]
                    },
                    {
                        "text": "Anyone who is trustworthy in little things is trustworthy in great; anyone who is dishonest in little things is dishonest in great. If then you are not trustworthy with money, that tainted thing, who will trust you with genuine riches? And if you are not trustworthy with what is not yours, who will give you what is your very own?",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?10",
                                "text": "Luke 16:10-13"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-fifth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/092125.cfm"
    },
    {
        "date": "2025-09-28",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Travel to Calneh and look, go on from there to Hamath the great, then go down to Gath in Philistia. Are they more powerful than these kingdoms? Is their territory larger than yours?I shall send fire down on the House of Hazael to devour the palaces of Ben-Hadad; I shall break the gate-bar of Damascus, I shall destroy the inhabitant of Bikath-Aven, the holder of the sceptre in Beth-Eden, and the people of Aram will be deported to Kir, Yahweh says. Yahweh says this: For the three crimes, the four crimes of Gaza, I have made my decree and will not relent: because they have deported entire nations as slaves to Edom,",
                        "verses": [
                            {
                                "book": "Amos",
                                "link": "https://bible.usccb.org/bible/Amos/6?1",
                                "text": "Amos 6:1a, 4-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1b) Praise the Lord, my soul!\nor:\nR. Alleluia.\nBlessed is he who keeps faith forever,\n secures justice for the oppressed,\n gives food to the hungry.\nThe LORD sets captives free.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.\nThe LORD gives sight to the blind;\n the LORD raises up those who were bowed down.\nThe LORD loves the just;\n the LORD protects strangers.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.\nThe fatherless and the widow he sustains,\n but the way of the wicked he thwarts.\nThe LORD shall reign forever;\n your God, O Zion, through all generations. Alleluia.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/146?7",
                                "text": "Psalm 146:7, 8-9, 9-10"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "But, as someone dedicated to God, avoid all that. You must aim to be upright and religious, filled with faith and love, perseverance and gentleness. Fight the good fight of faith and win the eternal life to which you were called and for which you made your noble profession of faith before many witnesses. Now, before God, the source of all life, and before Jesus Christ, who witnessed to his noble profession of faith before Pontius Pilate, I charge you to do all that you have been told, with no faults or failures, until the appearing of our Lord Jesus Christ, who at the due time will be revealed by God, the blessed and only Ruler of all, the King of kings and the Lord of lords,",
                        "verses": [
                            {
                                "book": "1 Timothy",
                                "link": "https://bible.usccb.org/bible/1timothy/6?11",
                                "text": "1 Timothy 6:11-16"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/8?9",
                                "text": "Cf. 2 Corinthians 8:9"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "'There was a rich man who used to dress in purple and fine linen and feast magnificently every day. And at his gate there used to lie a poor man called Lazarus, covered with sores, who longed to fill himself with what fell from the rich man's table. Even dogs came and licked his sores. Now it happened that the poor man died and was carried away by the angels into Abraham's embrace. The rich man also died and was buried. 'In his torment in Hades he looked up and saw Abraham a long way off with Lazarus in his embrace. So he cried out, \"Father Abraham, pity me and send Lazarus to dip the tip of his finger in water and cool my tongue, for I am in agony in these flames.\" Abraham said, \"My son, remember that during your life you had your fill of good things, just as Lazarus his fill of bad. Now he is being comforted here while you are in agony. But that is not all: between us and you a great gulf has been fixed, to prevent those who want to cross from our side to yours or from your side to ours.\" 'So he said, \"Father, I beg you then to send Lazarus to my father's house, since I have five brothers, to give them warning so that they do not come to this place of torment too.\" Abraham said, \"They have Moses and the prophets, let them listen to them.\" The rich man replied, \"Ah no, father Abraham, but if someone comes to them from the dead, they will repent.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?19",
                                "text": "Luke 16:19-31"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-sixth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/092825.cfm"
    },
    {
        "date": "2025-10-05",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "How long, Yahweh, am I to cry for help while you will not listen; to cry, 'Violence!' in your ear while you will not save?Then Yahweh answered me and said, 'Write the vision down, inscribe it on tablets to be easily read. For the vision is for its appointed time, it hastens towards its end and it will not lie; although it may take some time, wait for it, for come it certainly will before too long.",
                        "verses": [
                            {
                                "book": "Habakkuk",
                                "link": "https://bible.usccb.org/bible/Habakkuk/1?2",
                                "text": "Habakkuk 1:2-3; 2:2-4"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (8) If today you hear his voice, harden not your hearts.\nCome, let us sing joyfully to the LORD;\n let us acclaim the Rock of our salvation.\nLet us come into his presence with thanksgiving;\n let us joyfully sing psalms to him.\nR. If today you hear his voice, harden not your hearts.\nCome, let us bow down in worship;\n let us kneel before the LORD who made us.\nFor he is our God,\n and we are the people he shepherds, the flock he guides.\nR. If today you hear his voice, harden not your hearts.\nOh, that today you would hear his voice:\n \"Harden not your hearts as at Meribah,\n as in the day of Massah in the desert,\nWhere your fathers tempted me;\n they tested me though they had seen my works.\"\nR. If today you hear his voice, harden not your hearts.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/95?1",
                                "text": "Psalm 95:1-2, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "That is why I am reminding you now to fan into a flame the gift of God that you possess through the laying on of my hands. God did not give us a spirit of timidity, but the Spirit of power and love and self-control.Keep as your pattern the sound teaching you have heard from me, in the faith and love that are in Christ Jesus.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/1?6",
                                "text": "2 Timothy 1:6-8, 13-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe word of the Lord remains forever.\nThis is the word that has been proclaimed to you.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Peter",
                                "link": "https://bible.usccb.org/bible/1Peter/1?25",
                                "text": "1 Peter 1:25"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "The apostles said to the Lord, 'Increase our faith.' The Lord replied, 'If you had faith like a mustard seed you could say to this mulberry tree, \"Be uprooted and planted in the sea,\" and it would obey you. 'Which of you, with a servant ploughing or minding sheep, would say to him when he returned from the fields, \"Come and have your meal at once\"? Would he not be more likely to say, \"Get my supper ready; fasten your belt and wait on me while I eat and drink. You yourself can eat and drink afterwards\"? Must he be grateful to the servant for doing what he was told?",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/17?5",
                                "text": "Luke 17:5-10"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-seventh Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/100525.cfm"
    },
    {
        "date": "2025-10-12",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "So he went down and immersed himself seven times in the Jordan, as Elisha had told him to do. And his flesh became clean once more like the flesh of a little child. Returning to Elisha with his whole escort, he went in and, presenting himself, said, 'Now I know that there is no God anywhere on earth except in Israel. Now, please, accept a present from your servant.' But Elisha replied, 'As Yahweh lives, whom I serve, I will accept nothing.' Naaman pressed him to accept, but he refused.",
                        "verses": [
                            {
                                "book": "2 Kings",
                                "link": "https://bible.usccb.org/bible/2kings/5?14",
                                "text": "2 Kings 5:14-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 2b) The Lord has revealed to the nations his saving power.\nSing to the LORD a new song,\nfor he has done wondrous deeds;\nhis right hand has won victory for him,\nhis holy arm.\nR. The Lord has revealed to the nations his saving power.\nThe LORD has made his salvation known:\nin the sight of the nations he has revealed his justice.\nHe has remembered his kindness and his faithfulness\ntoward the house of Israel.\nR. The Lord has revealed to the nations his saving power.\nAll the ends of the earth have seen\nthe salvation by our God.\nSing joyfully to the LORD, all you lands:\nbreak into song; sing praise.\nR. The Lord has revealed to the nations his saving power.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/98?1",
                                "text": "Psalm 98:1, 2-3, 3-4"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Remember the gospel that I carry, 'Jesus Christ risen from the dead, sprung from the race of David'; it is on account of this that I have to put up with suffering, even to being chained like a criminal. But God's message cannot be chained up. So I persevere for the sake of those who are chosen, so that they, too, may obtain the salvation that is in Christ Jesus with eternal glory. Here is a saying that you can rely on: If we have died with him, then we shall live with him. If we persevere, then we shall reign with him. If we disown him, then he will disown us.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/2?8",
                                "text": "2 Timothy 2:8-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nIn all circumstances, give thanks,\nfor this is the will of God for you in Christ Jesus.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Thessalonians",
                                "link": "https://bible.usccb.org/bible/1thessalonians/5?18",
                                "text": "1 Thessalonians 5:18"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Now it happened that on the way to Jerusalem he was travelling in the borderlands of Samaria and Galilee. As he entered one of the villages, ten men suffering from a virulent skin-disease came to meet him. They stood some way off and called to him, 'Jesus! Master! Take pity on us.' When he saw them he said, 'Go and show yourselves to the priests.' Now as they were going away they were cleansed. Finding himself cured, one of them turned back praising God at the top of his voice and threw himself prostrate at the feet of Jesus and thanked him. The man was a Samaritan. This led Jesus to say, 'Were not all ten made clean? The other nine, where are they? It seems that no one has come back to give praise to God, except this foreigner.'",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/17?11",
                                "text": "Luke 17:11-19"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-eighth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/101225.cfm"
    },
    {
        "date": "2025-10-19",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The Amalekites then came and attacked Israel at Rephidim. Moses said to Joshua, 'Pick some men and tomorrow morning go out and engage Amalek. I, for my part, shall take my stand on the hilltop with the staff of God in my hand.' Joshua did as Moses had told him and went out to engage Amalek, while Moses, Aaron and Hur went up to the top of the hill. As long as Moses kept his arms raised, Israel had the advantage; when he let his arms fall, the advantage went to Amalek. But Moses' arms grew heavy, so they took a stone and put it under him and on this he sat, with Aaron and Hur supporting his arms on each side. Thus his arms remained unwavering till sunset,",
                        "verses": [
                            {
                                "book": "Exodus",
                                "link": "https://bible.usccb.org/bible/Exodus/17?8",
                                "text": "Exodus 17:8-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(cf. 2)  Our help is from the Lord, who made heaven and earth.\nI lift up my eyes toward the mountains;\nwhence shall help come to me?\nMy help is from the LORD,\nwho made heaven and earth.\nR. Our help is from the Lord, who made heaven and earth.\nMay he not suffer your foot to slip;\nmay he slumber not who guards you:\nindeed he neither slumbers nor sleeps,\nthe guardian of Israel.\nR. Our help is from the Lord, who made heaven and earth.\nThe LORD is your guardian; the LORD is your shade;\nhe is beside you at your right hand.\nThe sun shall not harm you by day,\nnor the moon by night.\nR. Our help is from the Lord, who made heaven and earth.\nThe LORD will guard you from all evil;\nhe will guard your life.\nThe LORD will guard your coming and your going,\nboth now and forever.\nR. Our help is from the Lord, who made heaven and earth.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/121?1",
                                "text": "Psalm 121:1-2, 3-4, 5-6, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/3?14",
                                "text": "2 Timothy 3:14-4:2"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe word of God is living and effective,\ndiscerning reflections and thoughts of the heart.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/1",
                                "text": "Hebrews 4:12"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Then he told them a parable about the need to pray continually and never lose heart. 'There was a judge in a certain town,' he said, 'who had neither fear of God nor respect for anyone. In the same town there was also a widow who kept on coming to him and saying, \"I want justice from you against my enemy!\" For a long time he refused, but at last he said to himself, \"Even though I have neither fear of God nor respect for any human person, I must give this widow her just rights since she keeps pestering me, or she will come and slap me in the face.\" ' And the Lord said, 'You notice what the unjust judge has to say? Now, will not God see justice done to his elect if they keep calling to him day and night even though he still delays to help them?",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/18?1",
                                "text": "Luke 18:1-8"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-ninth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/101925.cfm"
    },
    {
        "date": "2025-10-26",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "for the Lord is a judge who is utterly impartial. He never shows partiality to the detriment of the poor, he listens to the plea of the injured party.The fullness of wisdom is to fear the Lord; she intoxicates them with her fruits; she fills their entire house with treasures and their storerooms with her produce.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/Sirach/35?12",
                                "text": "Sirach 35:12-14, 16-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (7a)  The Lord hears the cry of the poor.\nI will bless the LORD at all times;\nhis praise shall be ever in my mouth.\nLet my soul glory in the LORD;\nthe lowly will hear me and be glad.\nR. The Lord hears the cry of the poor.\nThe LORD confronts the evildoers,\nto destroy remembrance of them from the earth.\nWhen the just cry out, the LORD hears them,\nand from all their distress he rescues them.\nR. The Lord hears the cry of the poor.\nThe LORD is close to the brokenhearted;\nand those who are crushed in spirit he saves.\nThe LORD redeems the lives of his servants;\nno one incurs guilt who takes refuge in him.\nR. The Lord hears the cry of the poor.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/34?2",
                                "text": "Psalm 34:2-3, 17-18, 19, 23"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "As for me, my life is already being poured away as a libation, and the time has come for me to depart. I have fought the good fight to the end; I have run the race to the finish; I have kept the faith;I hope the Lord will be kind to all the family of Onesiphorus, because he has often been a comfort to me and has never been ashamed of my chains. On the contrary, as soon as he reached Rome, he searched hard for me and found me.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/4?6",
                                "text": "2 Timothy 4:6-8, 16-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nGod was reconciling the world to himself in Christ,\nand entrusting to us the message of salvation.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/5?19",
                                "text": "2 Corinthians 5:19"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "He spoke the following parable to some people who prided themselves on being upright and despised everyone else, 'Two men went up to the Temple to pray, one a Pharisee, the other a tax collector. The Pharisee stood there and said this prayer to himself, \"I thank you, God, that I am not grasping, unjust, adulterous like everyone else, and particularly that I am not like this tax collector here. I fast twice a week; I pay tithes on all I get.\" The tax collector stood some distance away, not daring even to raise his eyes to heaven; but he beat his breast and said, \"God, be merciful to me, a sinner.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/18?9",
                                "text": "Luke 18:9-14"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Thirtieth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/102625.cfm"
    },
    {
        "date": "2025-11-02",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "But the souls of the upright are in the hands of God, and no torment can touch them. To the unenlightened, they appeared to die, their departure was regarded as disaster, their leaving us like annihilation; but they are at peace. If, as it seemed to us, they suffered punishment, their hope was rich with immortality; slight was their correction, great will their blessings be. God was putting them to the test and has proved them worthy to be with him; he has tested them like gold in a furnace, and accepted them as a perfect burnt offering. At their time of visitation, they will shine out; as sparks run through the stubble, so will they. They will judge nations, rule over peoples, and the Lord will be their king for ever.",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/wisdom/3?1",
                                "text": "Wisdom 3:1-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.    (1) The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nThe LORD is my shepherd; I shall not want.\n    In verdant pastures he gives me repose;\nbeside restful waters he leads me;\n    he refreshes my soul.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nHe guides me in right paths\n    for his name’s sake.\nEven though I walk in the dark valley\n    I fear no evil; for you are at my side\nwith your rod and your staff\n    that give me courage.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nYou spread the table before me\n    in the sight of my foes;\nYou anoint my head with oil;\n    my cup overflows.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nOnly goodness and kindness follow me\n    all the days of my life;\nand I shall dwell in the house of the LORD\n    for years to come.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/23?1",
                                "text": "Psalm 23:1-3a, 3b-4, 5, 6"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "and a hope which will not let us down, because the love of God has been poured into our hearts by the Holy Spirit which has been given to us. When we were still helpless, at the appointed time, Christ died for the godless. You could hardly find anyone ready to die even for someone upright; though it is just possible that, for a really good person, someone might undertake to die. So it is proof of God's own love for us, that Christ died for us while we were still sinners. How much more can we be sure, therefore, that, now that we have been justified by his death, we shall be saved through him from the retribution of God. For if, while we were enemies, we were reconciled to God through the death of his Son, how much more can we be sure that, being now reconciled, we shall be saved by his life.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/5?5",
                                "text": "Romans 5:5-11"
                            }
                        ]
                    },
                    {
                        "text": "You cannot have forgotten that all of us, when we were baptised into Christ Jesus, were baptised into his death. So by our baptism into his death we were buried with him, so that as Christ was raised from the dead by the Father's glorious power, we too should begin living a new life. If we have been joined to him by dying a death like his, so we shall be by a resurrection like his; realising that our former self was crucified with him, so that the self which belonged to sin should be destroyed and we should be freed from the slavery of sin. Someone who has died, of course, no longer has to answer for sin. But we believe that, if we died with Christ, then we shall live with him too.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/6?3",
                                "text": "Romans 6:3-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nCome, you who are blessed by my Father;\ninherit the Kingdom prepared for you from the foundation of the world.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/25?34",
                                "text": "Matthew 25:34"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "On the last day, the great day of the festival, Jesus stood and cried out: 'Let anyone who is thirsty come to me! Let anyone who believes in me come and drink! As scripture says, \"From his heart shall flow streams of living water.\" ' He was speaking of the Spirit which those who believed in him were to receive; for there was no Spirit as yet because Jesus had not yet been glorified.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?37",
                                "text": "John 6:37-40"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Commemoration of All the Faithful Departed",
        "url": "https://bible.usccb.org/bible/readings/110225.cfm"
    },
    {
        "date": "2025-11-09",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "He brought me back to the entrance of the Temple, where a stream flowed eastwards from under the Temple threshold, for the Temple faced east. The water flowed from under the right side of the Temple, south of the altar.Below their wings, they had human hands on all four sides corresponding to their four faces and four wings.Between these living creatures were what looked like blazing coals, like torches, darting backwards and forwards between the living creatures; the fire gave a brilliant light, and lightning flashed from the fire,",
                        "verses": [
                            {
                                "book": "Ezekiel",
                                "link": "https://bible.usccb.org/bible/ezekiel/47?1",
                                "text": "Ezekiel 47:1-2, 8-9, 12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (5) The waters of the river gladden the city of God, the holy dwelling of the Most High!\nGod is our refuge and our strength,\nan ever-present help in distress.\nTherefore, we fear not, though the earth be shaken\nand mountains plunge into the depths of the sea.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!\nThere is a stream whose runlets gladden the city of God,\nthe holy dwelling of the Most High.\nGod is in its midst; it shall not be disturbed;\nGod will help it at the break of dawn.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!\nThe LORD of hosts is with us;\nour stronghold is the God of Jacob.\nCome! behold the deeds of the LORD,\nthe astounding things he has wrought on earth.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/46?2",
                                "text": "Psalm 46:2-3, 5-6, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "After all, we do share in God's work; you are God's farm, God's building. By the grace of God which was given to me, I laid the foundations like a trained master-builder, and someone else is building on them. Now each one must be careful how he does the building.Yes, I did baptise the family of Stephanas, too; but besides these I do not think I baptised anyone.",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1corinthians/3?9",
                                "text": "1 Corinthians 3:9c-11, 16-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI have chosen and consecrated this house, says the Lord,\nthat my name may be there forever.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Chronicles",
                                "link": "https://bible.usccb.org/bible/1chronicles/3?9",
                                "text": "2 Chronicles 7:16"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "When the time of the Jewish Passover was near Jesus went up to Jerusalem, and in the Temple he found people selling cattle and sheep and doves, and the money changers sitting there. Making a whip out of cord, he drove them all out of the Temple, sheep and cattle as well, scattered the money changers' coins, knocked their tables over and said to the dove sellers, 'Take all this out of here and stop using my Father's house as a market.' Then his disciples remembered the words of scripture: I am eaten up with zeal for your house. The Jews intervened and said, 'What sign can you show us that you should act like this?' Jesus answered, 'Destroy this Temple, and in three days I will raise it up.' The Jews replied, 'It has taken forty-six years to build this Temple: are you going to raise it up again in three days?' But he was speaking of the Temple that was his body,",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/2?13",
                                "text": "John 2:13-22"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Dedication of the Lateran Basilica in Rome",
        "url": "https://bible.usccb.org/bible/readings/110925.cfm"
    },
    {
        "date": "2025-11-16",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "",
                        "verses": [
                            {
                                "book": "Malachi",
                                "link": "https://bible.usccb.org/bible/Malachi/3?19",
                                "text": "Malachi 3:19-20a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 9)  The Lord comes to rule the earth with justice.\nSing praise to the LORD with the harp,\nwith the harp and melodious song.\nWith trumpets and the sound of the horn\nsing joyfully before the King, the LORD.\nR. The Lord comes to rule the earth with justice.\nLet the sea and what fills it resound,\nthe world and those who dwell in it;\nlet the rivers clap their hands,\nthe mountains shout with them for joy.\nR. The Lord comes to rule the earth with justice.\nBefore the LORD, for he comes,\nfor he comes to rule the earth,\nhe will rule the world with justice\nand the peoples with equity.\nR. The Lord comes to rule the earth with justice.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/98?5",
                                "text": "Psalm 98:5-6, 7-8, 9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "You know how you should take us as your model: we were not undisciplined when we were with you, nor did we ever accept food from anyone without paying for it; no, we worked with unsparing energy, night and day, so as not to be a burden on any of you. This was not because we had no right to be, but in order to make ourselves a model for you to imitate. We urged you when we were with you not to let anyone eat who refused to work. Now we hear that there are some of you who are living lives without any discipline, doing no work themselves but interfering with other people's.",
                        "verses": [
                            {
                                "book": "2 Thessalonians",
                                "link": "https://bible.usccb.org/bible/2thessalonians/3?7",
                                "text": "2 Thessalonians 3:7-12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nStand erect and raise your heads\nbecause your redemption is at hand.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/21?28",
                                "text": "Luke 21:28"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "When some were talking about the Temple, remarking how it was adorned with fine stonework and votive offerings, he said, 'All these things you are staring at now -- the time will come when not a single stone will be left on another; everything will be destroyed.' And they put to him this question, 'Master,' they said, 'when will this happen, then, and what sign will there be that it is about to take place?' But he said, 'Take care not to be deceived, because many will come using my name and saying, \"I am the one\" and \"The time is near at hand.\" Refuse to join them. And when you hear of wars and revolutions, do not be terrified, for this is something that must happen first, but the end will not come at once.' Then he said to them, 'Nation will fight against nation, and kingdom against kingdom. There will be great earthquakes and plagues and famines in various places; there will be terrifying events and great signs from heaven. 'But before all this happens, you will be seized and persecuted; you will be handed over to the synagogues and to imprisonment, and brought before kings and governors for the sake of my name -and that will be your opportunity to bear witness. Make up your minds not to prepare your defence, because I myself shall give you an eloquence and a wisdom that none of your opponents will be able to resist or contradict. You will be betrayed even by parents and brothers, relations and friends; and some of you will be put to death. You will be hated universally on account of my name, but not a hair of your head will be lost.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/21?5",
                                "text": "Luke 21:5-19"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Thirty-third Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/111625.cfm"
    },
    {
        "date": "2025-11-23",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "All the tribes of Israel then came to David at Hebron and said, 'Look, we are your own flesh and bone. In days past when Saul was our king, it was you who led Israel on its campaigns, and to you it was that Yahweh promised, \"You are to shepherd my people Israel and be leader of Israel.\" '",
                        "verses": [
                            {
                                "book": "2 Samuel",
                                "link": "https://bible.usccb.org/bible/2Samuel/5?1",
                                "text": "2 Samuel 5:1-3"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1) Let us go rejoicing to the house of the Lord.\nI rejoiced because they said to me,\n\"We will go up to the house of the LORD.\"\nAnd now we have set foot\nwithin your gates, O Jerusalem.\nR. Let us go rejoicing to the house of the Lord.\nJerusalem, built as a city\nwith compact unity.\nTo it the tribes go up,\nthe tribes of the LORD.\nR. Let us go rejoicing to the house of the Lord.\nAccording to the decree for Israel,\nto give thanks to the name of the LORD.\nIn it are set up judgment seats,\nseats for the house of David.\nR. Let us go rejoicing to the house of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/122?1",
                                "text": "Psalm 122:1-2, 3-4, 4-5"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "giving thanks with joy to the Father who has made you able to share the lot of God's holy people and with them to inherit the light. Because that is what he has done. It is he who has rescued us from the ruling force of darkness and transferred us to the kingdom of the Son that he loves, and in him we enjoy our freedom, the forgiveness of sin. He is the image of the unseen God, the first-born of all creation, for in him were created all things in heaven and on earth: everything visible and everything invisible, thrones, ruling forces, sovereignties, powers -- all things were created through him and for him. He exists before all things and in him all things hold together, and he is the Head of the Body, that is, the Church. He is the Beginning, the first-born from the dead, so that he should be supreme in every way; because God wanted all fullness to be found in him",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?12",
                                "text": "Colossians 1:12-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed is he who comes in the name of the Lord!\nBlessed is the kingdom of our father David that is to come!\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Mark",
                                "link": "https://bible.usccb.org/bible/mark/11?9",
                                "text": "Mark 11:9, 10"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "The people stayed there watching. As for the leaders, they jeered at him with the words, 'He saved others, let him save himself if he is the Christ of God, the Chosen One.' The soldiers mocked him too, coming up to him, offering him vinegar, and saying, 'If you are the king of the Jews, save yourself.' Above him there was an inscription: 'This is the King of the Jews'. One of the criminals hanging there abused him: 'Are you not the Christ? Save yourself and us as well.' But the other spoke up and rebuked him. 'Have you no fear of God at all?' he said. 'You got the same sentence as he did, but in our case we deserved it: we are paying for what we did. But this man has done nothing wrong.' Then he said, 'Jesus, remember me when you come into your kingdom.'",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/23?35",
                                "text": "Luke 23:35-43"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of Our Lord Jesus Christ, King of the Universe",
        "url": "https://bible.usccb.org/bible/readings/112325.cfm"
    },
    {
        "date": "2025-11-30",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The vision of Isaiah son of Amoz, concerning Judah and Jerusalem. It will happen in the final days that the mountain of Yahweh's house will rise higher than the mountains and tower above the heights. Then all the nations will stream to it, many peoples will come to it and say, 'Come, let us go up to the mountain of Yahweh, to the house of the God of Jacob that he may teach us his ways so that we may walk in his paths.' For the Law will issue from Zion and the word of Yahweh from Jerusalem. Then he will judge between the nations and arbitrate between many peoples. They will hammer their swords into ploughshares and their spears into sickles. Nation will not lift sword against nation, no longer will they learn how to make war.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/2?1",
                                "text": "Isaiah 2:1-5"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. Let us go rejoicing to the house of the Lord.\nI rejoiced because they said to me,\n\"We will go up to the house of the LORD.\"\nAnd now we have set foot\nwithin your gates, O Jerusalem.\nR. Let us go rejoicing to the house of the Lord.\nJerusalem, built as a city\nwith compact unity.\nTo it the tribes go up,\nthe tribes of the LORD.\nR. Let us go rejoicing to the house of the Lord.\nAccording to the decree for Israel,\nto give thanks to the name of the LORD.\nIn it are set up judgment seats,\nseats for the house of David.\nR. Let us go rejoicing to the house of the Lord.\nPray for the peace of Jerusalem!\nMay those who love you prosper!\nMay peace be within your walls,\nprosperity in your buildings.\nR. Let us go rejoicing to the house of the Lord.\nBecause of my brothers and friends\nI will say, \"Peace be within you!\"\nBecause of the house of the LORD, our God,\nI will pray for your good.\nR. Let us go rejoicing to the house of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/122?1",
                                "text": "Psalm 122: 1-2, 3-4, 4-5, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Besides, you know the time has come; the moment is here for you to stop sleeping and wake up, because by now our salvation is nearer than when we first began to believe. The night is nearly over, daylight is on the way; so let us throw off everything that belongs to the darkness and equip ourselves for the light. Let us live decently, as in the light of day; with no orgies or drunkenness, no promiscuity or licentiousness, and no wrangling or jealousy.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/13?11",
                                "text": "Romans 13:11-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nShow us Lord, your love;\nand grant us your salvation.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/85?8",
                                "text": "Cf. Psalm 85:8"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "'As it was in Noah's day, so will it be when the Son of man comes. For in those days before the Flood people were eating, drinking, taking wives, taking husbands, right up to the day Noah went into the ark, and they suspected nothing till the Flood came and swept them all away. This is what it will be like when the Son of man comes. Then of two men in the fields, one is taken, one left; of two women grinding at the mill, one is taken, one left. 'So stay awake, because you do not know the day when your master is coming. You may be quite sure of this, that if the householder had known at what time of the night the burglar would come, he would have stayed awake and would not have allowed anyone to break through the wall of his house.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/24?37",
                                "text": "Matthew 24:37-44"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "First Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/113025.cfm"
    },
    {
        "date": "2025-12-07",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "A shoot will spring from the stock of Jesse, a new shoot will grow from his roots. On him will rest the spirit of Yahweh, the spirit of wisdom and insight, the spirit of counsel and power, the spirit of knowledge and fear of Yahweh: his inspiration will lie in fearing Yahweh. His judgement will not be by appearances. his verdict not given on hearsay. He will judge the weak with integrity and give fair sentence for the humblest in the land. He will strike the country with the rod of his mouth and with the breath of his lips bring death to the wicked. Uprightness will be the belt around his waist, and constancy the belt about his hips. The wolf will live with the lamb, the panther lie down with the kid, calf, lion and fat-stock beast together, with a little boy to lead them. The cow and the bear will graze, their young will lie down together. The lion will eat hay like the ox. The infant will play over the den of the adder; the baby will put his hand into the viper's lair. No hurt, no harm will be done on all my holy mountain, for the country will be full of knowledge of Yahweh as the waters cover the sea.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/11?1",
                                "text": "Isaiah 11:1-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 7)  Justice shall flourish in his time, and fullness of peace for ever.\nO God, with your judgment endow the king,\nand with your justice, the king's son;\nhe shall govern your people with justice\nand your afflicted ones with judgment.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nJustice shall flower in his days,\nand profound peace, till the moon be no more.\nMay he rule from sea to sea,\nand from the River to the ends of the earth.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nFor he shall rescue the poor when he cries out,\nand the afflicted when he has no one to help him.\nHe shall have pity for the lowly and the poor;\nthe lives of the poor he shall save.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nMay his name be blessed forever;\nas long as the sun his name shall remain.\nIn him shall all the tribes of the earth be blessed;\nall the nations shall proclaim his happiness.\nR. Justice shall flourish in his time, and fullness of peace for ever.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/72?1",
                                "text": "Psalm 72:1-2, 7-8, 12-13, 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "And all these things which were written so long ago were written so that we, learning perseverance and the encouragement which the scriptures give, should have hope. Now the God of perseverance and encouragement give you all the same purpose, following the example of Christ Jesus, so that you may together give glory to the God and Father of our Lord Jesus Christ with one heart. Accept one another, then, for the sake of God's glory, as Christ accepted you. I tell you that Christ's work was to serve the circumcised, fulfilling the truthfulness of God by carrying out the promises made to the fathers,",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/15?4",
                                "text": "Romans 15:4-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nPrepare the way of the Lord, make straight his paths:\nall flesh shall see the salvation of God.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/3?4",
                                "text": "Luke 3:4, 6"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "In due course John the Baptist appeared; he proclaimed this message in the desert of Judaea, 'Repent, for the kingdom of Heaven is close at hand.' This was the man spoken of by the prophet Isaiah when he said: A voice of one that cries in the desert, 'Prepare a way for the Lord, make his paths straight.' This man John wore a garment made of camel-hair with a leather loin-cloth round his waist, and his food was locusts and wild honey. Then Jerusalem and all Judaea and the whole Jordan district made their way to him, and as they were baptised by him in the river Jordan they confessed their sins. But when he saw a number of Pharisees and Sadducees coming for baptism he said to them, 'Brood of vipers, who warned you to flee from the coming retribution? Produce fruit in keeping with repentance, and do not presume to tell yourselves, \"We have Abraham as our father,\" because, I tell you, God can raise children for Abraham from these stones. Even now the axe is being laid to the root of the trees, so that any tree failing to produce good fruit will be cut down and thrown on the fire. I baptise you in water for repentance, but the one who comes after me is more powerful than I, and I am not fit to carry his sandals; he will baptise you with the Holy Spirit and fire.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/3?1",
                                "text": "Matthew 3:1-12"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Second Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/120725.cfm"
    },
    {
        "date": "2025-12-14",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Let the desert and the dry lands be glad, let the wasteland rejoice and bloom; like the asphodel, let it burst into flower, let it rejoice and sing for joy. The glory of Lebanon is bestowed on it, the splendour of Carmel and Sharon; then they will see the glory of Yahweh, the splendour of our God. Strengthen all weary hands, steady all trembling knees and say to the faint-hearted, 'Be strong! Do not be afraid. Here is your God, vengeance is coming, divine retribution; he is coming to save you.' Then the eyes of the blind will be opened, the ears of the deaf unsealed,'What are your endless sacrifices to me?' says Yahweh. 'I am sick of burnt offerings of rams and the fat of calves. I take no pleasure in the blood of bulls and lambs and goats.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/35?1",
                                "text": "Isaiah 35:1-6a, 10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. Is 35:4)  Lord, come and save us.\nor:\nR. Alleluia.\nThe LORD God keeps faith forever,\nsecures justice for the oppressed,\ngives food to the hungry.\nThe LORD sets captives free.\nR. Lord, come and save us.\nor:\nR. Alleluia.\nThe LORD gives sight to the blind;\nthe LORD raises up those who were bowed down.\nThe LORD loves the just;\nthe LORD protects strangers.\nR. Lord, come and save us.\nor:\nR. Alleluia.\nThe fatherless and the widow he sustains,\nbut the way of the wicked he thwarts.\nThe LORD shall reign forever;\nyour God, O Zion, through all generations.\nR. Lord, come and save us.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/146?6",
                                "text": "Psalm 146:6-7, 8-9, 9-10."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Now be patient, brothers, until the Lord's coming. Think of a farmer: how patiently he waits for the precious fruit of the ground until it has had the autumn rains and the spring rains! You too must be patient; do not lose heart, because the Lord's coming will be soon. Do not make complaints against one another, brothers, so as not to be brought to judgement yourselves; the Judge is already to be seen waiting at the gates.",
                        "verses": [
                            {
                                "book": "James",
                                "link": "https://bible.usccb.org/bible/james/5?7",
                                "text": "James 5:7-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe Spirit of the Lord is upon me,\nbecause he has anointed me\nto bring glad tidings to the poor.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/61?1",
                                "text": "Isaiah 61:1 (cited in Lk 4:18)"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Now John had heard in prison what Christ was doing and he sent his disciples to ask him, 'Are you the one who is to come, or are we to expect someone else?' Jesus answered, 'Go back and tell John what you hear and see; the blind see again, and the lame walk, those suffering from virulent skin-diseases are cleansed, and the deaf hear, the dead are raised to life and the good news is proclaimed to the poor; and blessed is anyone who does not find me a cause of falling.' As the men were leaving, Jesus began to talk to the people about John, 'What did you go out into the desert to see? A reed swaying in the breeze? No? Then what did you go out to see? A man wearing fine clothes? Look, those who wear fine clothes are to be found in palaces. Then what did you go out for? To see a prophet? Yes, I tell you, and much more than a prophet: he is the one of whom scripture says: Look, I am going to send my messenger in front of you to prepare your way before you.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/11?2",
                                "text": "Matthew 11:2-11"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Third Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/121425.cfm"
    },
    {
        "date": "2025-12-21",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Yahweh spoke to Ahaz again and said: Ask Yahweh your God for a sign, either in the depths of Sheol or in the heights above. But Ahaz said, 'I will not ask. I will not put Yahweh to the test.' He then said: Listen now, House of David: are you not satisfied with trying human patience that you should try my God's patience too?",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/7?10",
                                "text": "Isaiah 7:10-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (7c and 10b) Let the Lord enter; he is king of glory.\nThe LORD's are the earth and its fullness;\nthe world and those who dwell in it.\nFor he founded it upon the seas\nand established it upon the rivers.\nR. Let the Lord enter; he is king of glory.\nWho can ascend the mountain of the LORD?\nor who may stand in his holy place?\nOne whose hands are sinless, whose heart is clean,\nwho desires not what is vain.\nR. Let the Lord enter; he is king of glory.\nHe shall receive a blessing from the LORD,\na reward from God his savior.\nSuch is the race that seeks for him,\nthat seeks the face of the God of Jacob.\nR. Let the Lord enter; he is king of glory.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/24?1",
                                "text": "Psalm 24:1-2, 3-4, 5-6."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "From Paul, a servant of Christ Jesus, called to be an apostle, set apart for the service of the gospel that God promised long ago through his prophets in the holy scriptures. This is the gospel concerning his Son who, in terms of human nature was born a descendant of David and who, in terms of the Spirit and of holiness, was designated Son of God in power by resurrection from the dead: Jesus Christ, our Lord, through whom we have received grace and our apostolic mission of winning the obedience of faith among all the nations for the honour of his name. You are among these, and by his call you belong to Jesus Christ.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/1?1",
                                "text": "Romans 1:1-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe virgin shall conceive, and bear a son,\nand they shall name him Emmanuel.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/1?23",
                                "text": "Matthew 1:23"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "This is how Jesus Christ came to be born. His mother Mary was betrothed to Joseph; but before they came to live together she was found to be with child through the Holy Spirit. Her husband Joseph, being an upright man and wanting to spare her disgrace, decided to divorce her informally. He had made up his mind to do this when suddenly the angel of the Lord appeared to him in a dream and said, 'Joseph son of David, do not be afraid to take Mary home as your wife, because she has conceived what is in her by the Holy Spirit. She will give birth to a son and you must name him Jesus, because he is the one who is to save his people from their sins.' Now all this took place to fulfil what the Lord had spoken through the prophet: Look! the virgin is with child and will give birth to a son whom they will call Immanuel, a name which means 'God-is-with-us'.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/1?18",
                                "text": "Matthew 1:18-24"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fourth Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/122125.cfm"
    },
    {
        "date": "2025-12-28",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "for the Lord honours the father above his children and upholds the rights of a mother over her sons. Whoever respects a father expiates sins, whoever honours a mother is like someone amassing a fortune. Whoever respects a father will in turn be happy with children, the day he prays for help, he will be heard.The fear of the Lord gladdens the heart, giving happiness, joy and long life. For those who fear the Lord, all will end well: on their dying day they will be blessed.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/sirach/3?2",
                                "text": "Sirach 3:2-6, 12-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1)  Blessed are those who fear the Lord and walk in his ways.\nBlessed is everyone who fears the LORD,\n   who walks in his ways!\nFor you shall eat the fruit of your handiwork;\n   blessed shall you be, and favored.\nR. Blessed are those who fear the Lord and walk in his ways.\nYour wife shall be like a fruitful vine\n   in the recesses of your home;\nyour children like olive plants\n   around your table.\nR. Blessed are those who fear the Lord and walk in his ways.\nBehold, thus is the man blessed\n   who fears the LORD.\nThe LORD bless you from Zion:\n   may you see the prosperity of Jerusalem\n   all the days of your life.\nR. Blessed are those who fear the Lord and walk in his ways.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/128?1",
                                "text": "Psalm 128:1-2, 3, 4-5."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "As the chosen of God, then, the holy people whom he loves, you are to be clothed in heartfelt compassion, in generosity and humility, gentleness and patience. Bear with one another; forgive each other if one of you has a complaint against another. The Lord has forgiven you; now you must do the same. Over all these clothes, put on love, the perfect bond. And may the peace of Christ reign in your hearts, because it is for this that you were called together in one body. Always be thankful. Let the Word of Christ, in all its richness, find a home with you. Teach each other, and advise each other, in all wisdom. With gratitude in your hearts sing psalms and hymns and inspired songs to God; and whatever you say or do, let it be in the name of the Lord Jesus, in thanksgiving to God the Father through him. Wives, be subject to your husbands, as you should in the Lord. Husbands, love your wives and do not be sharp with them. Children, be obedient to your parents always, because that is what will please the Lord.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?12",
                                "text": "Colossians 3:12-21"
                            }
                        ]
                    },
                    {
                        "text": "As the chosen of God, then, the holy people whom he loves, you are to be clothed in heartfelt compassion, in generosity and humility, gentleness and patience. Bear with one another; forgive each other if one of you has a complaint against another. The Lord has forgiven you; now you must do the same. Over all these clothes, put on love, the perfect bond. And may the peace of Christ reign in your hearts, because it is for this that you were called together in one body. Always be thankful. Let the Word of Christ, in all its richness, find a home with you. Teach each other, and advise each other, in all wisdom. With gratitude in your hearts sing psalms and hymns and inspired songs to God;",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?12",
                                "text": "Colossians 3:12-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet the peace of Christ control your hearts;\nLet the word of Christ dwell in you richly.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?15",
                                "text": "Colossians 3:15a, 16a"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "and Jacob fathered Joseph the husband of Mary; of her was born Jesus who is called Christ.Her husband Joseph, being an upright man and wanting to spare her disgrace, decided to divorce her informally. He had made up his mind to do this when suddenly the angel of the Lord appeared to him in a dream and said, 'Joseph son of David, do not be afraid to take Mary home as your wife, because she has conceived what is in her by the Holy Spirit. She will give birth to a son and you must name him Jesus, because he is the one who is to save his people from their sins.' Now all this took place to fulfil what the Lord had spoken through the prophet:",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/2?13",
                                "text": "Mt 2:13-15, 19-23"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Holy Family of Jesus, Mary and Joseph",
        "url": "https://bible.usccb.org/bible/readings/122825.cfm"
    }
]