[
{"1": " Alexander of Macedon son of Philip had come from the land of Kittim and defeated Darius king of the Persians and Medes, whom he succeeded as ruler, at first of Hellas.", "2": " He undertook many campaigns, gained possession of many fortresses, and put the local kings to death.", "3": " So he advanced to the ends of the earth, plundering nation after nation; the earth grew silent before him, and his ambitious heart swelled with pride.", "4": " He assembled very powerful forces and subdued provinces, nations and princes, and they became his tributaries.", "5": " But the time came when Alexander took to his bed, in the knowledge that he was dying.", "6": " He summoned his officers, noblemen who had been brought up with him from his youth, and divided his kingdom among them while he was still alive.", "7": " Alexander had reigned twelve years when he died.", "8": " Each of his officers established himself in his own region.", "9": " All assumed crowns after his death, they and their heirs after them for many years, bringing increasing evils on the world.", "10": " From these there grew a wicked offshoot, Antiochus Epiphanes son of King Antiochus; once a hostage in Rome, he became king in the 107th year of the kingdom of the Greeks.", "11": " It was then that there emerged from Israel a set of renegades who led many people astray. 'Come,' they said, 'let us ally ourselves with the gentiles surrounding us, for since we separated ourselves from them many misfortunes have overtaken us.'", "12": " This proposal proved acceptable,", "13": " and a number of the people eagerly approached the king, who authorised them to practise the gentiles' observances.", "14": " So they built a gymnasium in Jerusalem, such as the gentiles have,", "15": " disguised their circumcision, and abandoned the holy covenant, submitting to gentile rule as willing slaves of impiety.", "16": " Once Antiochus had seen his authority established, he determined to make himself king of Egypt and the ruler of both kingdoms.", "17": " He invaded Egypt in massive strength, with chariots and elephants (and cavalry) and a large fleet.", "18": " He engaged Ptolemy king of Egypt in battle, and Ptolemy turned back and fled before his advance, leaving many casualties.", "19": " The fortified cities of Egypt were captured, and Antiochus plundered the country.", "20": " After his conquest of Egypt, in the year 143, Antiochus turned about and advanced on Israel and Jerusalem in massive strength.", "21": " Insolently breaking into the sanctuary, he removed the golden altar and the lamp-stand for the light with all its fittings,", "22": " together with the table for the loaves of permanent offering, the libation vessels, the cups, the golden censers, the veil, the crowns, and the golden decoration on the front of the Temple, which he stripped of everything.", "23": " He made off with the silver and gold and precious vessels; he discovered the secret treasures and seized them", "24": " and, removing all these, he went back to his own country, having shed much blood and uttered words of extreme arrogance.", "25": " There was deep mourning for Israel throughout the country:", "26": " Rulers and elders groaned; girls and young men wasted away; the women's beauty suffered a change;", "27": " every bridegroom took up a dirge, the bride sat grief-stricken on her marriage-bed.", "28": " The earth quaked because of its inhabitants and the whole House of Jacob was clothed with shame.", "29": " Two years later the king sent the Mysarch through the cities of Judah. He came to Jerusalem with an impressive force,", "30": " and addressing them with what appeared to be peaceful words, he gained their confidence; then suddenly he fell on the city, dealing it a terrible blow, and destroying many of the people of Israel.", "31": " He pillaged the city and set it on fire, tore down its houses and encircling wall,", "32": " took the women and children captive and commandeered the cattle.", "33": " They then rebuilt the City of David with a great strong wall and strong towers and made this their Citadel.", "34": " There they installed a brood of sinners, of renegades, who fortified themselves inside it,", "35": " storing arms and provisions, and depositing there the loot they had collected from Jerusalem; they were to prove a great trouble.", "36": " It became an ambush for the sanctuary, an evil adversary for Israel at all times.", "37": " They shed innocent blood all round the sanctuary and defiled the sanctuary itself.", "38": " The citizens of Jerusalem fled because of them, she became a dwelling-place of strangers; estranged from her own offspring, her children forsook her.", "39": " Her sanctuary became as forsaken as a desert, her feasts were turned into mourning, her Sabbaths into a mockery, her honour into reproach.", "40": " Her dishonour now fully matched her former glory, her greatness was turned into grief.", "41": " The king then issued a proclamation to his whole kingdom that all were to become a single people, each nation renouncing its particular customs.", "42": " All the gentiles conformed to the king's decree,", "43": " and many Israelites chose to accept his religion, sacrificing to idols and profaning the Sabbath.", "44": " The king also sent edicts by messenger to Jerusalem and the towns of Judah, directing them to adopt customs foreign to the country,", "45": " banning burnt offerings, sacrifices and libations from the sanctuary, profaning Sabbaths and feasts,", "46": " defiling the sanctuary and everything holy,", "47": " building altars, shrines and temples for idols, sacrificing pigs and unclean beasts,", "48": " leaving their sons uncircumcised, and prostituting themselves to all kinds of impurity and abomination,", "49": " so that they should forget the Law and revoke all observance of it.", "50": " Anyone not obeying the king's command was to be put to death.", "51": " Writing in such terms to every part of his kingdom, the king appointed inspectors for the whole people and directed all the towns of Judah to offer sacrifice city by city.", "52": " Many of the people -- that is, every apostate from the Law -- rallied to them and so committed evil in the country,", "53": " forcing Israel into hiding in any possible place of refuge.", "54": " On the fifteenth day of Chislev in the year 145 the king built the appalling abomination on top of the altar of burnt offering; and altars were built in the surrounding towns of Judah", "55": " and incense offered at the doors of houses and in the streets.", "56": " Any books of the Law that came to light were torn up and burned.", "57": " Whenever anyone was discovered possessing a copy of the covenant or practising the Law, the king's decree sentenced him to death.", "58": " Month after month they took harsh action against any offenders they discovered in the towns of Israel.", "59": " On the twenty-fifth day of each month, sacrifice was offered on the altar erected on top of the altar of burnt offering.", "60": " Women who had had their children circumcised were put to death according to the edict", "61": " with their babies hung round their necks, and the members of their household and those who had performed the circumcision were executed with them.", "62": " Yet there were many in Israel who stood firm and found the courage to refuse unclean food.", "63": " They chose death rather than contamination by such fare or profanation of the holy covenant, and they were executed.", "64": " It was a truly dreadful retribution that visited Israel."},
{"1": " About then, Mattathias son of John, son of Simeon, a priest of the line of Joarib, left Jerusalem and settled in Modein.", "2": " He had five sons, John known as Gaddi,", "3": " Simon called Thassi,", "4": " Judas called Maccabaeus,", "5": " Eleazar, called Avaran, and Jonathan called Apphus.", "6": " When he saw the blasphemies being committed in Judah and Jerusalem,", "7": " he said, 'Alas that I should have been born to witness the ruin of my people and the ruin of the Holy City, and to sit by while she is delivered over to her enemies, and the sanctuary into the hand of foreigners.", "8": " 'Her Temple has become like someone of no repute,", "9": " the vessels that were her glory have been carried off as booty, her babies have been slaughtered in her streets, her young men by the enemy's sword.", "10": " Is there a nation that has not claimed a share of her royal prerogatives, that has not taken some of her spoils?", "11": " All her ornaments have been snatched from her, her former freedom has become slavery.", "12": " See how the Holy Place, our beauty, our glory, is now laid waste, see how the gentiles have profaned it!", "13": " What have we left to live for?'", "14": " Mattathias and his sons tore their garments, put on sackcloth, and observed deep mourning.", "15": " The king's commissioners who were enforcing the apostasy came to the town of Modein for the sacrifices.", "16": " Many Israelites gathered round them, but Mattathias and his sons drew apart.", "17": " The king's commissioners then addressed Mattathias as follows, 'You are a respected leader, a great man in this town; you have sons and brothers to support you.", "18": " Be the first to step forward and conform to the king's decree, as all the nations have done, and the leaders of Judah and the survivors in Jerusalem; you and your sons shall be reckoned among the Friends of the King, you and your sons will be honoured with gold and silver and many presents.'", "19": " Raising his voice, Mattathias retorted, 'Even if every nation living in the king's dominions obeys him, each forsaking its ancestral religion to conform to his decrees,", "20": " I, my sons and my brothers will still follow the covenant of our ancestors.", "21": " May Heaven preserve us from forsaking the Law and its observances.", "22": " As for the king's orders, we will not follow them: we shall not swerve from our own religion either to right or to left.'", "23": " As he finished speaking, a Jew came forward in the sight of all to offer sacrifice on the altar in Modein as the royal edict required.", "24": " When Mattathias saw this, he was fired with zeal; stirred to the depth of his being, he gave vent to his legitimate anger, threw himself on the man and slaughtered him on the altar.", "25": " At the same time he killed the king's commissioner who was there to enforce the sacrifice, and tore down the altar.", "26": " In his zeal for the Law he acted as Phinehas had against Zimri son of Salu.", "27": " Then Mattathias went through the town, shouting at the top of his voice, 'Let everyone who has any zeal for the Law and takes his stand on the covenant come out and follow me.'", "28": " Then he fled with his sons into the hills, leaving all their possessions behind in the town.", "29": " Many people who were concerned for virtue and justice went down to the desert and stayed there,", "30": " taking with them their sons, their wives and their cattle, so oppressive had their sufferings become.", "31": " Word was brought to the royal officials and forces stationed in Jerusalem, in the City of David, that those who had repudiated the king's edict had gone down to the hiding places in the desert.", "32": " A strong detachment went after them, and when it came up with them ranged itself against them in battle formation, preparing to attack them on the Sabbath day,", "33": " and said, 'Enough of this! Come out and do as the king orders and you will be spared.'", "34": " The others, however, replied, 'We refuse to come out, and we will not obey the king's orders and profane the Sabbath day.'", "35": " The royal forces at once went into action,", "36": " but the others offered no opposition; not a stone was thrown, there was no barricading of the hiding places.", "37": " They only said, 'Let us all die innocent; let heaven and earth bear witness that you are massacring us with no pretence of justice.'", "38": " The attack was pressed home on the Sabbath itself, and they were slaughtered, with their wives and children and cattle, to the number of one thousand persons.", "39": " When the news reached Mattathias and his friends, they mourned them bitterly", "40": " and said to one another, 'If we all do as our brothers have done, and refuse to fight the gentiles for our lives and institutions, they will only destroy us the sooner from the earth.'", "41": " So then and there they came to this decision, 'If anyone attacks us on the Sabbath day, whoever he may be, we shall resist him; we must not all be killed, as our brothers were in the hiding places.'", "42": " Soon they were joined by the Hasidaean party, stout fighting men of Israel, each one a volunteer on the side of the Law.", "43": " All the refugees from the persecution rallied to them, giving them added support.", "44": " They organised themselves into an armed force, striking down the sinners in their anger, and the renegades in their fury, and those who escaped them fled to the gentiles for safety.", "45": " Mattathias and his friends made a tour, overthrowing the altars", "46": " and forcibly circumcising all the boys they found uncircumcised in the territories of Israel.", "47": " They hunted down the upstarts and managed their campaign to good effect.", "48": " They wrested the Law out of the control of the gentiles and the kings and reduced the sinners to impotence.", "49": " As the days of Mattathias were drawing to a close, he said to his sons, 'Arrogance and outrage are now in the ascendant; it is a period of turmoil and bitter hatred.", "50": " This is the time, my children, for you to have a burning zeal for the Law and to give your lives for the covenant of our ancestors.", "51": " Remember the deeds performed by our ancestors, each in his generation, and you will win great honour and everlasting renown.", "52": " Was not Abraham tested and found faithful, was that not considered as justifying him?", "53": " Joseph in the time of his distress maintained the Law, and so became lord of Egypt.", "54": " Phinehas, our father, in return for his burning zeal, received the covenant of everlasting priesthood.", "55": " Joshua, for carrying out his task, became judge of Israel.", "56": " Caleb, for his testimony before the assembled people, received an inheritance in the land.", "57": " David for his generous heart inherited the throne of an everlasting kingdom.", "58": " Elijah for his consuming fervour for the Law was caught up to heaven itself.", "59": " Hananiah, Azariah and Mishael, for their fidelity, were saved from the flame.", "60": " Daniel for his singleness of heart was rescued from the lion's jaws.", "61": " Know then that, generation after generation, no one who hopes in him will be overcome.", "62": " Do not fear the threats of the sinner, all his brave show must come to the dunghill and the worms.", "63": " Exalted today, tomorrow he is nowhere to be found, for he has returned to the dust he came from and his scheming is brought to nothing.", "64": " My children, be resolute and courageous for the Law, for it will bring you glory.", "65": " 'Here is your brother Simeon, I know he is a man of sound judgement. Listen to him all your lives; let him take your father's place.", "66": " Judas Maccabaeus, strong and brave from his youth, let him be your general and conduct the war against the gentiles.", "67": " The rest of you are to enrol in your ranks all those who keep the Law, and to assure the vengeance of your people.", "68": " Pay back the gentiles to the full, and hold fast to the ordinance of the Law.'", "69": " Then he blessed them and was joined to his ancestors.", "70": " He died in the year 146 and was buried in his ancestral tomb at Modein, and all Israel mourned him deeply."},
{"1": " His son, Judas, known as Maccabaeus, then took his place.", "2": " All his brothers, and all who had attached themselves to his father, supported him, and they fought for Israel with a will.", "3": " He extended the fame of his people. Like a giant, he put on the breastplate and buckled on his war harness; he engaged in battle after battle, protecting the ranks with his sword.", "4": " He was like a lion in his exploits, like a young lion roaring over its prey.", "5": " He pursued and tracked down the renegades, he consigned those who troubled his people to the flames.", "6": " The renegades quailed with the terror he inspired, all evil-doers were utterly confounded, and deliverance went forward under his leadership.", "7": " He brought bitterness to many a king and rejoicing to Jacob by his deeds, his memory is blessed for ever and ever.", "8": " He went through the towns of Judah eliminating the irreligious from them, and diverted the Retribution from Israel.", "9": " His name resounded to the ends of the earth, he rallied those who were on the point of perishing.", "10": " Next, Apollonius mustered the gentiles and a large force from Samaria to make war on Israel.", "11": " When Judas learned of it, he went out to meet him and routed and killed him. Many fell wounded, and the survivors took to flight.", "12": " Their spoils were seized and the sword of Apollonius was taken by Judas, who used it to fight with throughout his life.", "13": " On hearing that Judas had raised a mixed force of believers and seasoned fighters,", "14": " Seron, commander of the Syrian troops, said, 'I shall make a name for myself and gain honour in the kingdom if I fight Judas and those supporters of his who are so contemptuous of the king's orders.'", "15": " He therefore launched another expedition, with a strong army of unbelievers to support him in taking revenge on the Israelites.", "16": " He had nearly reached the descent of Beth-Horon when Judas went out to confront him with a handful of men.", "17": " But as soon as these saw the force advancing to meet them, they said to Judas, 'How can we, few as we are, engage such overwhelming numbers? We are exhausted as it is, not having had anything to eat today.'", "18": " 'It is easy', Judas answered, 'for a great number to be defeated by a few; indeed, in the sight of Heaven, deliverance, whether by many or by few, is all one;", "19": " for victory in war does not depend on the size of the fighting force: Heaven accords the strength.", "20": " They are coming against us in full-blown insolence and lawlessness to destroy us, our wives and our children, and to plunder us;", "21": " but we are fighting for our lives and our laws,", "22": " and he will crush them before our eyes; do not be afraid of them.'", "23": " When he had finished speaking, he made a sudden sally against Seron and his force and overwhelmed them.", "24": " Judas pursued them down from Beth-Horon as far as the plain. About eight hundred of their men fell, and the rest took refuge in the country of the Philistines.", "25": " Judas and his brothers began to be feared, and alarm seized the surrounding peoples.", "26": " His name even reached the king's ears, and among the nations there was talk of Judas and his battles.", "27": " The news of these events infuriated Antiochus, and he ordered mobilisation of all the forces in his kingdom, a very powerful army.", "28": " Opening his treasury, he distributed a year's pay to his troops, telling them to be prepared for any eventuality.", "29": " He then found that the money in his coffers had run short and that the tribute of the province had decreased, as a result of the dissension and disaster brought on the country by his own abrogation of laws that had been in force from antiquity.", "30": " He began to fear that, as had happened more than once, he would not have enough to cover the expenses and the lavish bounties he had previously been accustomed to make on a larger scale than his predecessors on the throne.", "31": " In this grave quandary he resolved to invade Persia, there to levy tribute on the provinces and so accumulate substantial funds.", "32": " He therefore left Lysias, a nobleman and member of the royal family, to manage the royal affairs between the River Euphrates and the Egyptian frontier,", "33": " making him responsible for the education of his son Antiochus, until he should come back.", "34": " To him Antiochus made over half his forces, with the elephants, giving him instructions about what he wanted done, particularly with regard to the inhabitants of Judaea and Jerusalem,", "35": " against whom he was to send a force, to crush and destroy the power of Israel and the remnant of Jerusalem, to wipe out their very memory from the place,", "36": " to settle foreigners in all parts of their territory and to distribute their land into lots.", "37": " The king took the remaining half of his troops with him and set out from Antioch, the capital of his kingdom, in the year 147; he crossed the River Euphrates and made his way through the Upper Provinces.", "38": " Lysias chose Ptolemy son of Dorymenes, with Nicanor and Gorgias, influential men from among the Friends of the King,", "39": " and, under their command, despatched forty thousand foot and seven thousand horse to invade the land of Judah and devastate it, as the king had ordered.", "40": " The entire force set out and reached the neighbourhood of Emmaus in the lowlands, where they pitched camp.", "41": " The local merchants, hearing the news of this, arrived at the camp, bringing with them a large amount of gold and silver, and fetters as well, proposing to buy the Israelites as slaves; they were accompanied by a company from Idumaea and the Philistine country.", "42": " Judas and his brothers saw that the situation was going from bad to worse and that armies were camping in their territory; they were also well aware that the king had ordered the people's total destruction.", "43": " So they said to each other, 'Let us restore the ruins of our people and fight for our people and our sanctuary.'", "44": " The Assembly was summoned, to prepare for war, to offer prayer and to implore compassion and mercy.", "45": " Jerusalem was as empty as a desert, none of her children to go in and out. The sanctuary was trodden underfoot, men of an alien race held the Citadel, which had become a lodging for gentiles. There was no more rejoicing for Jacob, the flute and lyre were mute.", "46": " After mustering, they made their way to Mizpah, opposite Jerusalem, since Mizpah was traditionally a place of prayer for Israel.", "47": " That day they fasted and put on sackcloth, covering their heads with ashes and tearing their garments.", "48": " For the guidance that the gentiles would have sought from the images of their false gods, they opened the Book of the Law.", "49": " They also brought out the priestly vestments, with first-fruits and tithes, and marshalled the Nazirites who had completed the period of their vow.", "50": " Then, raising their voices to Heaven, they cried, 'What shall we do with these people, and where are we to take them?", "51": " Your holy place has been trampled underfoot and defiled, your priests mourn in their humiliation,", "52": " and now the gentiles are in alliance to destroy us: you know what they have in mind for us.", "53": " How can we stand up and face them if you do not come to our aid?'", "54": " Then they sounded the trumpets and raised a great shout.", "55": " Next, Judas appointed leaders for the people, to command a thousand, a hundred, fifty or ten men.", "56": " Those who were in the middle of building a house, or were about to be married, or were planting a vineyard, or were afraid, he told to go home again, as the Law allowed.", "57": " The column then marched off and took up a position south of Emmaus.", "58": " 'Stand to your arms,' Judas told them, 'acquit yourselves bravely, in the morning be ready to fight these gentiles massed against us to destroy us and our sanctuary.", "59": " Better for us to die in battle than to watch the ruin of our nation and our Holy Place.", "60": " Whatever be the will of Heaven, he will perform it.'"},
{"1": " Gorgias took with him five thousand foot and a thousand picked cavalry, and the force moved off by night", "2": " with the object of attacking the Jewish position and dealing them an unexpected blow; the men from the Citadel were there to guide him.", "3": " Judas got wind of it and himself moved off with his fighters to strike at the royal army at Emmaus,", "4": " while its fighting troops were still dispersed outside the camp.", "5": " Hence, when Gorgias reached Judas' camp, he found no one and began looking for the Jews in the mountains. 'For', he said, 'we have got them on the run.'", "6": " First light found Judas in the plain with three thousand men, although these lacked the armour and swords they would have wished.", "7": " They could now see the gentile encampment with its strong fortifications and cavalry surrounding it, clearly people who understood warfare.", "8": " Judas said to his men, 'Do not be afraid of their numbers, and do not flinch at their attack.", "9": " Remember how our ancestors were delivered at the Red Sea when Pharaoh was pursuing them in force.", "10": " And now let us call on Heaven: if he cares for us, he will remember his covenant with our ancestors and will destroy this army confronting us today;", "11": " then all the nations will know for certain that there is One who ransoms and saves Israel.'", "12": " The foreigners looked up and, seeing the Jews advancing against them,", "13": " came out of the camp to join battle. Judas' men sounded the trumpet", "14": " and engaged them. The gentiles were defeated and fled towards the plain", "15": " and all the stragglers fell by the sword. The pursuit continued as far as Gezer and the plains of Idumaea, Azotus and Jamnia, and the enemy lost about three thousand men.", "16": " Breaking off the pursuit, Judas returned with his men", "17": " and said to the people, 'Never mind the booty, for we have another battle ahead of us.", "18": " Gorgias and his troops are still near us in the mountains. First stand up to our enemies and fight them, and then you can safely collect the booty.'", "19": " The words were hardly out of Judas' mouth, when a detachment came into view, peering down from the mountain.", "20": " Observing that their own troops had been routed and that the camp had been fired -- since the smoke, which they could see, attested the fact-", "21": " they were panic-stricken at the sight; and when, furthermore, they saw Judas' troops drawn up for battle on the plain,", "22": " they all fled into Philistine territory.", "23": " Judas then turned back to plunder the camp, and a large sum in gold and silver, with violet and sea-purple stuffs, and many other valuables were carried off.", "24": " On their return, the Jews chanted praises to Heaven, singing, 'He is kind and his love is everlasting!'", "25": " That day had seen a remarkable deliverance in Israel.", "26": " Those of the foreigners who had escaped came and gave Lysias an account of all that had happened.", "27": " The news shocked and dismayed him, for affairs in Israel had not gone as he intended, and the result was quite the opposite to what the king had ordered.", "28": " The next year he mobilised sixty thousand picked troops and five thousand cavalry with the intention of finishing off the Jews.", "29": " They advanced into Idumaea and made their base at Beth-Zur, where Judas met them with ten thousand men.", "30": " When he saw their military strength he offered this prayer, 'Blessed are you, Saviour of Israel, who shattered the mighty warrior's attack at the hand of your servant David, and delivered the Philistine camp into the hands of Jonathan son of Saul, and his armourbearer.", "31": " Crush this expedition in the same way at the hands of your people Israel; let their troops and cavalry bring them nothing but shame.", "32": " Sow panic in their ranks, confound the confidence they put in their numbers and send them reeling in defeat.", "33": " Overthrow them by the sword of those who love you, and all who acknowledge your name will sing your praises.'", "34": " The two forces engaged, and five thousand men of Lysias' troops fell in hand-to-hand fighting.", "35": " Seeing the rout of his army and the courage of Judas' troops and their readiness to live or die nobly, Lysias withdrew to Antioch, where he recruited mercenaries for a further invasion of Judaea in even greater strength.", "36": " Judas and his brothers then said, 'Now that our enemies have been defeated, let us go up to purify the sanctuary and dedicate it.'", "37": " So they marshalled the whole army, and went up to Mount Zion.", "38": " There they found the sanctuary deserted, the altar desecrated, the gates burnt down, and vegetation growing in the courts as it might in a wood or on some mountain, while the storerooms were in ruins.", "39": " They tore their garments and mourned bitterly, putting dust on their heads.", "40": " They prostrated themselves on the ground, and when the trumpets gave the signal they cried aloud to Heaven.", "41": " Judas then ordered his men to keep the Citadel garrison engaged until he had purified the sanctuary.", "42": " Next, he selected priests who were blameless and zealous for the Law", "43": " to purify the sanctuary and remove the stones of the 'Pollution' to some unclean place.", "44": " They discussed what should be done about the altar of burnt offering which had been profaned,", "45": " and very properly decided to pull it down, rather than later be embarrassed about it since it had been defiled by the gentiles. They therefore demolished it", "46": " and deposited the stones in a suitable place on the hill of the Dwelling to await the appearance of a prophet who should give a ruling about them.", "47": " They took unhewn stones, as the Law prescribed, and built a new altar on the lines of the old one.", "48": " They restored the Holy Place and the interior of the Dwelling, and purified the courts.", "49": " They made new sacred vessels, and brought the lamp-stand, the altar of incense, and the table into the Temple.", "50": " They burned incense on the altar and lit the lamps on the lamp-stand, and these shone inside the Temple.", "51": " They placed the loaves on the table and hung the curtains and completed all the tasks they had undertaken.", "52": " On the twenty-fifth of the ninth month, Chislev, in the year 148 they rose at dawn", "53": " and offered a lawful sacrifice on the new altar of burnt offering which they had made.", "54": " The altar was dedicated, to the sound of hymns, zithers, lyres and cymbals, at the same time of year and on the same day on which the gentiles had originally profaned it.", "55": " The whole people fell prostrate in adoration and then praised Heaven who had granted them success.", "56": " For eight days they celebrated the dedication of the altar, joyfully offering burnt offerings, communion and thanksgiving sacrifices.", "57": " They ornamented the front of the Temple with crowns and bosses of gold, renovated the gates and storerooms, providing the latter with doors.", "58": " There was no end to the rejoicing among the people, since the disgrace inflicted by the gentiles had been effaced.", "59": " Judas, with his brothers and the whole assembly of Israel, made it a law that the days of the dedication of the altar should be celebrated yearly at the proper season, for eight days beginning on the twenty-fifth of the month of Chislev, with rejoicing and gladness.", "60": " They then proceeded to build high walls with strong towers round Mount Zion, to prevent the gentiles from coming and riding roughshod over it as in the past.", "61": " Judas stationed a garrison there to guard it; he also fortified Beth-Zur, so that the people would have a fortress confronting Idumaea."},
{"1": " When the surrounding nations heard that the altar had been rebuilt and the sanctuary restored to what it had been before, they became very angry", "2": " and decided to destroy the descendants of Jacob living among them; they began to murder and evict our people.", "3": " Judas made war on the sons of Esau in Idumaea, in the region of Acrabattene where they were besieging the Israelites. He dealt them a serious blow, drove them off and despoiled them.", "4": " He also remembered the wickedness of the sons of Baean, who were a menace and a trap for the people with their ambushes on the roads.", "5": " Having blockaded them in their town and besieged them, he put them under the curse of destruction; he then set fire to their towers and burned them down with everyone inside.", "6": " Next, he crossed over to the Ammonites where he found a strong fighting force and a numerous people, commanded by Timotheus.", "7": " He fought many battles with them, defeated them and cut them to pieces.", "8": " Having captured Jazer and its dependent villages, he retired to Judaea.", "9": " Next, the gentiles of Gilead banded together to destroy the Israelites living in their territory. The latter, however, took refuge in the fortress of Dathema,", "10": " and sent the following letter to Judas and his brothers: 'The gentiles round us have banded themselves together against us to destroy us,", "11": " and they are preparing to storm the fortress in which we have taken refuge; Timotheus is in command of their forces.", "12": " Come at once and rescue us from their clutches, for we have already suffered great losses.", "13": " All our countrymen living in Tobias' country have been killed, their women and children have been taken into captivity, their property has been seized, and about a thousand men have been destroyed there.'", "14": " While the letter was being read, other messengers arrived from Galilee with their garments torn, bearing similar news,", "15": " 'The people of Ptolemais, Tyre and Sidon have joined forces with the whole of gentile Galilee to destroy us!'", "16": " When Judas and the people heard this, they held a great assembly to decide what should be done for their oppressed countrymen who were under attack from their enemies.", "17": " Judas said to his brother Simon, 'Pick your men and go and relieve your countrymen in Galilee, while my brother Jonathan and I make our way into Gilead.'", "18": " He left Joseph son of Zechariah and the people's leader Azariah with the remainder of the army in Judaea to keep guard, and gave them these orders,", "19": " 'You are to be responsible for our people. Do not engage the gentiles until we return.'", "20": " Simon was allotted three thousand men for the expedition into Galilee, Judas eight thousand for Gilead.", "21": " Simon advanced into Galilee, engaged the gentiles in several battles and swept all before him;", "22": " he pursued them to the gate of Ptolemais, and they lost about three thousand men, whose spoils he collected.", "23": " With him, he took away the Jews of Galilee and Arbatta, with their wives and children and all their possessions, and brought them into Judaea with great rejoicing.", "24": " Meanwhile Judas Maccabaeus and his brother Jonathan crossed the Jordan and made a three-days' march through the desert,", "25": " where they encountered the Nabataeans, who gave them a friendly reception and told them everything that had been happening to their brothers in Gilead,", "26": " many of whom, they said, were shut up in Bozrah and Bosor, Alema, Chaspho, Maked and Carnaim, all large fortified towns.", "27": " Others were blockaded in the other towns of Gilead, and the enemy planned to attack and capture these strongholds the very next day, and destroy all the people inside them on one day.", "28": " Judas and his army at once turned off by the desert road to Bozrah. He took the town and, having put all the males to the sword and collected the booty, burned it down.", "29": " When night came, he left the place, and they continued their march until they reached the fortress.", "30": " In the light of dawn they looked, and there was an innumerable horde, setting up ladders and engines to capture the fortress; the assault was just beginning.", "31": " When Judas saw that the attack had begun and that the war cry was rising to heaven from the city, mingled with trumpet calls and a great clamour,", "32": " he said to the men of his army, 'Into battle today for your brothers!'", "33": " Dividing them into three commands, he advanced on the enemy's rear, with trumpets sounding and prayers shouted aloud.", "34": " The troops of Timotheus, recognising that this was Maccabaeus, fled before his advance; Maccabaeus dealt them a crushing defeat; about eight thousand of their men fell that day.", "35": " Then, wheeling on Alema, he attacked and captured it and, having killed all the males and collected the booty, burned the place down.", "36": " From there he moved on and took Chaspho, Maked, Bosor and the remaining towns of Gilead.", "37": " After these events, Timotheus mustered another force and pitched camp opposite Raphon, on the far side of the stream-bed.", "38": " Judas sent men to reconnoitre the camp, and these reported back as follows, 'With him are massed all the gentiles surrounding us, making a very numerous army,", "39": " with Arab mercenaries as auxiliaries; they are encamped on the far side of the stream-bed, and ready to launch an attack on you.' Judas then advanced to engage them,", "40": " and was approaching the watercourse with his troops when Timotheus told the commanders of his army, 'If he crosses first we shall not be able to resist him, because he will have a great advantage over us;", "41": " but if he is afraid and camps on the other side of the stream, we shall cross over to him and the advantage will then be ours.'", "42": " As soon as Judas reached the watercourse, he posted people's scribes along it, giving them this order: 'Do not let anyone pitch his tent; all are to go into battle!'", "43": " He was himself the first across to the enemy side, with all the people following. He defeated all the opposing gentiles, who threw down their arms and ran for refuge in the sanctuary of Carnaim.", "44": " The Jews first captured the town and then burned down the temple with everyone inside. And so Carnaim was overthrown, and the enemy could offer no further resistance to Judas.", "45": " Next, Judas assembled all the Israelites living in Gilead, from the least to the greatest, with their wives, children and belongings, an enormous muster, to take them to Judaea.", "46": " They reached Ephron, a large town straddling the road and strongly fortified. As it was impossible to by-pass it either to right or to left, there was nothing for it but to march straight through.", "47": " But the people of the town denied them passage and barricaded the gates with stones.", "48": " Judas sent them a conciliatory message in these terms, 'We want to pass through your territory to reach our own; no one will do you any harm, we only want to go through on foot.' But they would not open up for him.", "49": " So Judas sent an order down the column for everyone to halt where he stood.", "50": " The fighting men took up their positions; Judas attacked the town all day and night, and the town fell to him.", "51": " He put all the males to the sword, rased the town to the ground, plundered it and marched through the town square over the bodies of the dead.", "52": " They then crossed the Jordan into the Great Plain, opposite Beth-Shean,", "53": " Judas all the time rallying the stragglers and encouraging the people the whole way until they reached Judaea.", "54": " They climbed Mount Zion in joy and gladness and presented burnt offerings because they had returned safe and sound without having lost a single man.", "55": " While Judas and Jonathan were in Gilead and Simon his brother in Galilee outside Ptolemais,", "56": " Joseph son of Zechariah, and Azariah, who were in command of the army, heard of their valiant deeds and of the battles they had been fighting,", "57": " and said, 'Let us make a name for ourselves too and go and fight the nations around us.'", "58": " So they issued orders to the men under their command and marched on Jamnia.", "59": " Gorgias and his men came out of the town and gave battle.", "60": " Joseph and Azariah were routed and pursued as far as the frontiers of Judaea. That day about two thousand Israelites lost their lives.", "61": " Our people thus met with a great reverse, because they had not listened to Judas and his brothers, thinking that they would do something equally valiant.", "62": " They were not, however, of the same breed of men as those to whom the deliverance of Israel was entrusted.", "63": " The noble Judas and his brothers, however, were held in high honour throughout Israel and among all the nations wherever their name was heard,", "64": " and people thronged round to acclaim them.", "65": " Judas marched out with his brothers to fight the Edomites in the country towards the south; he stormed Hebron and its dependent villages, threw down its fortifications and burned down its encircling towers.", "66": " Leaving there, he made for the country of the Philistines and passed through Marisa.", "67": " Among the fallen in that day's fighting were some priests who sought to prove their courage there by joining in the battle, a foolhardy venture.", "68": " Judas next turned on Azotus, which belonged to the Philistines; he overthrew their altars, burned the statues of their gods and, having pillaged their towns, withdrew to Judaea."},
{"1": " King Antiochus, meanwhile, was making his way through the Upper Provinces; he had heard that in Persia there was a city called Elymais, renowned for its riches, its silver and gold,", "2": " and its very wealthy temple containing golden armour, breastplates and weapons, left there by Alexander son of Philip, the king of Macedon, the first to reign over the Greeks.", "3": " He therefore went and attempted to take the city and pillage it, but without success, the citizens having been forewarned.", "4": " They resisted him by force of arms. He was routed, and began retreating, very gloomily, towards Babylon.", "5": " But, while he was still in Persia, news reached him that the armies which had invaded Judaea had been routed,", "6": " and that Lysias in particular had advanced in massive strength, only to be forced to turn and flee before the Jews; that the latter were now stronger than ever, thanks to the arms, supplies and abundant spoils acquired from the armies they had cut to pieces,", "7": " and that they had pulled down the abomination which he had erected on the altar in Jerusalem, had encircled the sanctuary with high walls as in the past, and had fortified Beth-Zur, one of his cities.", "8": " When the king heard this news he was amazed and profoundly shaken; he threw himself on his bed and fell sick with grief, since things had not turned out for him as he had planned.", "9": " And there he remained for many days, subject to deep and recurrent fits of melancholy, until he realised that he was dying.", "10": " Then, summoning all his Friends, he said to them, 'Sleep evades my eyes, and my heart is cowed by anxiety.", "11": " I have been wondering how I could have come to such a pitch of distress, so great a flood as that which now engulfs me -- I who was so generous and well-loved in my heyday.", "12": " But now I recall how wrongly I acted in Jerusalem when I seized all the vessels of silver and gold there and ordered the extermination of the inhabitants of Judah for no reason at all.", "13": " This, I am convinced, is why these misfortunes have overtaken me, and why I am dying of melancholy in a foreign land.'", "14": " He summoned Philip, one of his Friends, and made him regent of the whole kingdom.", "15": " He entrusted him with his diadem, his robe and his signet, on the understanding that he was to educate his son Antiochus and train him for the throne.", "16": " King Antiochus then died, in the year 149.", "17": " Lysias, learning that the king was dead, established on the throne in succession to him his son Antiochus, whom he had brought up from childhood -- and styled him Eupator.", "18": " The people in the Citadel at the time were blockading Israel round the sanctuary and were taking every opportunity to harm them and to support the gentiles.", "19": " Judas decided that they must be destroyed, and he mobilised the whole people to besiege them.", "20": " They assembled and laid siege to the Citadel in the year 150, building batteries and siege-engines.", "21": " But some of the besieged broke through the blockade, and to these a number of renegades from Israel attached themselves.", "22": " They made their way to the king and said, 'How much longer are you going to wait before you see justice done and avenge our fellows?", "23": " We were content to serve your father, to comply with his orders, and to obey his edicts.", "24": " As a result our own people will have nothing to do with us; what is more, they have killed all those of us they could catch, and looted our family property.", "25": " Nor is it on us alone that their blows have fallen, but on all your territories.", "26": " At this moment, they are laying siege to the Citadel of Jerusalem, to capture it, and they have fortified the sanctuary and Beth-Zur.", "27": " Unless you forestall them at once, they will go on to even bigger things, and then you will never be able to control them.'", "28": " The king was furious when he heard this and summoned all his Friends, the generals of his forces and the marshals of horse.", "29": " He recruited mercenaries from other kingdoms and the Mediterranean islands.", "30": " His forces numbered a hundred thousand foot soldiers, twenty thousand cavalry and thirty-two elephants with experience of battle conditions.", "31": " They advanced through Idumaea and besieged Beth-Zur, pressing the attack for days on end; they also constructed siege-engines, but the defenders made a sortie and set these on fire, putting up a brave resistance.", "32": " At this, Judas left the Citadel and pitched camp at Beth-Zechariah opposite the royal encampment.", "33": " The king rose at daybreak and marched his army at top speed down the road to Beth-Zechariah, where his forces took up their battle formations and sounded the trumpets.", "34": " The elephants were given a syrup of grapes and mulberries to prepare them for the battle.", "35": " These animals were distributed among the phalanxes, to each elephant being allocated a thousand men dressed in coats of mail with bronze helmets on their heads; five hundred picked horsemen were also assigned to each beast.", "36": " The horsemen anticipated every move their elephant made; wherever it went they went with it, never quitting it.", "37": " On each elephant, to protect it, was a stout wooden tower, kept in position by girths, each with its three combatants, as well as its mahout.", "38": " The remainder of the cavalry was stationed on one or other of the two flanks of the army, to harass the enemy and cover the phalanxes.", "39": " When the sun glinted on the bronze and golden shields, the mountains caught the glint and gleamed like fiery torches.", "40": " One part of the royal army was deployed on the upper slopes of the mountain and the other in the valley below; they advanced in solid, well-disciplined formation.", "41": " Everyone trembled at the noise made by this vast multitude, the thunder of the troops on the march and the clanking of their armour, for it was an immense and mighty army.", "42": " Judas and his army advanced to give battle, and six hundred of the king's army were killed.", "43": " Eleazar, called Avaran, noticing that one of the elephants was royally caparisoned and was also taller than all the others, and supposing that the king was mounted on it,", "44": " sacrificed himself to save his people and win an imperishable name.", "45": " Boldly charging towards the creature through the thick of the phalanx, dealing death to right and left, so that the enemy scattered on either side at his onslaught,", "46": " he darted in under the elephant, thrust at it from underneath, and killed it. The beast collapsed on top of him, and he died on the spot.", "47": " The Jews however realising how strong the king was and how ferocious his army, retreated ahead of them.", "48": " The royal army moved up to encounter them outside Jerusalem, and the king began to blockade Judaea and Mount Zion.", "49": " He granted peace terms to the people of Beth-Zur, who evacuated the town; it lacked store of provisions to withstand a siege, since the land was enjoying a sabbatical year.", "50": " Having occupied Beth-Zur, the king stationed a garrison there to hold it.", "51": " He besieged the sanctuary for a long time, erecting batteries and siege-engines, flame-throwers and ballistas, scorpions to discharge arrows, and catapults.", "52": " The defenders countered these by constructing their own engines and were thus able to prolong their resistance.", "53": " But they had no food in their stores since it was the seventh year, and because those who had taken refuge in Judaea from the gentiles had eaten up the last of their reserves.", "54": " Only a few men were left in the Holy Place, owing to the severity of the famine; the rest had dispersed and gone home.", "55": " Meanwhile Philip, whom King Antiochus before his death had appointed to train his son Antiochus for the throne,", "56": " had returned from Persia and Media with the forces that had accompanied the king, and was planning to seize control of affairs.", "57": " On hearing this, Lysias at once decided to leave, and said to the king, the generals of the army and the men, 'We are growing weaker every day, we are short of food, and the place we are besieging is well fortified; moreover the affairs of the kingdom demand our attention.", "58": " Let us offer the hand of friendship to these men and make peace with them and with their whole nation.", "59": " Let us grant them permission to follow their own customs as before, since it is our abolition of these customs that has provoked them into acting like this.'", "60": " The king and his commanders approved this argument, and he offered the Jews peace terms, which they accepted.", "61": " The king and the generals ratified the treaty by oath, and the besieged accordingly left the fortress.", "62": " The king then entered Mount Zion, but on seeing how impregnable the place was, he broke the oath he had sworn and gave orders for the encircling wall to be demolished.", "63": " He then hurriedly withdrew, making off for Antioch, where he found Philip already master of the city. Antiochus gave battle and captured the city by force of arms."},
{"1": " In the year 151, Demetrius son of Seleucus left Rome and arrived with a few men at a town on the coast, where he inaugurated his reign.", "2": " It so happened that, as he was entering the royal residence of his ancestors, the army captured Antiochus and Lysias, and intended to bring them to him.", "3": " On hearing this, he said, 'Keep them out of my sight.'", "4": " The army put them to death, and Demetrius ascended his throne.", "5": " Next, all those Israelites without law or piety, led by Alcimus, whose ambition was to become high priest,", "6": " approached the king and denounced our people to him. 'Judas and his brothers', they said, 'have killed all your friends, and he has driven us out of our country.", "7": " Send someone now whom you can trust; let him go and see the wholesale ruin Judas has brought on us and on the king's dominions, and let him punish the wretches and all who assist them.'", "8": " The king chose Bacchides, one of the Friends of the King, governor of Transeuphrates, an important personage in the kingdom and loyal to the king.", "9": " He sent him with the godless Alcimus, whom he confirmed in the high priesthood, with orders to exact retribution from the Israelites.", "10": " So they set out with a large force and, on reaching Judaea, sent emissaries to Judas and his brothers with proposals peaceable yet treacherous.", "11": " The latter, however, did not put any faith in their words, aware that they had come with a large force.", "12": " Nevertheless, a commission of scribes presented themselves before Alcimus and Bacchides, to sue for just terms.", "13": " The first among the Israelites to ask them for peace terms were the Hasidaeans,", "14": " who reasoned thus, 'This is a priest of Aaron's line who has come with the armed forces; he will not wrong us.'", "15": " He did in fact discuss peace terms with them and gave them his oath, 'We shall not attempt to injure you or your friends.'", "16": " They believed him, but he arrested sixty of them and put them to death on one day, fulfilling the words of scripture:", "17": " They have scattered the bodies of your faithful, and shed their blood all round Jerusalem, leaving no one to bury them!", "18": " At this, fear and dread gripped the whole people. 'There is no truth or virtue in them,' they said, 'they have broken their agreement and their sworn oath.'", "19": " Bacchides then left Jerusalem and encamped at Beth-Zeth, and from there sent and arrested many of the men who had deserted him and a few of our people too; he had them killed and thrown down the great well.", "20": " He then put Alcimus in charge of the province, leaving an army with him to support him; Bacchides himself returned to the king.", "21": " Alcimus continued his struggle to become high priest,", "22": " and all who were disturbing the peace of their own people rallied to him, and, having won control of Judaea, did much harm in Israel.", "23": " Seeing that all the wrongs done to the Israelites by Alcimus and his supporters exceeded what the gentiles had done,", "24": " Judas went right round the whole territory of Judaea to take vengeance on those who had deserted him and to prevent their free movement about the country.", "25": " When Alcimus saw how strong Judas and his supporters had grown and realised that he was powerless to resist them, he went back to the king, to whom he made malicious accusations against them.", "26": " The king sent Nicanor, one of his generals ranking as Illustrious and a bitter enemy of Israel, with orders to exterminate the people.", "27": " Reaching Jerusalem with a large force, Nicanor sent a friendly, yet treacherous, message to Judas and his brothers, as follows:", "28": " 'Let us have no fighting between you and me; I shall come with a small escort for a peaceful meeting with you.'", "29": " He met Judas and they exchanged friendly greetings; the enemy, however, had made preparations to abduct Judas.", "30": " When Judas became aware of Nicanor's treacherous purpose in coming to see him, he took fright and refused any further meeting.", "31": " Nicanor then realised that his plan had been discovered, and took the field against Judas, to give battle near Caphar-Salama.", "32": " About five hundred of Nicanor's men fell; the rest took refuge in the City of David.", "33": " After these events Nicanor went up to Mount Zion. Some of the priests came out of the Holy Place with some elders, to give him a friendly welcome and show him the burnt offering being presented for the king.", "34": " But he ridiculed them, laughed at them, defiled them and used insolent language, swearing in his rage,", "35": " 'Unless Judas is handed over to me this time with his army, as soon as I am safely back, I promise you, I shall burn this building down!'", "36": " Then he went off in a fury. At this, the priests went in again, and stood weeping in front of the altar and the Temple, saying,", "37": " 'You have chosen this house to be called by your name, to be a house of prayer and petition for your people.", "38": " Take vengeance on this man and on his army, and let them fall by the sword; remember their blasphemies and give them no respite.'", "39": " Nicanor left Jerusalem and encamped at Beth-Horon, where he was joined by an army from Syria.", "40": " Judas, meanwhile, camped at Adasa with three thousand men, and offered this prayer,", "41": " 'When the king's envoys blasphemed, your angel went out and struck down one hundred and eighty-five thousand of his men.", "42": " In the same way let us see you crush this army today, so that everyone else may know that this man has spoken blasphemously against your sanctuary: pass judgement on him as his wickedness deserves!'", "43": " The armies met in battle on the thirteenth of the month Adar, and Nicanor's army was crushed, he himself being the first to fall in the battle.", "44": " When Nicanor's soldiers saw him fall, they threw down their arms and fled.", "45": " The Jews pursued them a day's journey, from Adasa to the approaches of Gezer; they sounded their trumpets in warning as they followed them,", "46": " and people came out of all the surrounding Judaean villages to encircle the fugitives, who then turned back on their own men. All fell by the sword, not one being left alive.", "47": " Having collected the spoils and booty, they cut off Nicanor's head and the right hand he had stretched out in a display of insolence; these were taken and displayed within sight of Jerusalem.", "48": " The people were overjoyed and kept that day as a great holiday:", "49": " indeed they decided to celebrate it annually on the thirteenth of Adar.", "50": " For a short while Judaea enjoyed peace."},
{"1": " Now Judas had heard of the reputation of the Romans: how strong they were, and how well disposed towards any who made common cause with them, making a treaty of friendship with anyone who approached them.", "2": " (And, indeed, they were extremely powerful.) He had been told of their wars and of their prowess among the Gauls, whom they had conquered and put under tribute;", "3": " and of all they had done in the province of Spain to gain possession of the silver and gold mines there,", "4": " making themselves masters of the whole country by their determination and perseverance, despite its great distance from their own; of the kings who came from the ends of the earth to attack them, only to be crushed by them and overwhelmed with disaster, and of others who paid them annual tribute;", "5": " Philip, Perseus king of the Kittim, and others who had dared to make war on them, had been defeated and reduced to subjection,", "6": " while Antiochus the Great, king of Asia, who had advanced to attack them with a hundred and twenty elephants, cavalry, chariots and a very large army, had also suffered defeat at their hands;", "7": " they had taken him alive and imposed on him and his successors, on agreed terms, the payment of an enormous tribute, the surrender of hostages, and the cession", "8": " of the Indian territory, with Media, Lydia, and some of their best provinces, which they took from him and gave to King Eumenes.", "9": " Judas had also heard how, when the Greeks planned an expedition to destroy the Romans,", "10": " the latter had got wind of it and, sending a single general against them, had fought a campaign in which they inflicted heavy casualties, carried their women and children away into captivity, pillaged their goods, subdued their country, tore down their fortresses and reduced them to a slavery lasting to the present day;", "11": " and how they had destroyed and subjugated all the other kingdoms and islands that resisted them.", "12": " But where their friends and those who relied on them were concerned, they had always stood by their friendship. They had subdued kings far and near, and all who heard their name went in terror of them.", "13": " One man, if they determined to help him and advance him to a throne, would certainly occupy it, while another, if they so determined, would find himself deposed; their influence was paramount.", "14": " In spite of all this, no single one of them had assumed a crown or put on the purple for his own aggrandisement.", "15": " They had set up a senate, where three hundred and twenty councillors deliberated daily, constantly debating how best to regulate public affairs.", "16": " They entrusted their government to one man for a year at a time, with absolute power over their whole empire, and this man was obeyed by all without envy or jealousy.", "17": " Having chosen Eupolemus son of John, of the family of Accos, and Jason son of Eleazar, Judas sent them to Rome to make a treaty of friendship and alliance with these people,", "18": " in the hope of being rid of the yoke, for they could see that Greek rule was reducing Israel to slavery.", "19": " The envoys made the lengthy journey to Rome and presented themselves before the Senate with their formal proposal:", "20": " 'Judas Maccabaeus and his brothers, with the Jewish people, have sent us to you to conclude a treaty of alliance and peace with you, and to enrol ourselves as your allies and friends.'", "21": " The proposal met with the approval of the senators.", "22": " Here is a copy of the rescript which they engraved on bronze tablets and sent to Jerusalem to be kept there by the Jews as a record of peace and alliance:", "23": " 'Good fortune attend the Romans and the Jewish nation by sea and land for ever; may sword or enemy be far from them!", "24": " 'If war comes first to Rome or any of her allies throughout her dominions,", "25": " the Jewish nation will take action as her ally, as occasion may require, and do it wholeheartedly.", "26": " They will not give or supply to the enemy any grain, arms, money or ships: thus has Rome decided, and they are to honour their obligations without guarantees.", "27": " In the same way, if war comes first to the Jewish nation, the Romans will support them energetically as occasion may offer,", "28": " and the aggressor will not be furnished with grain, arms, money or ships: such is the Roman decision, and they will honour these obligations without treachery.", "29": " Such are the articles under which the Romans have concluded their treaty with the Jewish people.", "30": " If, later, either party should decide to make any addition or deletion, they will be free to do so, and any such addition or deletion will be binding.", "31": " 'As regards the wrongs done to them by King Demetrius, we have written to him in these terms: Why have you made your yoke lie heavy on our friends and allies the Jews?", "32": " If they appeal against you again, we shall uphold their rights and make war on you by sea and land.'"},
{"1": " Demetrius, hearing that Nicanor and his army had fallen in battle, sent Bacchides and Alcimus a second time into Judaea, and with them the right wing of his army.", "2": " They took the road to Galilee and besieged Mesaloth in Arbela, and captured it, putting many people to death.", "3": " In the first month of the year 152, they encamped outside Jerusalem;", "4": " they then moved on, making their way to Beer-Zaith with twenty thousand foot and two thousand horse.", "5": " Judas lay in camp at Elasa, with three thousand picked men.", "6": " When they saw the huge size of the enemy forces they were terrified, and many slipped out of the camp, until no more than eight hundred of the force were left.", "7": " With battle now inevitable, Judas realised that his army had melted away; he was aghast, for he had no time to rally them.", "8": " Yet, dismayed as he was, he said to those who were left, 'Up! Let us face the enemy; we may yet have the strength to fight them.'", "9": " His men tried to dissuade him, declaring, 'We have no strength for anything but to escape with our lives this time; then we can come back with our brothers to fight them; by ourselves we are too few.'", "10": " Judas retorted, 'That I should do such a thing as run away from them! If our time has come, at least let us die like men for our countrymen, and leave nothing to tarnish our reputation.'", "11": " The army marched out of camp and drew up, facing the enemy. The cavalry was drawn up in two squadrons; the slingers and archers marched in the van of the army, and all the best fighters were put in the front rank;", "12": " Bacchides was on the right wing. The phalanx advanced from between the two squadrons, sounding the trumpets; the men on Judas' side also blew their trumpets,", "13": " and the earth shook with the noise of the armies. The engagement lasted from morning until evening.", "14": " Judas saw that Bacchides and the main strength of his army lay on the right; all the stout-hearted rallied to him,", "15": " and they crushed the right wing, pursuing them as far as the Azara Hills.", "16": " But when the Syrians on the left wing saw that the right had been broken, they turned and followed hot on the heels of Judas and his men to take them in the rear.", "17": " The fight became desperate, and there were many casualties on both sides.", "18": " Judas himself fell, and the remnant fled.", "19": " Jonathan and Simon took up their brother Judas and buried him in his ancestral tomb at Modein.", "20": " All Israel wept and mourned him deeply and for many days they repeated this dirge.", "21": " 'What a downfall for the strong man, the man who kept Israel safe!'", "22": " The other deeds of Judas, the battles he fought, the exploits he performed, and all his titles to greatness have not been recorded; but they were very many.", "23": " After the death of Judas, the renegades came out of hiding throughout Israel and all the evil-doers reappeared.", "24": " At that time there was a severe famine, and the country went over to their side.", "25": " Bacchides deliberately chose the enemies of religion to administer the country.", "26": " These traced and searched out the friends of Judas and brought them before Bacchides, who ill-treated and mocked them.", "27": " A terrible oppression began in Israel; there had been nothing like it since the disappearance of prophecy among them.", "28": " The friends of Judas then all united in saying to Jonathan,", "29": " 'Since your brother Judas died, there has been no one like him to head the resistance against our enemies, people like Bacchides and others who hate our nation.", "30": " Accordingly, we have today chosen you to take his place as our ruler and leader and to fight our campaigns.'", "31": " Whereupon, Jonathan took command, in succession to his brother Judas.", "32": " Bacchides, when he heard the news, made plans to kill Jonathan.", "33": " But this became known to Jonathan, his brother Simon and all his supporters, and they took refuge in the desert of Tekoa, camping by the water-supply at Asphar storage-well.", "34": " (Bacchides came to know of this on the Sabbath day, and he too crossed the Jordan with his entire army.)", "35": " Jonathan sent his brother, who was one of his commanders, to ask his friends the Nabataeans to store their considerable baggage for them.", "36": " The sons of Amrai, however, those of Medeba, intercepted them, captured John and everything he had and made off with their prize.", "37": " Later, Jonathan and his brother Simon were told that the sons of Amrai were celebrating an important wedding, and were escorting the bride, a daughter of one of the great notables of Canaan, from Nabata with a large retinue.", "38": " Remembering the bloody end of their brother John, they went up and hid under cover of the mountain.", "39": " As they were keeping watch, a noisy procession came into sight with a great deal of baggage, and the bridegroom, with his groomsmen and his family, came out to meet it with tambourines and a band, and rich, warlike display.", "40": " The Jews rushed down on them from their ambush and killed them, inflicting heavy casualties; the survivors escaped to the mountain, leaving their entire baggage train to be captured.", "41": " Thus, the wedding was turned into mourning and the music of their band into lamentation.", "42": " Having in this way avenged in full the blood of their brother, they returned to the marshes of the Jordan.", "43": " As soon as Bacchides heard this, he came on the Sabbath day with a considerable force to the steep banks of the Jordan.", "44": " Jonathan said to his men, 'Up! Let us fight for our lives, for today it is not as in the old days.", "45": " You can see, we shall have to fight on our front and to our rear; we have the waters of the Jordan on one side, the marsh and scrub on the other, and we have no line of withdrawal.", "46": " This is the moment to call on Heaven, to deliver you from the clutches of your enemies.'", "47": " The engagement was begun by Jonathan, who aimed a blow at Bacchides, but the Syrian disengaged himself and withdrew,", "48": " whereupon Jonathan and his men leapt into the Jordan and swam to the other bank; the enemy did not, however, cross the Jordan in pursuit.", "49": " That day, Bacchides lost about a thousand men.", "50": " Bacchides went back to Jerusalem and began fortifying some of the Judaean towns: the fortresses of Jericho, Emmaus, Beth-Horon, Bethel, Timnath, Pharathon and Tephon, with high walls and barred gates,", "51": " and stationed a garrison in each of them to harass Israel.", "52": " He also fortified the town of Beth-Zur, Gezer and the Citadel, and placed troops in them with supplies of provisions.", "53": " He took the sons of the leading men of the country as hostages, and had them placed under guard in the Citadel of Jerusalem.", "54": " In the year 153, in the second month, Alcimus ordered the demolition of the wall of the inner court of the sanctuary, destroying the work of the prophets. Alcimus had just begun the demolition", "55": " when he suffered a stroke, and his work was interrupted. His mouth became obstructed, and his paralysis made him incapable of speaking at all or giving directions to his household;", "56": " it was not long before he died in great agony.", "57": " On the death of Alcimus, Bacchides went back to the king, and Judaea was left in peace for two years.", "58": " The renegades then all agreed on a plan. 'Now is the time,' they said, 'while Jonathan and his supporters are living in peace and are full of confidence, for us to bring back Bacchides, and he will arrest the lot of them in one night.'", "59": " So they went to him and reached an understanding.", "60": " Bacchides at once set out with a large force, and sent secret instructions to all his allies in Judaea to seize Jonathan and his supporters. But they were unable to do this because their plan became known,", "61": " and Jonathan and his men arrested some fifty of the men of the country who were ringleaders in the plot, and put them to death.", "62": " Jonathan and Simon then retired with their partisans to Beth-Bassi in the desert; they rebuilt the ruinous parts of the place and fortified it.", "63": " When Bacchides heard this, he mustered his whole force and notified his adherents in Judaea.", "64": " He then proceeded to lay siege to Beth-Bassi, the fighting was protracted, and he constructed siege-engines.", "65": " Jonathan, however, leaving his brother Simon in the town, broke out into the countryside with a handful of men.", "66": " He launched a blow at Odomera and his brothers, and at the sons of Phasiron in their encampment; whereupon, these too came into the struggle, joining forces with him.", "67": " Simon and his people, meanwhile, made a sortie from the town and set fire to the siege-engines.", "68": " Taking the offensive against Bacchides, they defeated him. He was greatly disconcerted to find that his plan and his assault had come to nothing,", "69": " and vented his anger on those renegades who had induced him to enter the country, putting many of them to death; he then decided to take his own troops home.", "70": " Discovering this, Jonathan sent envoys to negotiate peace terms and the release of prisoners with him.", "71": " Bacchides agreed to this, accepting his proposals and swearing never to seek occasion to harm him for the rest of his life.", "72": " Having surrendered to Jonathan those prisoners he had earlier taken in Judaea, he turned about and withdrew to his own country, and never again came near their frontiers.", "73": " The sword no longer hung over Israel, and Jonathan settled in Michmash, where he began to judge the people and to rid Israel of the godless."},
{"1": " In the year 160, Alexander, son of Antiochus Epiphanes, raised an army and occupied Ptolemais. He was well received, and there inaugurated his reign.", "2": " On hearing this, King Demetrius assembled a very large army and marched off to do battle with him.", "3": " Demetrius furthermore sent Jonathan a most conciliatory letter, promising to promote him in rank,", "4": " for, as he said, 'We had better move first to come to terms with these people before he makes common cause with Alexander against us;", "5": " he will not have forgotten all the wrongs we inflicted on him and his brothers, and on his nation.'", "6": " He even authorised him to raise an army, to manufacture arms, and to describe himself as his ally, and ordered the hostages in the Citadel to be surrendered to him.", "7": " Jonathan went straight to Jerusalem and read the letter in the hearing of the whole people and of the men in the Citadel.", "8": " They were terrified when they heard that the king had given him authority to raise an army.", "9": " The men in the Citadel surrendered the hostages to Jonathan, who handed them back to their parents.", "10": " Jonathan then took up residence in Jerusalem and began the rebuilding and restoration of the city.", "11": " He ordered those responsible for the work to build the walls and the defences round Mount Zion of squared stone blocks to make them stronger, and this was done.", "12": " The foreigners in the fortresses built by Bacchides abandoned them,", "13": " one after another leaving his post to go back to his own country.", "14": " Only at Beth-Zur were a few left of those who had forsaken the Law and the precepts, since this was their refuge.", "15": " King Alexander heard of all the promises Demetrius had sent to Jonathan, and he was also given an account of the battles and exploits of this man and his brothers and of the hardships they had endured.", "16": " 'Shall we ever find another man like him?' he exclaimed. 'We must make him our friend and ally!'", "17": " He therefore wrote him a letter, addressing him in these terms:", "18": " 'King Alexander to his brother Jonathan, greetings.", "19": " 'You have been brought to our notice as a strong man of action and as someone who deserves to be our friend.", "20": " Accordingly, we have today appointed you high priest of your nation, with the title of \"Friend of the King\" ' -- he also sent him a purple robe and a golden crown-'and you are to study our interests and maintain friendly relations with us.'", "21": " Jonathan put on the sacred vestments in the seventh month of the year 160, on the feast of Shelters; he then set about raising troops and manufacturing arms in quantity.", "22": " Demetrius was displeased when he heard what had happened.", "23": " 'What have we been doing,' he said, 'for Alexander to forestall us in winning the friendship of the Jews and so improving his own position?", "24": " I too shall address an appeal to them, offering them advancement and riches as an inducement to support me.'", "25": " And he wrote to them as follows: 'King Demetrius to the Jewish nation, greetings.", "26": " 'We have heard how you have kept your agreement with us and have maintained friendly relations with us and have not gone over to our enemies, and it has given us great satisfaction.", "27": " If you now continue to keep faith with us, we shall make you a handsome return for what you do on our behalf.", "28": " We shall accord you many exemptions and grant you privileges.", "29": " 'Henceforth I release you and exempt all the Jews from the tribute, the salt dues and the crown levies,", "30": " and whereas I am entitled to one-third of the grain and one-half of the fruit of the trees, I release from this levy, from today and for the future, Judaea and the three districts annexed to it from Samaria-Galilee, from this day henceforth in perpetuity.", "31": " Jerusalem will be sacred and exempt, with its territory, from tithes and dues.", "32": " I relinquish control of the Citadel in Jerusalem and make it over to the high priest, so that he may man it with a garrison of his own choosing.", "33": " Every Jewish person taken from Judaea into captivity in any part of my kingdom I set free without ransom, and decree that all will be exempt from taxes, even on their livestock.", "34": " All festivals, Sabbaths, New Moons and days of special observance, and the three days before and three days after a festival, will be days of exemption and quittance for all the Jews in my kingdom,", "35": " and no one will have the right to exact payment from, or to molest, any of them for any matter whatsoever.", "36": " 'Jews will be enrolled in the king's forces to the number of thirty thousand men and receive maintenance on the same scale as the rest of the king's forces.", "37": " Some of them will be stationed in the king's major fortresses, and from among others appointments will be made to positions of trust in the kingdom. Their officers and commanders will be appointed from their own number and will live under their own laws, as the king has prescribed for Judaea. ", "38": " 'As regards the three districts annexed to Judaea from the province of Samaria, these will be integrated into Judaea and considered as coming under one governor, obeying the high priest's authority and no other.", "39": " Ptolemais and the land thereto pertaining I present to the sanctuary in Jerusalem, to meet the necessary expenses of public worship.", "40": " And I make a personal grant of fifteen thousand silver shekels annually chargeable to the royal revenue from appropriate places.", "41": " And the entire surplus, which has not been paid in by the officials as in previous years, will henceforth be paid over by them for work on the Temple.", "42": " In addition, the sum of five thousand silver shekels, levied annually on the profits of the sanctuary, as shown in the annual accounts, is also relinquished as the perquisite of the priests who perform the liturgy.", "43": " Anyone who takes refuge in the Temple in Jerusalem or any of its precincts, when in debt to the royal exchequer or otherwise, will be discharged in full possession of all the goods he owns in my kingdom.", "44": " As regards the building and restoration of the sanctuary, the expense of the work will be met from the royal exchequer.", "45": " The reconstruction of the walls of Jerusalem and the fortification of the perimeter will also be a charge on the royal exchequer, as also the reconstruction of other city walls in Judaea.'", "46": " When Jonathan and the people heard these proposals, they put no faith in them and refused to accept them, remembering what great wrongs Demetrius had done to Israel and how cruelly he had oppressed them.", "47": " They decided in favour of Alexander, since he seemed to offer the better inducements of the two, and they became his constant allies.", "48": " King Alexander now mustered large forces and advanced against Demetrius.", "49": " The two kings met in battle. Alexander's army was routed, and Demetrius pursued him and defeated his troops.", "50": " He continued the battle with vigour until sunset. Demetrius himself, however, was killed the same day.", "51": " Alexander sent ambassadors to Ptolemy king of Egypt, with this message:", "52": " 'Since I have returned to my kingdom, have ascended the throne of my ancestors, have gained control by crushing Demetrius, and so recovered our country-", "53": " for I fought him and we crushed both him and his army, and I now occupy his royal throne-", "54": " let us now make a treaty of friendship. Give me your daughter in marriage: as your son-in-law, I shall give you, and her, presents which are worthy of you.'", "55": " King Ptolemy replied as follows: 'Happy the day when you returned to the land of your ancestors and ascended their royal throne!", "56": " I shall at once do for you what your letter proposes; but meet me at Ptolemais, so that we can see one another, and I shall become your father-in-law, as you have asked.'", "57": " Ptolemy left Egypt with his daughter Cleopatra and reached Ptolemais in the year 162.", "58": " King Alexander went to meet him, and Ptolemy gave him the hand of his daughter Cleopatra and celebrated her wedding in Ptolemais with great magnificence, as kings do.", "59": " King Alexander then wrote to Jonathan to come and meet him.", "60": " Jonathan made his way in state to Ptolemais and met the two kings; he gave them and their friends silver and gold, and many gifts, and made a favourable impression on them.", "61": " A number of scoundrels, the pest of Israel, combined to denounce him, but the king paid no attention to them.", "62": " In fact, the king commanded that Jonathan should be divested of his own garments and clothed in the purple, which was done.", "63": " The king then seated him by his side and said to his officers, 'Escort him into the centre of the city and proclaim that no one is to bring charges against him on any count; no one is to molest him for any reason.'", "64": " And so, when his accusers saw the honour done him by this proclamation, and Jonathan himself invested in the purple, they all fled.", "65": " The king did him the honour of enrolling him among the First Friends, and appointed him commander-in-chief and governor-general.", "66": " Jonathan then returned to Jerusalem in peace and gladness.", "67": " In the year 165, Demetrius son of Demetrius came from Crete to the land of his ancestors.", "68": " When King Alexander heard of it he was plunged into gloom, and retired to Antioch.", "69": " Demetrius confirmed Apollonius as governor of Coele-Syria; the latter assembled a large force, encamped at Jamnia and sent the following message to Jonathan the high priest:", "70": " 'You are entirely alone in rising against us, and now I find myself ridiculed and reproached on your account. Why do you use your authority to our disadvantage in the mountains?", "71": " If you are so confident in your forces, come down now to meet us on the plain and let us take each other's measure there; on my side I have the strength of the towns.", "72": " Ask and learn who I am and who the others supporting us are. You will hear that you cannot stand up to us, since your ancestors were twice routed on their own ground,", "73": " nor will you now be able to withstand the cavalry or so great an army on the plain, where there is neither rock, nor stone, nor refuge of any kind.'", "74": " On hearing Apollonius' words, Jonathan's spirit was roused; he picked ten thousand men and left Jerusalem, and his brother Simon joined him with reinforcements.", "75": " He drew up his forces outside Joppa, the citizens having shut him out, since Apollonius had a garrison in Joppa. When they began the attack,", "76": " the citizens took fright and opened the gates, and Jonathan occupied Joppa.", "77": " Hearing this, Apollonius marshalled three thousand cavalry and a large army and made his way to Azotus as though intending to march through, while in fact pressing on into the plain, since he had a great number of cavalry on which he was relying.", "78": " Jonathan pursued him as far as Azotus, where the armies joined battle.", "79": " Now, Apollonius had left a thousand horsemen in concealment behind them.", "80": " Jonathan knew of this enemy position behind him; the horsemen surrounded his army, firing their arrows into his men from morning till evening.", "81": " But the troops stood firm, as Jonathan had ordered. Once the cavalry was exhausted,", "82": " Simon sent his own troops into attack against the phalanx, which he cut to pieces and routed.", "83": " The cavalry scattered over the plain and fled to Azotus, where they took sanctuary in Beth-Dagon, the temple of their idol.", "84": " Jonathan, however, set fire to Azotus and the surrounding towns, plundered them, and burned down the temple of Dagon, with all the fugitives who had crowded into it.", "85": " The enemy losses, counting those who fell by the sword and those burnt to death, totalled about eight thousand men.", "86": " Jonathan then left and pitched camp outside Ascalon, where the citizens came out to meet him with great ceremony.", "87": " Jonathan then returned to Jerusalem with his followers, laden with booty.", "88": " In the event, when King Alexander heard what had happened, he awarded Jonathan further honours:", "89": " he sent him the golden brooch, of the kind customarily presented to the King's Cousins, and gave him proprietary rights over Ekron and the land adjoining it."},
{"1": " The king of Egypt then assembled an army as numerous as the sands of the seashore, with many ships, and set out to take possession of Alexander's kingdom by a ruse and add it to his own kingdom.", "2": " He set off for Syria with protestations of peace, and the people of the towns opened their gates to him and came out to meet him, since King Alexander's orders were to welcome him, Ptolemy being his father-in-law.", "3": " On entering the towns, however, Ptolemy quartered troops as a garrison in each one.", "4": " When he reached Azotus he was shown the burnt-out temple of Dagon, with Azotus and its suburbs in ruins, corpses scattered here and there, and the charred remains of those whom Jonathan had burnt to death in the battle, piled into heaps along his route.", "5": " They explained to the king what Jonathan had done, hoping for his disapproval; but the king said nothing.", "6": " Jonathan went in state to meet the king at Joppa, where they greeted each other and spent the night.", "7": " Jonathan accompanied the king as far as the river called Eleutherus, and then returned to Jerusalem.", "8": " King Ptolemy for his part occupied the coastal towns as far as Seleucia on the coast, all the while maturing his wicked designs against Alexander.", "9": " He sent envoys to King Demetrius to say, 'Come and let us make a treaty; I shall give you my daughter, whom Alexander now has, and you shall rule your father's kingdom.", "10": " I regret having given my daughter to that man, since he has tried to kill me.'", "11": " He made this accusation because he coveted his kingdom.", "12": " Having carried off his daughter and bestowed her on Demetrius, he broke with Alexander, and their enmity became open.", "13": " Ptolemy next entered Antioch and assumed the crown of Asia; he now wore on his head the two crowns of Egypt and Asia.", "14": " King Alexander was in Cilicia at the time, since the people of those parts had risen in revolt,", "15": " but when he heard the news, he advanced on his rival to give battle, while Ptolemy for his part also took the field, met him with a strong force and routed him.", "16": " Alexander fled to Arabia for refuge, and King Ptolemy reigned supreme.", "17": " Zabdiel the Arab cut off Alexander's head and sent it to Ptolemy.", "18": " Three days later King Ptolemy died, and the Egyptian garrisons in the strongholds were killed by the local inhabitants.", "19": " So Demetrius became king in the year 167.", "20": " At the same time, Jonathan mustered the men of Judaea for an assault on the Citadel of Jerusalem, and they set up numerous siege-engines against it.", "21": " But some renegades who hated their nation made their way to the king and told him that Jonathan was besieging the Citadel.", "22": " The king was angered by the news. No sooner had he been informed than he set out and came to Ptolemais. He wrote to Jonathan, telling him to raise the siege and to meet him for a conference in Ptolemais as soon as possible.", "23": " When Jonathan heard this, he gave orders for the siege to continue; he then selected a deputation from the elders of Israel and the priests, and took the deliberate risk", "24": " of himself taking silver and gold, clothing and numerous other presents, and going to Ptolemais to face the king, whose favour he succeeded in winning;", "25": " and although one or two renegades of his nation brought charges against him,", "26": " the king treated him as his predecessors had treated him, and promoted him in the presence of all his friends.", "27": " He confirmed him in the high-priesthood and whatever other distinctions he already held, and had him ranked among the First Friends.", "28": " Jonathan asked the king to exempt Judaea and the three Samaritan districts from taxation, promising him three hundred talents in return.", "29": " The king consented, and wrote Jonathan a rescript covering the whole matter, in these terms:", "30": " 'King Demetrius to Jonathan his brother, and to the Jewish nation, greetings.", "31": " 'We have written to Lasthenes our cousin concerning you, and now send you this copy of our rescript for your own information:", "32": " \"King Demetrius to his father Lasthenes, greetings.", "33": " \"The nation of the Jews is our ally; they fulfil their obligations to us, and in view of their goodwill towards us we have decided to show them our bounty.", "34": " We confirm them in their possession of the territory of Judaea and the three districts of Aphairema, Lydda and Ramathaim; these were annexed to Judaea from Samaritan territory, with all their dependencies, in favour of all who offer sacrifice in Jerusalem, instead of the royal dues which the king formerly received from them every year, from the yield of the soil and the fruit crops. ", "35": " As regards our other rights over the tithes and taxes due to us, over the salt marshes, and the crown taxes due to us, as from today we release them from them all.", "36": " None of these grants will be revoked henceforth or anywhere.", "37": " You will make yourself responsible for having a copy of this made, to be given to Jonathan and displayed on the holy mountain in a conspicuous place.\" '", "38": " When King Demetrius saw that the country was at peace under his rule and that no resistance was offered him, he dismissed his forces, and sent all the men home, except for the foreign troops that he had recruited in the foreign island, thus incurring the enmity of the veterans who had served his ancestors. ", "39": " Now Trypho, one of Alexander's former supporters, noting that all the troops were muttering against Demetrius, went to see Iamleku, the Arab who was bringing up Antiochus, Alexander's young son,", "40": " and repeatedly urged him to let him have the boy, so that he might succeed his father as king; he told him of Demetrius' decision and of the resentment it had aroused among his troops. He spent a long time there.", "41": " Jonathan, meanwhile, sent to ask King Demetrius to withdraw the garrisons from the Citadel in Jerusalem and from the other fortresses, since they were constantly fighting Israel.", "42": " Demetrius sent word back to Jonathan, 'Not only will I do this for you and for your nation, but I shall heap honours on you and your nation if I find a favourable opportunity.", "43": " For the present, you would do well to send me reinforcements, since all my troops have deserted.'", "44": " Jonathan sent three thousand experienced soldiers to him in Antioch; when they reached the king, he was delighted at their arrival.", "45": " The citizens crowded together in the centre of the city, to the number of some hundred and twenty thousand, intending to kill the king.", "46": " The king took refuge in the palace, while the citizens occupied the thoroughfares of the city and began to attack.", "47": " The king then called on the Jews for help; and these all rallied round him, then fanned out through the city, and that day killed about a hundred thousand of its inhabitants.", "48": " They fired the city, seizing a great deal of plunder at the same time, and secured the king's safety.", "49": " When the citizens saw that the Jews had the city at their mercy, their courage failed them, and they made an abject appeal to the king,", "50": " 'Give us the right hand of peace, and let the Jews stop their fight against us and the city.'", "51": " They threw down their arms and made peace. The Jews were covered in glory, in the eyes of the king and of everyone else in his kingdom. Having won renown in his kingdom, they returned to Jerusalem laden with booty.", "52": " Thus, King Demetrius sat all the more securely on his royal throne, and the country was quiet under his government.", "53": " But he gave the lie to all the promises he had made, and changed his attitude to Jonathan, giving nothing in return for the services Jonathan had rendered him, but thwarting him at every turn.", "54": " After this, Trypho came back with the little boy Antiochus, who became king and was crowned.", "55": " All the troops that Demetrius had summarily dismissed rallied to Antiochus, and made war on Demetrius, who turned tail and fled.", "56": " Trypho captured the elephants and seized Antioch.", "57": " Young Antiochus then wrote as follows to Jonathan: 'I confirm you in the high-priesthood and set you over the four districts and appoint you one of the Friends of the King.'", "58": " He sent him a service of gold plate, and granted him the right to drink from gold vessels, and to wear the purple and the golden brooch.", "59": " He appointed his brother Simon commander-in-chief of the region from the Ladder of Tyre to the frontiers of Egypt.", "60": " Jonathan then set out and made a progress through Transeuphrates and its towns, and the entire Syrian army rallied to his support. He came to Ascalon and was received in state by the inhabitants.", "61": " From there he proceeded to Gaza, but the people of Gaza shut him out, so he laid siege to it, burning down its suburbs and plundering them.", "62": " The people of Gaza then pleaded with Jonathan, and he made peace with them; but he took the sons of their chief men as hostages and sent them away to Jerusalem. He then travelled through the country as far as Damascus.", "63": " Jonathan now learned that Demetrius' generals had arrived at Kadesh in Galilee with a large army, intending to remove him from office,", "64": " and went to engage them, leaving his brother Simon inside the country.", "65": " Simon laid siege to Beth-Zur, attacking it day after day, and blockading the inhabitants", "66": " till they sued for peace, which he granted them, though he expelled them from the town and occupied it, stationing a garrison there.", "67": " Jonathan and his army, meanwhile, having pitched camp by the Lake of Gennesar, rose early, and by morning were already in the plain of Hazor.", "68": " The foreigners' army advanced to fight them on the plain, having first positioned an ambush for him in the mountains. While the main body was advancing directly towards the Jews,", "69": " the troops in ambush broke cover and attacked first.", "70": " All the men with Jonathan fled; no one was left, except Mattathias son of Absalom and Judas son of Chalphi, the generals of his army.", "71": " At this, Jonathan tore his garments, put dust on his head, and prayed.", "72": " Then he returned to the fight and routed the enemy, who fled.", "73": " When the fugitives from his own forces saw this, they came back to him and joined in the pursuit as far as Kadesh where the enemy encampment was, and there they themselves pitched camp.", "74": " About three thousand of the foreign troops fell that day. Jonathan then returned to Jerusalem."},
{"1": " When Jonathan saw that circumstances were working in his favour, he sent a select mission to Rome to confirm and renew his treaty of friendship with the Romans.", "2": " He also sent letters to the same effect to the Spartans and to other places.", "3": " The envoys made their way to Rome, entered the Senate and said, 'Jonathan the high priest and the Jewish nation have sent us to renew your treaty of friendship and alliance with them as before.'", "4": " The Senate gave them letters to the authorities of each place, to procure their safe conduct to Judaea.", "5": " The following is the copy of the letter Jonathan wrote to the Spartans:", "6": " 'Jonathan the high priest, the senate of the nation, the priests and the rest of the Jewish people to the Spartans their brothers, greetings.", "7": " 'In the past, a letter was sent to Onias, the high priest, from Areios, one of your kings, stating that you are indeed our brothers, as the copy subjoined attests.", "8": " Onias received the envoy with honour, and accepted the letter, in which a clear declaration was made of friendship and alliance.", "9": " For our part, though we have no need of these, having the consolation of the holy books in our possession,", "10": " we venture to send to renew our fraternal friendship with you, so that we may not become strangers to you, a long time having elapsed since you last wrote to us.", "11": " We, for our part, on every occasion, at our festivals and on other appointed days, unfailingly remember you in the sacrifices we offer and in our prayers, as it is right and fitting to remember brothers.", "12": " We rejoice in your renown.", "13": " 'We ourselves, however, have had many trials and many wars, the neighbouring kings making war on us.", "14": " We were unwilling to trouble you or our other allies and friends during these wars,", "15": " since we have the support of Heaven to help us, thanks to which we have been delivered from our enemies, and they are the ones who have been brought low.", "16": " We have therefore chosen Numenius son of Antiochus, and Antipater son of Jason, and sent them to the Romans to renew our former treaty of friendship and alliance,", "17": " and we have ordered them also to visit you, to greet you and deliver you this letter of ours concerning the renewal of our brotherhood;", "18": " we shall be grateful for an answer to it.'", "19": " The following is the copy of the letter sent to Onias:", "20": " 'Areios king of the Spartans, to Onias the high priest, greetings.", "21": " 'It has been discovered in records regarding the Spartans and Jews that they are brothers, and of the race of Abraham.", "22": " Now that this has come to our knowledge, we shall be obliged if you will send us news of your welfare.", "23": " Our own message to you is this: your flocks and your possessions are ours, and ours are yours, and we are instructing our envoys to give you a message to this effect.'", "24": " Jonathan learned that Demetrius' generals had returned with a larger army than before to make war on him.", "25": " He therefore left Jerusalem and went to engage them in the area of Hamath, not giving them the time to invade his own territory.", "26": " He sent spies into their camp, who told him on their return that the enemy were taking up positions for a night attack on the Jews.", "27": " At sunset, Jonathan ordered his men to keep watch with their weapons at hand, in readiness to fight at any time during the night, and posted advance guards all round the camp.", "28": " On learning that Jonathan and his men were ready to fight, the enemy took fright and, with quaking hearts, lit fires in their bivouac and decamped.", "29": " Jonathan and his men, watching the glow of the fires, were unaware of their withdrawal until morning,", "30": " and although Jonathan pursued them, he failed to overtake them, for they had already crossed the river Eleutherus.", "31": " So Jonathan wheeled round on the Arabs called Zabadaeans, beat them and plundered them;", "32": " then, breaking camp, he went to Damascus, thus crossing the whole province.", "33": " Simon, meanwhile, had also set out and had penetrated as far as Ascalon and the neighbouring towns. He then turned on Joppa and moved quickly to occupy it,", "34": " for he had heard of their intention to hand over this strong point to the supporters of Demetrius; he stationed a garrison there to hold it.", "35": " Jonathan, on his return, called a meeting of the elders of the people and decided with them to build fortresses in Judaea", "36": " and to heighten the walls of Jerusalem and erect a high barrier between the Citadel and the city, to cut the former off from the city and isolate it, to prevent the occupants from buying or selling.", "37": " Rebuilding the city was a co-operative effort: part of the wall over the eastern ravine had fallen down; he restored the quarter called Chaphenatha.", "38": " Simon, meanwhile, rebuilt Adida in the lowlands, fortifying it, and erecting gates with bolts.", "39": " Trypho's ambition was to become king of Asia, assume the crown, and overpower King Antiochus.", "40": " He was apprehensive that Jonathan might not allow him to do this, and might even make war on him, so he set out and came to Beth-Shean, in the hopes of finding some pretext for having him arrested and put to death.", "41": " Jonathan went out to intercept him, with forty thousand picked men in battle order, and arrived at Beth-Shean.", "42": " When Trypho saw him there with a large force, he hesitated to make any move against him.", "43": " He even received him with honour, commended him to all his friends, gave him presents and ordered his friends and his troops to obey him as they would himself.", "44": " He said to Jonathan, 'Why have you given all these people so much trouble, when there is no threat of war between us?", "45": " Send them back home; pick yourself a few men as your bodyguard, and come with me to Ptolemais, which I am going to hand over to you, with the other fortresses and the remaining troops and all the officials; after which, I shall take the road for home. This was my purpose in coming here.'", "46": " Jonathan trusted him and did as he said; he dismissed his forces, who went back to Judaea.", "47": " With him he retained three thousand men, of whom he left two thousand in Galilee, while a thousand accompanied him.", "48": " But as soon as Jonathan had entered Ptolemais, the people of Ptolemais closed the gates, seized him, and put all those who had entered with him to the sword.", "49": " Trypho sent troops and cavalry into Galilee and the Great Plain to destroy all Jonathan's supporters.", "50": " These, concluding that he had been taken and had perished with his companions, encouraged one another, marching with closed ranks and ready to give battle,", "51": " and when their pursuers saw that they would fight for their lives, they turned back.", "52": " All reached Judaea safe and sound, and there they lamented Jonathan and his companions, being very frightened indeed; all Israel was plunged into mourning.", "53": " The surrounding nations were all now looking for ways of destroying them: 'They have no leader,' they said, 'no ally; we have only to attack them now, and we shall blot out their very memory from all peoples.'"},
{"1": " Simon heard that Trypho had collected a large army to invade and devastate Judaea,", "2": " and when he saw how the people were quaking with fear, he went up to Jerusalem, called the people together,", "3": " and exhorted them thus, 'You know yourselves how much I and my brothers and my father's family have done for the laws and the sanctuary; you know what wars and hardships we have experienced.", "4": " That is why my brothers are all dead, for Israel's sake, and I am the only one left.", "5": " Far be it from me, then, to be sparing of my own life in any time of oppression, for I am not worth more than my brothers.", "6": " Rather will I avenge my nation and the sanctuary and your wives and children, now that the foreigners are all united in malice to destroy us.'", "7": " The people's spirit rekindled as they listened to his words,", "8": " and they shouted back at him, 'You are our leader in place of Judas and your brother Jonathan.", "9": " Fight our battles for us, and we will do whatever you tell us.'", "10": " So he assembled all the fighting men and hurried on with completing the walls of Jerusalem, fortifying the whole perimeter.", "11": " He sent a considerable force to Joppa under Jonathan son of Absalom who drove out the inhabitants and remained there in occupation.", "12": " Trypho now left Ptolemais with a large army to invade Judaea, taking Jonathan with him under guard.", "13": " Simon pitched camp in Adida, facing the plain.", "14": " When Trypho learned that Simon had taken the place of his brother Jonathan and that he intended to join battle with him, he sent envoys to him with this message,", "15": " 'Your brother Jonathan was in debt to the royal exchequer for the offices he held; that is why we are detaining him.", "16": " If you send a hundred talents of silver and two of his sons as hostages, to make sure that on his release he does not revolt against us, we shall release him.'", "17": " Although Simon was aware that the message was a ruse, he sent for the money and the boys for fear of incurring great hostility from the people,", "18": " who would have said that Jonathan had died because Simon would not send Trypho the money and the children.", "19": " He therefore sent both the boys and the hundred talents, but Trypho broke his word and did not release Jonathan.", "20": " Next, Trypho set about the invasion and devastation of the country; he made a detour along the Adora road, but Simon and his army confronted him wherever he attempted to go.", "21": " The men in the Citadel kept sending messengers to Trypho, urging him to get through to them by way of the desert and send them supplies.", "22": " Trypho organised his entire cavalry to go, but that night it snowed so heavily that he could not get through for the snow, so he left there and moved off into Gilead.", "23": " As he approached Baskama he killed Jonathan, who was buried there.", "24": " Trypho turned back and regained his own country.", "25": " Simon sent and recovered the bones of his brother Jonathan, and buried him in Modein, the town of his ancestors.", "26": " All Israel kept solemn mourning for him and long bewailed him.", "27": " Over the tomb of his father and brothers, Simon raised a monument high enough to catch the eye, using dressed stone back and front.", "28": " He erected seven pyramids facing each other, for his father and mother and his four brothers,", "29": " surrounding them with a structure consisting of tall columns surmounted by trophies of arms to their everlasting memory and, beside the trophies of arms, ships sculpted on a scale to be seen by all who sail the sea.", "30": " Such was the monument he constructed at Modein, and it is still there today.", "31": " Now Trypho, betraying the trust of young King Antiochus, put him to death.", "32": " He usurped his throne, assuming the crown of Asia, and brought great havoc on the country.", "33": " Simon built up the fortresses of Judaea, surrounding them with high towers, great walls and gates with bolts, and stocked these fortresses with food.", "34": " He also sent a delegation to King Demetrius, to get him to grant the province a remission, since all Trypho did was to despoil.", "35": " King Demetrius replied to his request in a letter framed as follows:", "36": " 'King Demetrius to Simon, high priest and Friend of Kings, and to the elders and nation of the Jews, greetings.", "37": " 'It has pleased us to accept the golden crown and the palm you have sent us, and we are disposed to make a general peace with you, and to write to the officials to grant you remissions.", "38": " Everything that we have decreed concerning you remains in force, and the fortresses you have built may remain in your hands.", "39": " We pardon all offences, unwitting or intentional, hitherto committed, and remit the crown tax you now owe us; and whatever other taxes were levied in Jerusalem are no longer to be levied.", "40": " If any of you are suitable for enrolment in our bodyguard, let them be enrolled, and let there be peace between us.'", "41": " The gentile yoke was thus lifted from Israel in the year 170,", "42": " when our people began engrossing their documents and contracts: 'In the first year of Simon, eminent high priest, commander-in-chief and ethnarch of the Jews'.", "43": " About that time Simon laid siege to Gezer, surrounding it with his troops. He constructed a mobile tower, brought it up to the city, opened a breach in one of the bastions and took it.", "44": " The men in the mobile tower sprang out into the city, where great confusion ensued.", "45": " The citizens, accompanied by their wives and children, mounted the ramparts with their garments torn and loudly implored Simon to make peace with them:", "46": " 'Treat us', they said, 'not as our wickedness deserves, but as your mercy prompts you.'", "47": " Simon came to terms with them and stopped the fighting; but he expelled them from the city, purified the houses which contained idols, and then made his entry with songs of praise.", "48": " He banished all impurity from it, settled in it people who observed the Law, and having fortified it, built a residence there for himself.", "49": " The occupants of the Citadel in Jerusalem, prevented as they were from coming out and going into the countryside to buy and sell, were in desperate need of food, and numbers of them were being carried off by starvation.", "50": " They begged Simon to make peace with them, and he granted this, though he expelled them and purified the Citadel from its pollutions.", "51": " The Jews made their entry on the twenty-third day of the second month in the year 171, with acclamations and carrying palms, to the sound of lyres, cymbals and harps, chanting hymns and canticles, since a great enemy had been crushed and thrown out of Israel. Simon made it a day of annual rejoicing.", "52": " He fortified the Temple hill on the Citadel side, and took up residence there with his men.", "53": " Since his son John had come to manhood, Simon appointed him general-in-chief, with his residence in Gezer."},
{"1": " In the year 172, King Demetrius assembled his forces and marched into Media to raise help for the fight against Trypho.", "2": " When Arsaces king of Persia and Media heard that Demetrius had entered his territory, he sent one of his generals to capture him alive.", "3": " The general defeated the army of Demetrius, seized him and brought him to Arsaces, who imprisoned him.", "4": " The country was at peace throughout the days of Simon. He sought the good of his nation and they were well pleased with his authority, as with his magnificence, throughout his life.", "5": " To crown his titles to glory, he took Joppa and made it a harbour, gaining access to the Mediterranean Isles.", "6": " He enlarged the frontiers of his nation, keeping his mastery over the homeland,", "7": " resettling a host of captives. He conquered Gezer, Beth-Zur and the Citadel, ridding them of every impurity, and no one could resist him.", "8": " The people farmed their land in peace; the land gave its produce, the trees of the plain their fruit.", "9": " The elders sat at ease in the squares, all their talk was of their prosperity; the young men wore splendid armour.", "10": " He kept the towns supplied with provisions and furnished with fortifications, until his fame resounded to the ends of the earth.", "11": " He established peace in the land, and Israel knew great joy.", "12": " Each man sat under his own vine and his own fig tree, and there was no one to make them afraid.", "13": " No enemy was left in the land to fight them, the very kings of those times had been crushed.", "14": " He encouraged the afflicted members of his people, suppressing every wicked man and renegade. He strove to observe the Law,", "15": " and gave new splendour to the Temple, enriching it with many sacred vessels.", "16": " When it became known in Rome and as far as Sparta that Jonathan was dead, people were deeply grieved.", "17": " But as soon as they heard that his brother Simon had succeeded him as high priest and was master of the country and the cities in it,", "18": " they wrote to him on bronze tablets to renew the treaty of friendship and alliance which they had made with his brothers, Judas and Jonathan,", "19": " and the document was read out before the assembly in Jerusalem.", "20": " This is the copy of the letter sent by the Spartans: 'The rulers and the city of Sparta, to Simon the high priest and to the elders and priests and the rest of the people of the Jews, greetings.", "21": " 'The ambassadors whom you sent to our people have informed us of your glory and prosperity, and we are delighted with their visit.", "22": " We have recorded their declarations in the minutes of our public assemblies, as follows, \"Numenius son of Antiochus, and Antipater son of Jason, ambassadors of the Jews, came to us to renew their friendship with us.", "23": " And it was the people's pleasure to receive these personages with honour and to deposit a copy of their statements in the public archives, so that the people of Sparta might preserve a record of them. A copy was also made for Simon the high priest.\" '", "24": " After this, Simon sent Numenius to Rome as the bearer of a large golden shield weighing a thousand mina, to confirm the alliance with them.", "25": " When these events were reported to our people, they said, 'What mark of appreciation shall we give to Simon and his sons?", "26": " He stood firm, he and his brothers and his father's house: he fought off the enemies of Israel and secured its freedom.' So they recorded an inscription on bronze tablets and set it up on pillars on Mount Zion.", "27": " This is a copy of the text: 'The eighteenth of Elul, in the year 172, being the third year of Simon, eminent high priest:", "28": " 'In Asaramel, in the Grand Assembly of priests and people, of princes of the nation and of elders of the country: 'We are acquainted with the matters following:", "29": " 'When there was almost incessant fighting in the country Simon, son of Mattathias, a priest of the line of Joarib, and his brothers courted danger and withstood their nation's enemies to safeguard the integrity of their sanctuary and of the Law, and so brought their nation great glory;", "30": " 'For when, Jonathan having rallied his nation and become its high priest and having then been gathered to his ancestors,", "31": " the enemy planned to invade the country, intending to devastate their territory and to lay hands on their sanctuary,", "32": " Simon next came forward to fight for his nation: spending much of his personal wealth on arming his nation's fighting men and on providing their pay;", "33": " fortifying the towns of Judaea, as well as Beth-Zur on the Judaean frontier where the enemy arsenal had formerly been, and stationing in it a garrison of Jewish soldiers;", "34": " fortifying Joppa on the coast, and Gezer on the borders of Azotus, a place formerly inhabited by the enemy, founding a Jewish colony there, and providing the settlers with everything they needed to set them on their feet;", "35": " 'In consequence of which, the people, aware of Simon's loyalty and of the glory which he was determined to win for his nation, have made him their ethnarch and high priest, for all his services and for the integrity and loyalty which he has shown towards his nation, and for having by every means sought to enhance his people's power; ", "36": " 'It has fallen to him in his time to expel the foreigners from his country, including those in the City of David in Jerusalem, who had converted it into a citadel for their own use, from which they would sally out to defile the surroundings of the sanctuary and to violate its sacred character;", "37": " to station Jewish soldiers there instead for the security of the country and the city; and to heighten the walls of Jerusalem;", "38": " 'And since King Demetrius has heard that the Romans call the Jews their friends, allies and brothers,", "39": " and that they have given an honourable reception to Simon's ambassadors, and, furthermore,", "40": " that the Jews and priests are happy that Simon should, pending the advent of a genuine prophet, be their ethnarch and high priest for life", "41": " therefore he has confirmed him in the high-priestly office, has raised him to the rank of Friend and has showered great honours on him, also confirming him as their commander-in-chief,", "42": " with the right to appoint officials to oversee the fabric of the sanctuary and to administer the country, munitions and fortresses;", "43": " he is to have personal charge of the sanctuary, and to be obeyed by all; all official documents in the country must be drawn up in his name; and he may assume the purple and may wear golden ornaments;", "44": " 'Furthermore, it is against the law for any member of the public or of the priesthood to contravene any of these enactments or to contest his decisions, or to convene a meeting anywhere in the country without his permission, or to assume the purple or wear the golden brooch;", "45": " and anyone acting contrary to, or rejecting any article of, these enactments is liable to punishment;", "46": " 'And since the people have unanimously agreed to grant Simon the right to act as aforesaid, and", "47": " since Simon, for his part, has given his assent, and has consented to assume the high-priestly office and to be commander-in-chief and ethnarch of the Jews and their priests, and to preside over all:", "48": " 'So, be it now enacted: that this record be inscribed on bronze tablets and be erected at some conspicuous place within the precincts of the Temple,", "49": " and that copies be deposited in the Treasury for Simon and his descendants.'"},
{"1": " Antiochus son of King Demetrius addressed a letter from the Mediterranean Isles to Simon, priest and ethnarch of the Jews, and to the whole nation;", "2": " this was how it read: 'King Antiochus to Simon, high priest and ethnarch, and to the Jewish nation, greetings.", "3": " 'Whereas certain scoundrels have seized control of the kingdom of our fathers, and I propose to claim back the kingdom so that I may re-establish it as it was before, and whereas I have accordingly recruited very large forces and fitted out warships,", "4": " intending to make a landing in the country and to hunt down the men who have ruined it and laid waste many towns in my kingdom;", "5": " 'I now, therefore, confirm in your favour all remissions of taxes granted to you by the kings my predecessors, as well as the waiving of whatever presents they may have conceded.", "6": " I hereby authorise you to mint your own coinage as legal tender for your own country.", "7": " I declare Jerusalem and the sanctuary to be free; all the arms you have manufactured and the fortresses you have built and now occupy may remain yours.", "8": " All debts to the royal treasury, present or future, are cancelled henceforth in perpetuity.", "9": " Furthermore, when we have won back our kingdom, we shall bestow such great honour on yourself, your nation and the sanctuary as will make your glory known throughout the world.'", "10": " Antiochus invaded the land of his ancestors in the year 174 and, since the troops all rallied to him, Trypho was left with few supporters.", "11": " Antiochus pursued the usurper, who took refuge in Dora on the coast,", "12": " knowing that misfortunes were piling up on him and that his troops had deserted him.", "13": " Antiochus pitched camp outside Dora with a hundred and twenty thousand fighting men and eight thousand cavalry.", "14": " He laid siege to the city while the ships closed in from the sea, so that he had the city under attack from land and sea, and allowed no one to go in or come out.", "15": " Numenius and his companions, meanwhile, arrived from Rome, bringing letters addressed to various kings and states, in the following terms:", "16": " 'Lucius, consul of the Romans, to King Ptolemy, greetings.", "17": " 'The Jewish ambassadors have come to us as our friends and allies to renew our original friendship and alliance in the name of the high priest Simon and the Jewish people.", "18": " They have brought a golden shield worth a thousand mina.", "19": " Accordingly, we have seen fit to write to various kings and states, warning them neither to molest the Jewish people nor to attack either them or their towns or their country, nor to ally themselves with any such aggressors.", "20": " We have seen fit to accept the shield from them.", "21": " If, therefore, any scoundrels have fled their country to take refuge with you, hand them over to Simon the high priest, to be punished by him according to their law.'", "22": " The consul sent the same letter to King Demetrius, to Attalus, Ariarathes and Arsaces,", "23": " and to all states, including Sampsames, the Spartans, Delos, Myndos, Sicyon, Caria, Samos, Pamphylia, Lycia, Halicarnassus, Rhodes, Phaselis, Cos, Side, Arados, Gortyn, Cyprus and Cyrene.", "24": " They also drew up a copy for Simon the high priest.", "25": " Antiochus, meanwhile, from his positions on the outskirts of Dora, was continually throwing detachments against the town. He constructed siege-engines, and blockaded Trypho, preventing movement in or out.", "26": " Simon sent him two thousand picked men to support him in the fight, with silver and gold and plenty of equipment.", "27": " But Antiochus would not accept them; instead, he repudiated all his previous agreements with Simon and completely changed his attitude to him.", "28": " He sent him Athenobius, one of his Friends, to confer with him and say, 'You are now occupying Joppa and Gezer and the Citadel in Jerusalem, which are towns in my kingdom.", "29": " You have laid waste their territory and done immense harm to the country; and you have seized control of many places properly in my kingdom.", "30": " Either now surrender the towns you have taken and the taxes from the places you have seized outside the frontiers of Judaea,", "31": " or else pay me five hundred talents of silver in compensation for them and for the destruction you have done, and another five hundred talents for the taxes from the towns; otherwise we shall come and make war on you.'", "32": " When the King's Friend, Athenobius, reached Jerusalem and saw Simon's magnificence, his cabinet of gold and silver plate and the state he kept, he was dumbfounded. He delivered the king's message,", "33": " but Simon gave him this answer, 'We have not taken foreign territory or any alien property but have occupied our ancestral heritage, for some time unjustly wrested from us by our enemies;", "34": " now that we have a favourable opportunity, we are merely recovering our ancestral heritage.", "35": " As regards Joppa and Gezer, which you claim, these were towns that did great harm to our people and laid waste our country; we are prepared to give a hundred talents for them.' Without so much as a word in answer,", "36": " the envoy went back to the king in a rage and reported on Simon's answer and his magnificence, and on everything he had seen, at which the king fell into a fury.", "37": " Trypho now boarded a ship and escaped to Orthosia.", "38": " The king appointed Cendebaeus military governor of the coastal region and allotted him a force of infantry and cavalry.", "39": " He ordered him to deploy his men facing Judaea, and instructed him to rebuild Kedron and fortify its gates, and to make war on our people, while the king himself went in pursuit of Trypho.", "40": " Cendebaeus arrived at Jamnia and began to provoke our people forthwith, invading Judaea, taking prisoners, and massacring.", "41": " Having rebuilt Kedron, he stationed cavalry and troops there to make sorties and patrol the roads of Judaea, as the king had ordered."},
{"1": " John then went up from Gezer and reported to his father Simon what Cendebaeus was busy doing.", "2": " At this, Simon summoned his two elder sons, Judas and John, and said to them, 'My brothers and I, and my father's House, have fought the enemies of Israel from our youth until today, and many a time we have been successful in rescuing Israel.", "3": " But now I am an old man, while you, by the mercy of Heaven, are the right age; take the place of my brother and myself, go out and fight for our nation, and may Heaven's aid be with you.'", "4": " He then selected twenty thousand of the country's fighting men and cavalry, and these marched against Cendebaeus, spending the night at Modein.", "5": " Making an early start, they marched into the plain, to find a large army opposing them, both infantry and cavalry; there was, however, a stream-bed in between.", "6": " John drew up facing them, he and his army and, seeing that the men were afraid to cross the stream-bed, crossed over first himself. When his men saw this, they too crossed after him.", "7": " He divided his army into two, with the cavalry in the centre and the infantry on either flank, as the opposing cavalry was very numerous.", "8": " The trumpets rang out; Cendebaeus and his army were put to flight, many of them falling mortally wounded and the rest of them fleeing to the fortress.", "9": " Then it was that Judas, John's brother, was wounded, but John pursued them until Cendebaeus reached Kedron, which he had rebuilt.", "10": " Their flight took them as far as the towers in the countryside of Azotus, and John burnt these down. The enemy losses amounted to ten thousand men; John returned safely to Judaea.", "11": " Ptolemy son of Abubos had been appointed general in command of the Plain of Jericho; he owned a great deal of silver and gold,", "12": " and was the high priest's son-in-law.", "13": " His ambition was fired; he hoped to make himself master of the whole country and therefore treacherously began to plot the destruction of Simon and his sons.", "14": " Simon, who was inspecting the towns up and down the country and attending to their administration, had come down to Jericho with his sons Mattathias and Judas, in the year 172, in the eleventh month, the month of Shebat.", "15": " The son of Abubos lured them into a small fortress called Dok, which he had built, where he offered them a great banquet, having previously hidden men in the place.", "16": " When Simon and his sons were drunk, Ptolemy and his men reached for their weapons, rushed on Simon in the banqueting hall and killed him with his two sons and some of his servants.", "17": " He thus committed a great act of treachery and rendered evil for good.", "18": " Ptolemy wrote a report of the affair and sent it to the king, in the expectation of being sent reinforcements and of having the cities and the province made over to him.", "19": " He also sent people to Gezer to murder John, and sent written orders to the military commanders to come to him so that he could give them silver, gold and presents;", "20": " and he also sent others to seize control of Jerusalem and the Temple mount.", "21": " But someone had been too quick for him and had already informed John in Gezer that his father and brothers had perished, adding, 'He is sending someone to kill you too!'", "22": " Overcome as John was by the news, he arrested the men who had come to kill him and put them to death, being forewarned of their murderous design.", "23": " The rest of John's acts, the battles he fought and the exploits he performed, the city walls he built, and all his other achievements,", "24": " from the day he succeeded his father as high priest, are recorded in the annals of his pontificate."}
]