[
    {
        "date": "2025-06-01",
        "sections": [],
        "title": "Seventh Sunday of Easter - Ascension",
        "url": "https://bible.usccb.org/bible/readings/060125.cfm"
    },
    {
        "date": "2025-06-08",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "When the time for Pentecost was fulfilled,\nthey were all in one place together.\nAnd suddenly there came from the sky\na noise like a strong driving wind,\nand it filled the entire house in which they were.\nThen there appeared to them tongues as of fire,\nwhich parted and came to rest on each one of them.\nAnd they were all filled with the Holy Spirit\nand began to speak in different tongues,\nas the Spirit enabled them to proclaim.\n\nNow there were devout Jews from every nation under heaven\nstaying in Jerusalem.\nAt this sound, they gathered in a large crowd,\nbut they were confused\nbecause each one heard them speaking in his own language.\nThey were astounded, and in amazement they asked,\n\"Are not all these people who are speaking Galileans?\nThen how does each of us hear them in his native language?\nWe are Parthians, Medes, and Elamites,\ninhabitants of Mesopotamia, Judea and Cappadocia,\nPontus and Asia, Phrygia and Pamphylia,\nEgypt and the districts of Libya near Cyrene,\nas well as travelers from Rome,\nboth Jews and converts to Judaism, Cretans and Arabs,\nyet we hear them speaking in our own tongues\nof the mighty acts of God.\"",
                        "verses": [
                            {
                                "book": "Acts",
                                "link": "https://bible.usccb.org/bible/acts/2?1",
                                "text": "Acts 2:1-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 30) Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nBless the LORD, O my soul!\nO LORD, my God, you are great indeed!\nHow manifold are your works, O LORD!\nthe earth is full of your creatures;\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nMay the glory of the LORD endure forever;\nmay the LORD be glad in his works!\nPleasing to him be my theme;\nI will be glad in the LORD.\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.\nIf you take away their breath, they perish\nand return to their dust.\nWhen you send forth your spirit, they are created,\nand you renew the face of the earth.\nR. Lord, send out your Spirit, and renew the face of the earth.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/104?1",
                                "text": "Psalm 104:1, 24, 29-30, 31, 34"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nNo one can say, \"Jesus is Lord,\" except by the Holy Spirit.\n\nThere are different kinds of spiritual gifts but the same Spirit;\nthere are different forms of service but the same Lord;\nthere are different workings but the same God\nwho produces all of them in everyone.\nTo each individual the manifestation of the Spirit\nis given for some benefit.\n\nAs a body is one though it has many parts,\nand all the parts of the body, though many, are one body,\nso also Christ.\nFor in one Spirit we were all baptized into one body,\nwhether Jews or Greeks, slaves or free persons,\nand we were all given to drink of one Spirit.",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1Corinthians/12?3",
                                "text": "1 Corinthians 12:3b-7, 12-13"
                            }
                        ]
                    },
                    {
                        "text": "Brothers and sisters:\nThose who are in the flesh cannot please God.\nBut you are not in the flesh;\non the contrary, you are in the spirit,\nif only the Spirit of God dwells in you.\nWhoever does not have the Spirit of Christ does not belong to him.\nBut if Christ is in you,\nalthough the body is dead because of sin,\nthe spirit is alive because of righteousness.\nIf the Spirit of the one who raised Jesus from the dead dwells in you,\nthe one who raised Christ from the dead\nwill give life to your mortal bodies also,\nthrough his Spirit that dwells in you.\nConsequently, brothers and sisters,\nwe are not debtors to the flesh,\nto live according to the flesh.\nFor if you live according to the flesh, you will die,\nbut if by the Spirit you put to death the deeds of the body,\nyou will live.\n\nFor those who are led by the Spirit of God are sons of God.\nFor you did not receive a spirit of slavery to fall back into fear,\nbut you received a Spirit of adoption,\nthrough whom we cry, \"Abba, Father!\"\nThe Spirit himself bears witness with our spirit\nthat we are children of God,\nand if children, then heirs,\nheirs of God and joint heirs with Christ,\nif only we suffer with him\nso that we may also be glorified with him.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/8?8",
                                "text": "Romans 8:8-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Sequence Veni, Sancte Spiritus",
                "readings": [
                    {
                        "text": "Come, Holy Spirit, come!\nAnd from your celestial home\n Shed a ray of light divine!\nCome, Father of the poor!\nCome, source of all our store!\n Come, within our bosoms shine.\nYou, of comforters the best;\nYou, the soul's most welcome guest;\n Sweet refreshment here below;\nIn our labor, rest most sweet;\nGrateful coolness in the heat;\n Solace in the midst of woe.\nO most blessed Light divine,\nShine within these hearts of yours,\n And our inmost being fill!\nWhere you are not, we have naught,\nNothing good in deed or thought,\n Nothing free from taint of ill.\nHeal our wounds, our strength renew;\nOn our dryness pour your dew;\n Wash the stains of guilt away:\nBend the stubborn heart and will;\nMelt the frozen, warm the chill;\n Guide the steps that go astray.\nOn the faithful, who adore\nAnd confess you, evermore\n In your sevenfold gift descend;\nGive them virtue's sure reward;\nGive them your salvation, Lord;\n Give them joys that never end. Amen.\n Alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "SEQUENCE"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nCome, Holy Spirit, fill the hearts of your faithful\nand kindle in them the fire of your love.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "On the evening of that first day of the week,\nwhen the doors were locked, where the disciples were,\nfor fear of the Jews,\nJesus came and stood in their midst\nand said to them, \"Peace be with you.\"\nWhen he had said this, he showed them his hands and his side.\nThe disciples rejoiced when they saw the Lord.\nJesus said to them again, \"Peace be with you.\nAs the Father has sent me, so I send you.\"\nAnd when he had said this, he breathed on them and said to them,\n\"Receive the Holy Spirit.\nWhose sins you forgive are forgiven them,\nand whose sins you retain are retained.\"",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/20?19",
                                "text": "John 20:19-23"
                            }
                        ]
                    },
                    {
                        "text": "Jesus said to his disciples:\n\"If you love me, you will keep my commandments.\nAnd I will ask the Father,\nand he will give you another Advocate to be with you always.\n\n\"Whoever loves me will keep my word,\nand my Father will love him,\nand we will come to him and make our dwelling with him.\nThose who do not love me do not keep my words;\nyet the word you hear is not mine\nbut that of the Father who sent me.\n\n\"I have told you this while I am with you.\nThe Advocate, the Holy Spirit whom the Father will send in my name,\nwill teach you everything\nand remind you of all that I told you.\"",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/14?15",
                                "text": "John 14:15-16, 23b-26"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Pentecost Sunday - Mass during the Day",
        "type_": "DAY",
        "url": "https://bible.usccb.org/bible/readings/060825-Day.cfm"
    },
    {
        "date": "2025-06-15",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "Thus says the wisdom of God:\n            \"The LORD possessed me, the beginning of his ways,\n                        the forerunner of his prodigies of long ago;\n            from of old I was poured forth,\n                        at the first, before the earth.\n            When there were no depths I was brought forth,\n                        when there were no fountains or springs of water;\n            before the mountains were settled into place,\n                        before the hills, I was brought forth;\n            while as yet the earth and fields were not made,\n                        nor the first clods of the world.\n\n            \"When the Lord established the heavens I was there,\n                        when he marked out the vault over the face of the deep;\n            when he made firm the skies above,\n                        when he fixed fast the foundations of the earth;\n            when he set for the sea its limit,\n                        so that the waters should not transgress his command;\n            then was I beside him as his craftsman,\n                        and I was his delight day by day,\n            playing before him all the while,\n                        playing on the surface of his earth;\n                        and I found delight in the human race.\"",
                        "verses": [
                            {
                                "book": "Proverbs",
                                "link": "https://bible.usccb.org/bible/proverbs/8?22",
                                "text": "Proverbs 8:22-31"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R (2a)  O Lord, our God, how wonderful your name in all the earth!\nWhen I behold your heavens, the work of your fingers,\n            the moon and the stars which you set in place —\nWhat is man that you should be mindful of him,\n            or the son of man that you should care for him?\nR O Lord, our God, how wonderful your name in all the earth!\nYou have made him little less than the angels,\n            and crowned him with glory and honor.\nYou have given him rule over the works of your hands,\n            putting all things under his feet:\nR O Lord, our God, how wonderful your name in all the earth!\nAll sheep and oxen,\n            yes, and the beasts of the field,\nThe birds of the air, the fishes of the sea,\n            and whatever swims the paths of the seas.\nR O Lord, our God, how wonderful your name in all the earth!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/8?4",
                                "text": "Psalm 8:4-5, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nTherefore, since we have been justified by faith,\nwe have peace with God through our Lord Jesus Christ,\nthrough whom we have gained access by faith\nto this grace in which we stand,\nand we boast in hope of the glory of God.\nNot only that, but we even boast of our afflictions,\nknowing that affliction produces endurance,\nand endurance, proven character,\nand proven character, hope,\nand hope does not disappoint,\nbecause the love of God has been poured out into our hearts\nthrough the Holy Spirit that has been given to us.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/5?1",
                                "text": "Romans 5:1-5"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nGlory to the Father, the Son, and the Holy Spirit;\nto God who is, who was, and who is to come.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Revelation",
                                "link": "https://bible.usccb.org/bible/revelation/1?8",
                                "text": "Cf. Revelation 1:8"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to his disciples:\n\"I have much more to tell you, but you cannot bear it now.\nBut when he comes, the Spirit of truth,\nhe will guide you to all truth.\nHe will not speak on his own,\nbut he will speak what he hears,\nand will declare to you the things that are coming.\nHe will glorify me,\nbecause he will take from what is mine and declare it to you.\nEverything that the Father has is mine;\nfor this reason I told you that he will take from what is mine\nand declare it to you.\"",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/16?12",
                                "text": "John 16:12-15"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of the Most Holy Trinity",
        "url": "https://bible.usccb.org/bible/readings/061525.cfm"
    },
    {
        "date": "2025-06-22",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "In those days, Melchizedek, king of Salem, brought out bread and wine,\nand being a priest of God Most High,\nhe blessed Abram with these words:\n            \"Blessed be Abram by God Most High,\n                        the creator of heaven and earth;\n            and blessed be God Most High,\n                        who delivered your foes into your hand.\"\nThen Abram gave him a tenth of everything.",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/genesis/14?18",
                                "text": "Genesis 14:18-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R (4b)  You are a priest for ever, in the line of Melchizedek.\nThe LORD said to my Lord: \"Sit at my right hand\n            till I make your enemies your footstool.\"\nR You are a priest for ever, in the line of Melchizedek.\nThe scepter of your power the LORD will stretch forth from Zion:\n            \"Rule in the midst of your enemies.\"\nR You are a priest for ever, in the line of Melchizedek.\n\"Yours is princely power in the day of your birth, in holy splendor;\n            before the daystar, like the dew, I have begotten you.\"\nR You are a priest for ever, in the line of Melchizedek.\nThe LORD has sworn, and he will not repent:\n            \"You are a priest forever, according to the order of  Melchizedek.\"\nR You are a priest for ever, in the line of Melchizedek.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/110?1",
                                "text": "Psalm 110:1, 2, 3, 4"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nI received from the Lord what I also handed on to you,\nthat the Lord Jesus, on the night he was handed over,\ntook bread, and, after he had given thanks,\nbroke it and said, \"This is my body that is for you.\nDo this in remembrance of me.\"\nIn the same way also the cup, after supper, saying,\n\"This cup is the new covenant in my blood.\nDo this, as often as you drink it, in remembrance of me.\"\nFor as often as you eat this bread and drink the cup,\nyou proclaim the death of the Lord until he comes.",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1corinthians/11?23",
                                "text": "1 Corinthians 11:23-26"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI am the living bread that came down from heaven, says the Lord;\nwhoever eats this bread will live forever.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?51",
                                "text": "John 6:51"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus spoke to the crowds about the kingdom of God,\nand he healed those who needed to be cured.\nAs the day was drawing to a close,\nthe Twelve approached him and said,\n\"Dismiss the crowd\nso that they can go to the surrounding villages and farms\nand find lodging and provisions;\nfor we are in a deserted place here.\"\nHe said to them, \"Give them some food yourselves.\"\nThey replied, \"Five loaves and two fish are all we have,\nunless we ourselves go and buy food for all these people.\"\nNow the men there numbered about five thousand.\nThen he said to his disciples,\n\"Have them sit down in groups of about fifty.\"\nThey did so and made them all sit down.\nThen taking the five loaves and the two fish,\nand looking up to heaven,\nhe said the blessing over them, broke them,\nand gave them to the disciples to set before the crowd.\nThey all ate and were satisfied.\nAnd when the leftover fragments were picked up,\nthey filled twelve wicker baskets.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/9?11",
                                "text": "Luke 9:11b-17"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of the Most Holy Body and Blood of Christ",
        "url": "https://bible.usccb.org/bible/readings/062225.cfm"
    },
    {
        "date": "2025-06-29",
        "sections": [],
        "title": "Solemnity of Saints Peter and Paul, Apostles",
        "url": "https://bible.usccb.org/bible/readings/062925.cfm"
    },
    {
        "date": "2025-07-06",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Thus says the LORD:\n Rejoice with Jerusalem and be glad because of her,\n all you who love her;\n exult, exult with her,\n all you who were mourning over her!\n Oh, that you may suck fully\n of the milk of her comfort,\n that you may nurse with delight\n at her abundant breasts!\n For thus says the LORD:\n Lo, I will spread prosperity over Jerusalem like a river,\n and the wealth of the nations like an overflowing torrent.\n As nurslings, you shall be carried in her arms,\n and fondled in her lap;\n as a mother comforts her child,\n so will I comfort you;\n in Jerusalem you shall find your comfort.\n\n When you see this, your heart shall rejoice\n and your bodies flourish like the grass;\n the LORD's power shall be known to his servants.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/66?10",
                                "text": "Isaiah 66:10-14c"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) Let all the earth cry out to God with joy.\nShout joyfully to God, all the earth,\n sing praise to the glory of his name;\n proclaim his glorious praise.\nSay to God, \"How tremendous are your deeds!\"\nR. Let all the earth cry out to God with joy.\n\"Let all on earth worship and sing praise to you,\n sing praise to your name!\"\nCome and see the works of God,\n his tremendous deeds among the children of Adam.\nR. Let all the earth cry out to God with joy.\nHe has changed the sea into dry land;\n through the river they passed on foot;\n therefore let us rejoice in him.\nHe rules by his might forever.\nR. Let all the earth cry out to God with joy. \nHear now, all you who fear God, while I declare\n what he has done for me.\nBlessed be God who refused me not\n my prayer or his kindness!\nR. Let all the earth cry out to God with joy.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/66?1",
                                "text": "Psalm 66:1-3, 4-5, 6-7, 16, 20"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nMay I never boast except in the cross of our Lord Jesus Christ,\nthrough which the world has been crucified to me,\nand I to the world.\nFor neither does circumcision mean anything, nor does uncircumcision,\nbut only a new creation.\nPeace and mercy be to all who follow this rule\nand to the Israel of God.\n\nFrom now on, let no one make troubles for me;\nfor I bear the marks of Jesus on my body.\n\nThe grace of our Lord Jesus Christ be with your spirit,\nbrothers and sisters. Amen.",
                        "verses": [
                            {
                                "book": "Galatians",
                                "link": "https://bible.usccb.org/bible/Galatians/6?14",
                                "text": "Galatians 6:14-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet the peace of Christ control your hearts;\nlet the word of Christ dwell in you richly.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/3?15",
                                "text": "Colossians 3:15a, 16a"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "At that time the Lord appointed seventy-two others\nwhom he sent ahead of him in pairs\nto every town and place he intended to visit.\nHe said to them,\n\"The harvest is abundant but the laborers are few;\nso ask the master of the harvest\nto send out laborers for his harvest.\nGo on your way;\nbehold, I am sending you like lambs among wolves.\nCarry no money bag, no sack, no sandals;\nand greet no one along the way.\nInto whatever house you enter, first say,\n'Peace to this household.'\nIf a peaceful person lives there,\nyour peace will rest on him;\nbut if not, it will return to you.\nStay in the same house and eat and drink what is offered to you,\nfor the laborer deserves his payment.\nDo not move about from one house to another.\nWhatever town you enter and they welcome you,\neat what is set before you,\ncure the sick in it and say to them,\n'The kingdom of God is at hand for you.'\nWhatever town you enter and they do not receive you,\ngo out into the streets and say,\n'The dust of your town that clings to our feet,\neven that we shake off against you.'\nYet know this: the kingdom of God is at hand.\nI tell you,\nit will be more tolerable for Sodom on that day than for that town.\"\n\nThe seventy-two returned rejoicing, and said,\n\"Lord, even the demons are subject to us because of your name.\"\nJesus said, \"I have observed Satan fall like lightning from the sky.\nBehold, I have given you the power to 'tread upon serpents' and  scorpions\nand upon the full force of the enemy and nothing will harm you.  Nevertheless, do not rejoice because the spirits are subject to you,\nbut rejoice because your names are written in heaven.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?1",
                                "text": "Luke 10:1-12, 17-20"
                            }
                        ]
                    },
                    {
                        "text": "At that time the Lord appointed seventy-two others\nwhom he sent ahead of him in pairs\nto every town and place he intended to visit.\nHe said to them,\n\"The harvest is abundant but the laborers are few;\nso ask the master of the harvest\nto send out laborers for his harvest.\nGo on your way;\nbehold, I am sending you like lambs among wolves.\nCarry no money bag, no sack, no sandals;\nand greet no one along the way.\nInto whatever house you enter, first say,\n'Peace to this household.'\nIf a peaceful person lives there,\nyour peace will rest on him;\nbut if not, it will return to you.\nStay in the same house and eat and drink what is offered to you,\nfor the laborer deserves his payment.\nDo not move about from one house to another.\nWhatever town you enter and they welcome you,\neat what is set before you,\ncure the sick in it and say to them,\n'The kingdom of God is at hand for you.'\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?1",
                                "text": "Luke 10:1-9"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fourteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/070625.cfm"
    },
    {
        "date": "2025-07-13",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Moses said to the people:\n\"If only you would heed the voice of the LORD, your God,\nand keep his commandments and statutes\nthat are written in this book of the law,\nwhen you return to the LORD, your God,\nwith all your heart and all your soul.\n\n\"For this command that I enjoin on you today\nis not too mysterious and remote for you.\nIt is not up in the sky, that you should say,\n'Who will go up in the sky to get it for us\nand tell us of it, that we may carry it out?'\nNor is it across the sea, that you should say,\n'Who will cross the sea to get it for us\nand tell us of it, that we may carry it out?'\nNo, it is something very near to you,\nalready in your mouths and in your hearts;\nyou have only to carry it out.\"",
                        "verses": [
                            {
                                "book": "Deuteronomy",
                                "link": "https://bible.usccb.org/bible/Deuteronomy/30?10",
                                "text": "Deuteronomy 30:10-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 33)  Turn to the Lord in your need, and you will live.I pray to you, O LORD, for the time of your favor, O God!In your great kindness answer me with your constant help.Answer me, O LORD, for bounteous is your kindness: in your great mercy turn toward me.R. Turn to the Lord in your need, and you will live.I am afflicted and in pain; let your saving help, O God, protect me.I will praise the name of God in song, and I will glorify him with thanksgiving.R. Turn to the Lord in your need, and you will live.\"See, you lowly ones, and be glad; you who seek God, may your hearts revive!For the LORD hears the poor, and his own who are in bonds he spurns not.\"R. Turn to the Lord in your need, and you will live.For God will save Zion and rebuild the cities of Judah.The descendants of his servants shall inherit it, and those who love his name shall inhabit it.R. Turn to the Lord in your need, and you will live.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/69?14",
                                "text": "Psalm 69:14, 17, 30-31, 33-34, 36, 37"
                            }
                        ]
                    },
                    {
                        "text": "R.(9a) Your words, Lord, are Spirit and life.\nThe law of the LORD is perfect,\n refreshing the soul;\nthe decree of the LORD is trustworthy,\n giving wisdom to the simple.\nR. Your words, Lord, are Spirit and life.\nThe precepts of the LORD are right,\n rejoicing the heart;\nthe command of the LORD is clear,\n enlightening the eye.\nR. Your words, Lord, are Spirit and life.\nThe fear of the LORD is pure,\n enduring forever;\nthe ordinances of the LORD are true,\n all of them just.\nR. Your words, Lord, are Spirit and life.\nThey are more precious than gold,\n than a heap of purest gold;\nsweeter also than syrup\n or honey from the comb.\nR. Your words, Lord, are Spirit and life.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/19?8",
                                "text": "Psalm 19:8, 9, 10, 11"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Christ Jesus is the image of the invisible God,\nthe firstborn of all creation.\nFor in him were created all things in heaven and on earth,\nthe visible and the invisible,\nwhether thrones or dominions or principalities or powers;\nall things were created through him and for him.\nHe is before all things,\nand in him all things hold together.\nHe is the head of the body, the church.\nHe is the beginning, the firstborn from the dead,\nthat in all things he himself might be preeminent.\nFor in him all the fullness was pleased to dwell,\nand through him to reconcile all things for him,\nmaking peace by the blood of his cross\nthrough him, whether those on earth or those in heaven.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?15",
                                "text": "Colossians 1:15-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nYour words, Lord, are Spirit and life;\nyou have the words of everlasting life.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?63",
                                "text": "Cf. John 6:63c, 68c"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "There was a scholar of the law who stood up to test Jesus and said,\"Teacher, what must I do to inherit eternal life?\"Jesus said to him, \"What is written in the law?How do you read it?\"He said in reply,\"You shall love the Lord, your God,with all your heart,with all your being,with all your strength,and with all your mind,and your neighbor as yourself.\"He replied to him, \"You have answered correctly;do this and you will live.\"But because he wished to justify himself, he said to Jesus,\"And who is my neighbor?\"Jesus replied,\"A man fell victim to robbersas he went down from Jerusalem to Jericho.They stripped and beat him and went off leaving him half-dead.A priest happened to be going down that road,but when he saw him, he passed by on the opposite side.Likewise a Levite came to the place,and when he saw him, he passed by on the opposite side.But a Samaritan traveler who came upon himwas moved with compassion at the sight.He approached the victim,poured oil and wine over his wounds and bandaged them.Then he lifted him up on his own animal,took him to an inn, and cared for him.The next day he took out two silver coinsand gave them to the innkeeper with the instruction,'Take care of him.If you spend more than what I have given you,I shall repay you on my way back.'Which of these three, in your opinion,was neighbor to the robbers' victim?\"He answered, \"The one who treated him with mercy.\"Jesus said to him, \"Go and do likewise.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?25",
                                "text": "Luke 10:25-37"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fifteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/071325.cfm"
    },
    {
        "date": "2025-07-20",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The LORD appeared to Abraham by the terebinth of Mamre,\nas he sat in the entrance of his tent,\nwhile the day was growing hot.\nLooking up, Abraham saw three men standing nearby.\nWhen he saw them, he ran from the entrance of the tent to greet them;\nand bowing to the ground, he said:\n\"Sir, if I may ask you this favor,\nplease do not go on past your servant.\nLet some water be brought, that you may bathe your feet,\nand then rest yourselves under the tree.\nNow that you have come this close to your servant,\nlet me bring you a little food, that you may refresh yourselves;\nand afterward you may go on your way.\"\nThe men replied, \"Very well, do as you have said.\"\n\nAbraham hastened into the tent and told Sarah,\n\"Quick, three measures of fine flour! Knead it and make rolls.\"\nHe ran to the herd, picked out a tender, choice steer,\nand gave it to a servant, who quickly prepared it.\nThen Abraham got some curds and milk,\nas well as the steer that had been prepared,\nand set these before the three men;\nand he waited on them under the tree while they ate.\n\nThey asked Abraham, \"Where is your wife Sarah?\"\nHe replied, \"There in the tent.\"\nOne of them said, \"I will surely return to you about this time next year,\nand Sarah will then have a son.\"",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/Genesis/18?1",
                                "text": "Genesis 18:1-10a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(1a) He who does justice will live in the presence of the Lord.\nOne who walks blamelessly and does justice;\nwho thinks the truth in his heart\nand slanders not with his tongue.\nR. He who does justice will live in the presence of the Lord.\nWho harms not his fellow man,\nnor takes up a reproach against his neighbor;\nby whom the reprobate is despised,\nwhile he honors those who fear the LORD.\nR. He who does justice will live in the presence of the Lord.\nWho lends not his money at usury\nand accepts no bribe against the innocent.\nOne who does these things\nshall never be disturbed.\nR. He who does justice will live in the presence of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/15?2",
                                "text": "Psalm 15:2-3, 3-4, 5"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nNow I rejoice in my sufferings for your sake,\nand in my flesh I am filling up\nwhat is lacking in the afflictions of Christ\non behalf of his body, which is the church,\nof which I am a minister\nin accordance with God's stewardship given to me\nto bring to completion for you the word of God,\nthe mystery hidden from ages and from generations past.\nBut now it has been manifested to his holy ones,\nto whom God chose to make known the riches of the glory\nof this mystery among the Gentiles;\nit is Christ in you, the hope for glory.\nIt is he whom we proclaim,\nadmonishing everyone and teaching everyone with all wisdom,\nthat we may present everyone perfect in Christ.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?24",
                                "text": "Colossians 1:24-28"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed are they who have kept the word with a generous heart\nand yield a harvest through perseverance.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/8?15",
                                "text": "Cf. Luke 8:15"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus entered a village\nwhere a woman whose name was Martha welcomed him.\nShe had a sister named Mary\nwho sat beside the Lord at his feet listening to him speak.\nMartha, burdened with much serving, came to him and said,\n\"Lord, do you not care\nthat my sister has left me by myself to do the serving?\nTell her to help me.\"\nThe Lord said to her in reply,\n\"Martha, Martha, you are anxious and worried about many things.\nThere is need of only one thing.\nMary has chosen the better part\nand it will not be taken from her.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/10?38",
                                "text": "Luke 10:38-42"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Sixteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/072025.cfm"
    },
    {
        "date": "2025-07-27",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "In those days, the LORD said: \"The outcry against Sodom and Gomorrah is so great,\nand their sin so grave,\nthat I must go down and see whether or not their actions\nfully correspond to the cry against them that comes to me.\nI mean to find out.\"\n\nWhile Abraham's visitors walked on farther toward Sodom,\nthe LORD remained standing before Abraham.\nThen Abraham drew nearer and said:\n\"Will you sweep away the innocent with the guilty?\nSuppose there were fifty innocent people in the city;\nwould you wipe out the place, rather than spare it\nfor the sake of the fifty innocent people within it?\nFar be it from you to do such a thing,\nto make the innocent die with the guilty\nso that the innocent and the guilty would be treated alike!\nShould not the judge of all the world act with justice?\"\nThe LORD replied,\n\"If I find fifty innocent people in the city of Sodom,\nI will spare the whole place for their sake.\"\nAbraham spoke up again:\n\"See how I am presuming to speak to my Lord,\nthough I am but dust and ashes!\nWhat if there are five less than fifty innocent people?\nWill you destroy the whole city because of those five?\"\nHe answered, \"I will not destroy it, if I find forty-five there.\"\nBut Abraham persisted, saying \"What if only forty are found there?\"\nHe replied, \"I will forbear doing it for the sake of the forty.\"\nThen Abraham said, \"Let not my Lord grow impatient if I go on.\nWhat if only thirty are found there?\"\nHe replied, \"I will forbear doing it if I can find but thirty there.\"\nStill Abraham went on,\n\"Since I have thus dared to speak to my Lord,\nwhat if there are no more than twenty?\"\nThe LORD answered, \"I will not destroy it, for the sake of the twenty.\"\nBut he still persisted:\n\"Please, let not my Lord grow angry if I speak up this last time.\nWhat if there are at least ten there?\"\nHe replied, \"For the sake of those ten, I will not destroy it.\"",
                        "verses": [
                            {
                                "book": "Genesis",
                                "link": "https://bible.usccb.org/bible/Genesis/18?20",
                                "text": "Genesis 18:20-32"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(3a) Lord, on the day I called for help, you answered me.\nI will give thanks to you, O LORD, with all my heart,\nfor you have heard the words of my mouth;\nin the presence of the angels I will sing your praise;\nI will worship at your holy temple\nand give thanks to your name.\nR. Lord, on the day I called for help, you answered me.\nBecause of your kindness and your truth;\nfor you have made great above all things\nyour name and your promise.\nWhen I called you answered me;\nyou built up strength within me.\nR. Lord, on the day I called for help, you answered me.\nThe LORD is exalted, yet the lowly he sees,\nand the proud he knows from afar.\nThough I walk amid distress, you preserve me;\nagainst the anger of my enemies you raise your hand.\nR. Lord, on the day I called for help, you answered me.\nYour right hand saves me.\nThe LORD will complete what he has done for me;\nyour kindness, O LORD, endures forever;\nforsake not the work of your hands.\nR. Lord, on the day I called for help, you answered me.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/138?1",
                                "text": "Psalm 138:1-2, 2-3, 6-7, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nYou were buried with him in baptism,\nin which you were also raised with him\nthrough faith in the power of God,\nwho raised him from the dead.\nAnd even when you were dead\nin transgressions and the uncircumcision of your flesh,\nhe brought you to life along with him,\nhaving forgiven us all our transgressions;\n obliterating the bond against us, with its legal claims,\nwhich was opposed to us,\nhe also removed it from our midst, nailing it to the cross.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/2?12",
                                "text": "Colossians 2:12-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nYou have received a Spirit of adoption,\nthrough which we cry, Abba, Father.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/8?15",
                                "text": "Romans 8:15bc"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus was praying in a certain place, and when he had finished,\none of his disciples said to him,\n\"Lord, teach us to pray just as John taught his disciples.\"\nHe said to them, \"When you pray, say:\nFather, hallowed be your name,\nyour kingdom come.\nGive us each day our daily bread\nand forgive us our sins\nfor we ourselves forgive everyone in debt to us,\nand do not subject us to the final test.\"\n\nAnd he said to them, \"Suppose one of you has a friend\nto whom he goes at midnight and says,\n'Friend, lend me three loaves of bread,\nfor a friend of mine has arrived at my house from a journey\nand I have nothing to offer him,'\nand he says in reply from within,\n'Do not bother me; the door has already been locked\nand my children and I are already in bed.\nI cannot get up to give you anything.'\nI tell you,\nif he does not get up to give the visitor the loaves\nbecause of their friendship,\nhe will get up to give him whatever he needs\nbecause of his persistence.\n\n\"And I tell you, ask and you will receive;\nseek and you will find;\nknock and the door will be opened to you.\nFor everyone who asks, receives;\nand the one who seeks, finds;\nand to the one who knocks, the door will be opened.\nWhat father among you would hand his son a snake\nwhen he asks for a fish?\nOr hand him a scorpion when he asks for an egg?\nIf you then, who are wicked,\nknow how to give good gifts to your children,\nhow much more will the Father in heaven\ngive the Holy Spirit to those who ask him?\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/11?1",
                                "text": "Luke 11:1-13"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Seventeenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/072725.cfm"
    },
    {
        "date": "2025-08-03",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Vanity of vanities, says Qoheleth,\nvanity of vanities!  All things are vanity!\n\nHere is one who has labored with wisdom and knowledge and skill,\nand yet to another who has not labored over it,\nhe must leave property.\nThis also is vanity and a great misfortune.\nFor what profit comes to man from all the toil and anxiety of heart\nwith which he has labored under the sun?\nAll his days sorrow and grief are his occupation;\neven at night his mind is not at rest.\nThis also is vanity.",
                        "verses": [
                            {
                                "book": "Ecclesiastes",
                                "link": "https://bible.usccb.org/BIBLE/Ecclesiastes/1?2",
                                "text": "Ecclesiastes 1:2; 2:21-23"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) If today you hear his voice, harden not your hearts.\nYou turn man back to dust,\nsaying, “Return, O children of men.”\nFor a thousand years in your sight\n are as yesterday, now that it is past,\n or as a watch of the night.\nR. If today you hear his voice, harden not your hearts.\nYou make an end of them in their sleep;\n the next morning they are like the changing grass,\nWhich at dawn springs up anew,\nbut by evening wilts and fades.\nR. If today you hear his voice, harden not your hearts.\nTeach us to number our days aright,\n that we may gain wisdom of heart.\nReturn, O LORD! How long?\n Have pity on your servants!\nR. If today you hear his voice, harden not your hearts.\nFill us at daybreak with your kindness,\n that we may shout for joy and gladness all our days.\nAnd may the gracious care of the LORD our God be ours;\n prosper the work of our hands for us!\n Prosper the work of our hands!\nR. If today you hear his voice, harden not your hearts.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/90?3",
                                "text": "Psalm 90:3-4, 5-6, 12-13, 14 and 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nIf you were raised with Christ, seek what is above,\nwhere Christ is seated at the right hand of God.\nThink of what is above, not of what is on earth.\nFor you have died,\nand your life is hidden with Christ in God.\nWhen Christ your life appears,\nthen you too will appear with him in glory.\n\nPut to death, then, the parts of you that are earthly:\nimmorality, impurity, passion, evil desire,\nand the greed that is idolatry.\nStop lying to one another,\nsince you have taken off the old self with its practices\nand have put on the new self,\nwhich is being renewed, for knowledge,\nin the image of its creator.\nHere there is not Greek and Jew,\ncircumcision and uncircumcision,\nbarbarian, Scythian, slave, free;\nbut Christ is all and in all.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/3?1",
                                "text": "Colossians 3:1-5, 9-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed are the poor in spirit,\nfor theirs is the kingdom of heaven.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/5?3",
                                "text": "Matthew 5:3"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Someone in the crowd said to Jesus,\n“Teacher, tell my brother to share the inheritance with me.”\nHe replied to him,\n“Friend, who appointed me as your judge and arbitrator?”\nThen he said to the crowd,\n“Take care to guard against all greed,\nfor though one may be rich,\none’s life does not consist of possessions.”\n\nThen he told them a parable.\n“There was a rich man whose land produced a bountiful harvest.\nHe asked himself, ‘What shall I do,\nfor I do not have space to store my harvest?’\nAnd he said, ‘This is what I shall do:\nI shall tear down my barns and build larger ones.\nThere I shall store all my grain and other goods\nand I shall say to myself, “Now as for you,\nyou have so many good things stored up for many years,\nrest, eat, drink, be merry!”’\nBut God said to him,\n‘You fool, this night your life will be demanded of you;\nand the things you have prepared, to whom will they belong?’\nThus will it be for all who store up treasure for themselves\nbut are not rich in what matters to God.”",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?13",
                                "text": "Luke 12:13-21"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Eighteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/080325.cfm"
    },
    {
        "date": "2025-08-10",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The night of the passover was known beforehand to our fathers,\n that, with sure knowledge of the oaths in which they put their faith,\n they might have courage.\n Your people awaited the salvation of the just\n and the destruction of their foes.\n For when you punished our adversaries,\n in this you glorified us whom you had summoned.\n For in secret the holy children of the good were offering sacrifice\n and putting into effect with one accord the divine institution.",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/Wisdom/18?6",
                                "text": "Wisdom 18:6-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (12b) Blessed the people the Lord has chosen to be his own.\nExult, you just, in the LORD;\n praise from the upright is fitting.\nBlessed the nation whose God is the LORD,\n the people he has chosen for his own inheritance.\nR. Blessed the people the Lord has chosen to be his own.\nSee, the eyes of the LORD are upon those who fear him,\n upon those who hope for his kindness,\nTo deliver them from death\n and preserve them in spite of famine.\nR. Blessed the people the Lord has chosen to be his own.\nOur soul waits for the LORD,\n who is our help and our shield.\nMay your kindness, O LORD, be upon us\n who have put our hope in you.\nR. Blessed the people the Lord has chosen to be his own.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/33?1",
                                "text": "Psalm 33:1, 12, 18-19, 20-22"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nFaith is the realization of what is hoped for\nand evidence of things not seen.\nBecause of it the ancients were well attested.\n\nBy faith Abraham obeyed when he was called to go out to a place\nthat he was to receive as an inheritance;\nhe went out, not knowing where he was to go.\nBy faith he sojourned in the promised land as in a foreign country,\ndwelling in tents with Isaac and Jacob, heirs of the same promise;\nfor he was looking forward to the city with foundations,\nwhose architect and maker is God.\nBy faith he received power to generate,\neven though he was past the normal age\n—and Sarah herself was sterile—\nfor he thought that the one who had made the promise was\ntrustworthy.\nSo it was that there came forth from one man,\nhimself as good as dead,\ndescendants as numerous as the stars in the sky\nand as countless as the sands on the seashore.\n\nAll these died in faith.\nThey did not receive what had been promised\nbut saw it and greeted it from afar\nand acknowledged themselves to be strangers and aliens on earth,\nfor those who speak thus show that they are seeking a homeland.\nIf they had been thinking of the land from which they had come,\nthey would have had opportunity to return.\nBut now they desire a better homeland, a heavenly one.\nTherefore, God is not ashamed to be called their God,\nfor he has prepared a city for them.\n\nBy faith Abraham, when put to the test, offered up Isaac,\nand he who had received the promises was ready to offer his only son,\nof whom it was said,\n“Through Isaac descendants shall bear your name.”\nHe reasoned that God was able to raise even from the dead,\nand he received Isaac back as a symbol.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/11?1",
                                "text": "Hebrews 11:1-2, 8-19"
                            }
                        ]
                    },
                    {
                        "text": "Brothers and sisters:\nFaith is the realization of what is hoped for\nand evidence of things not seen.\nBecause of it the ancients were well attested.\n\nBy faith Abraham obeyed when he was called to go out to a place\nthat he was to receive as an inheritance;\nhe went out, not knowing where he was to go.\nBy faith he sojourned in the promised land as in a foreign country,\ndwelling in tents with Isaac and Jacob, heirs of the same promise;\nfor he was looking forward to the city with foundations,\nwhose architect and maker is God.\nBy faith he received power to generate,\neven though he was past the normal age\n—and Sarah herself was sterile—\nfor he thought that the one who had made the promise was\ntrustworthy.\n So it was that there came forth from one man,\nhimself as good as dead,\ndescendants as numerous as the stars in the sky\nand as countless as the sands on the seashore.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/11?1",
                                "text": "Hebrews 11:1-2, 8-12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nStay awake and be ready!\nFor you do not know on what day your Lord will come.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/24?42",
                                "text": "Matthew 24;42a, 44"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to his disciples:\n“Do not be afraid any longer, little flock,\nfor your Father is pleased to give you the kingdom.\nSell your belongings and give alms.\nProvide money bags for yourselves that do not wear out,\nan inexhaustible treasure in heaven\nthat no thief can reach nor moth destroy.\nFor where your treasure is, there also will your heart be.\n\n“Gird your loins and light your lamps\nand be like servants who await their master’s return from a wedding,\nready to open immediately when he comes and knocks.\nBlessed are those servants\nwhom the master finds vigilant on his arrival.  \nAmen, I say to you, he will gird himself,\nhave them recline at table, and proceed to wait on them.\nAnd should he come in the second or third watch\nand find them prepared in this way,\nblessed are those servants.\nBe sure of this:\nif the master of the house had known the hour\nwhen the thief was coming,\nhe would not have let his house be broken into.\nYou also must be prepared, for at an hour you do not expect,\nthe Son of Man will come.”\n\nThen Peter said,\n“Lord, is this parable meant for us or for everyone?”\nAnd the Lord replied,\n“Who, then, is the faithful and prudent steward\nwhom the master will put in charge of his servants\nto distribute the food allowance at the proper time?\nBlessed is that servant whom his master on arrival finds doing so.\nTruly, I say to you, the master will put the servant\nin charge of all his property.\nBut if that servant says to himself,\n‘My master is delayed in coming,’\nand begins to beat the menservants and the maidservants,\nto eat and drink and get drunk,\nthen that servant’s master will come\non an unexpected day and at an unknown hour\nand will punish the servant severely\nand assign him a place with the unfaithful.\nThat servant who knew his master’s will\nbut did not make preparations nor act in accord with his will\nshall be beaten severely;\nand the servant who was ignorant of his master’s will\nbut acted in a way deserving of a severe beating\nshall be beaten only lightly.\nMuch will be required of the person entrusted with much,\nand still more will be demanded of the person entrusted with more.”",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?32",
                                "text": "Luke 12:32-48"
                            }
                        ]
                    },
                    {
                        "text": "Jesus said to his disciples:\n“Gird your loins and light your lamps\nand be like servants who await their master’s return from a wedding,\nready to open immediately when he comes and knocks.\nBlessed are those servants\nwhom the master finds vigilant on his arrival.\nAmen, I say to you, he will gird himself,\nhave the servants recline at table, and proceed to wait on them.\nAnd should he come in the second or third watch\nand find them prepared in this way,\nblessed are those servants.\nBe sure of this:\nif the master of the house had known the hour\nwhen the thief was coming,\nhe would not have let his house be broken into.\nYou also must be prepared, for at an hour you do not expect,\nthe Son of Man will come.”",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?35",
                                "text": "Luke 12:35-40"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Nineteenth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/081025.cfm"
    },
    {
        "date": "2025-08-17",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "In those days, the princes said to the king:\n\"Jeremiah ought to be put to death;\nhe is demoralizing the soldiers who are left in this city,\nand all the people, by speaking such things to them;\nhe is not interested in the welfare of our people,\nbut in their ruin.\"\nKing Zedekiah answered: \"He is in your power\";\nfor the king could do nothing with them.\nAnd so they took Jeremiah\nand threw him into the cistern of Prince Malchiah,\nwhich was in the quarters of the guard,\nletting him down with ropes.\nThere was no water in the cistern, only mud,\nand Jeremiah sank into the mud.\n\nEbed-melech, a court official,\nwent there from the palace and said to him:\n\"My lord king,\nthese men have been at fault\nin all they have done to the prophet Jeremiah,\ncasting him into the cistern.\nHe will die of famine on the spot,\nfor there is no more food in the city.\"\nThen the king ordered Ebed-melech the Cushite\nto take three men along with him,\nand draw the prophet Jeremiah out of the cistern before\nhe should die.",
                        "verses": [
                            {
                                "book": "Jeremiah",
                                "link": "https://bible.usccb.org/bible/Jeremiah/38?4",
                                "text": "Jeremiah 38:4-6, 8-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (14b)  Lord, come to my aid!\nI have waited, waited for the LORD,\nand he stooped toward me.\nR. Lord, come to my aid!\nThe LORD heard my cry.\nHe drew me out of the pit of destruction,\n out of the mud of the swamp;\nhe set my feet upon a crag;\n he made firm my steps.\nR. Lord, come to my aid!\nAnd he put a new song into my mouth,\n a hymn to our God.\nMany shall look on in awe\n and trust in the LORD.\nR. Lord, come to my aid!\nThough I am afflicted and poor,\n yet the LORD thinks of me.\nYou are my help and my deliverer;\n O my God, hold not back!\nR. Lord, come to my aid!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/40?2",
                                "text": "Psalm 40:2, 3, 4, 18"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nSince we are surrounded by so great a cloud of witnesses,\nlet us rid ourselves of every burden and sin that clings to us\nand persevere in running the race that lies before us\nwhile keeping our eyes fixed on Jesus,\nthe leader and perfecter of faith.\nFor the sake of the joy that lay before him\nhe endured the cross, despising its shame,\nand has taken his seat at the right of the throne of God.\nConsider how he endured such opposition from sinners,\nin order that you may not grow weary and lose heart.\nIn your struggle against sin\nyou have not yet resisted to the point of shedding blood.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?1",
                                "text": "Hebrews 12:1-4"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nMy sheep hear my voice, says the Lord;\nI know them, and they follow me.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/10?27",
                                "text": "John 10:27"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to his disciples:\n\"I have come to set the earth on fire,\nand how I wish it were already blazing!\nThere is a baptism with which I must be baptized,\nand how great is my anguish until it is accomplished!\nDo you think that I have come to establish peace on the earth?\nNo, I tell you, but rather division.\nFrom now on a household of five will be divided,\nthree against two and two against three;\na father will be divided against his son\nand a son against his father,\na mother against her daughter\nand a daughter against her mother,\na mother-in-law against her daughter-in-law\nand a daughter-in-law against her mother-in-law.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/12?49",
                                "text": "Luke 12:49-53"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twentieth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/081725.cfm"
    },
    {
        "date": "2025-08-24",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Thus says the LORD:\nI know their works and their thoughts,\nand I come to gather nations of every language;\nthey shall come and see my glory.\nI will set a sign among them;\nfrom them I will send fugitives to the nations:\nto Tarshish, Put and Lud, Mosoch, Tubal and Javan,\nto the distant coastlands\nthat have never heard of my fame, or seen my glory;\nand they shall proclaim my glory among the nations.\nThey shall bring all your brothers and sisters from all the nations\nas an offering to the LORD,\non horses and in chariots, in carts, upon mules and dromedaries,\nto Jerusalem, my holy mountain, says the LORD,\njust as the Israelites bring their offering\nto the house of the LORD in clean vessels.\nSome of these I will take as priests and Levites, says the LORD.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/66?18",
                                "text": "Isaiah 66:18-21"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(Mk 16:15) Go out to all the world and tell the Good News.\nor:\nR. Alleluia.\nPraise the LORD, all you nations;\nglorify him, all you peoples!\nR. Go out to all the world and tell the Good News.\nor:\nR. Alleluia.\nFor steadfast is his kindness toward us,\nand the fidelity of the LORD endures forever.\nR. Go out to all the world and tell the Good News.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/117?1",
                                "text": "Psalm 117:1, 2"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters,\nYou have forgotten the exhortation addressed to you as children:\n\"My son, do not disdain the discipline of the Lord\nor lose heart when reproved by him;\nfor whom the Lord loves, he disciplines;\nhe scourges every son he acknowledges.\"\nEndure your trials as \"discipline\";\nGod treats you as sons.\nFor what \"son\" is there whom his father does not discipline?\nAt the time,\nall discipline seems a cause not for joy but for pain,\nyet later it brings the peaceful fruit of righteousness\nto those who are trained by it.\n\nSo strengthen your drooping hands and your weak knees.\nMake straight paths for your feet,\nthat what is lame may not be disjointed but healed.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?5",
                                "text": "Hebrews 12:5-7, 11-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI am the way, the truth and the life, says the Lord;\nno one comes to the Father, except through me.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/14?6",
                                "text": "John 14:6"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus passed through towns and villages,\nteaching as he went and making his way to Jerusalem.\nSomeone asked him,\n\"Lord, will only a few people be saved?\"\nHe answered them,\n\"Strive to enter through the narrow gate,\nfor many, I tell you, will attempt to enter\nbut will not be strong enough.\nAfter the master of the house has arisen and locked the door,\nthen will you stand outside knocking and saying,\n'Lord, open the door for us.'\nHe will say to you in reply,\n'I do not know where you are from.\nAnd you will say,\n'We ate and drank in your company and you taught in our streets.'\nThen he will say to you,\n'I do not know where you are from.\nDepart from me, all you evildoers!'\nAnd there will be wailing and grinding of teeth\nwhen you see Abraham, Isaac, and Jacob\nand all the prophets in the kingdom of God\nand you yourselves cast out.\nAnd people will come from the east and the west\nand from the north and the south\nand will recline at table in the kingdom of God.\nFor behold, some are last who will be first,\nand some are first who will be last.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/13?22",
                                "text": "Luke 13:22-30"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-first Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/082425.cfm"
    },
    {
        "date": "2025-08-31",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "My child, conduct your affairs with humility,\n and you will be loved more than a giver of gifts.\n Humble yourself the more, the greater you are,\n and you will find favor with God.\n What is too sublime for you, seek not,\n into things beyond your strength search not.\n The mind of a sage appreciates proverbs,\n and an attentive ear is the joy of the wise.\n Water quenches a flaming fire,\n and alms atone for sins.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/Sirach/3?17",
                                "text": "Sirach 3:17-18, 20, 28-29"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 11b)  God, in your goodness, you have made a home for the poor.\nThe just rejoice and exult before God;\nthey are glad and rejoice.\nSing to God, chant praise to his name;\nwhose name is the LORD.\nR. God, in your goodness, you have made a home for the poor.\nThe father of orphans and the defender of widows\nis God in his holy dwelling.\nGod gives a home to the forsaken;\nhe leads forth prisoners to prosperity.\nR. God, in your goodness, you have made a home for the poor.\nA bountiful rain you showered down, O God, upon your inheritance;\nyou restored the land when it languished;\nyour flock settled in it;\nin your goodness, O God, you provided it for the needy.\nR. God, in your goodness, you have made a home for the poor.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/68?4",
                                "text": "Psalm 68:4-5, 6-7, 10-11"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nYou have not approached that which could be touched\nand a blazing fire and gloomy darkness\nand storm and a trumpet blast\nand a voice speaking words such that those who heard\nbegged that no message be further addressed to them.\nNo, you have approached Mount Zion\nand the city of the living God, the heavenly Jerusalem,\nand countless angels in festal gathering,\nand the assembly of the firstborn enrolled in heaven,\nand God the judge of all,\nand the spirits of the just made perfect,\nand Jesus, the mediator of a new covenant,\nand the sprinkled blood that speaks more eloquently than that of Abel.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/12?18",
                                "text": "Hebrews 12:18-19, 22-24a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nTake my yoke upon you, says the Lord,\nand learn from me, for I am meek and humble of heart.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/11?29",
                                "text": "Matthew 11:29ab"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "On a sabbath Jesus went to dine\nat the home of one of the leading Pharisees,\nand the people there were observing him carefully.\n\nHe told a parable to those who had been invited,\nnoticing how they were choosing the places of honor at the table.\n\"When you are invited by someone to a wedding banquet,\ndo not recline at table in the place of honor.\nA more distinguished guest than you may have been invited by him,\nand the host who invited both of you may approach you and say,\n'Give your place to this man,'\nand then you would proceed with embarrassment\nto take the lowest place.\nRather, when you are invited,\ngo and take the lowest place\nso that when the host comes to you he may say,\n'My friend, move up to a higher position.'\nThen you will enjoy the esteem of your companions at the table.\nFor every one who exalts himself will be humbled,\nbut the one who humbles himself will be exalted.\"\nThen he said to the host who invited him,\n\"When you hold a lunch or a dinner,\ndo not invite your friends or your brothers\nor your relatives or your wealthy neighbors,\nin case they may invite you back and you have repayment.\nRather, when you hold a banquet,\ninvite the poor, the crippled, the lame, the blind;\nblessed indeed will you be because of their inability to repay you.\nFor you will be repaid at the resurrection of the righteous.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/14?1",
                                "text": "Luke 14:1, 7-14"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-second Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/083125.cfm"
    },
    {
        "date": "2025-09-07",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Who can know God’s counsel,\n or who can conceive what the LORD intends?\n For the deliberations of mortals are timid,\n and unsure are our plans.\n For the corruptible body burdens the soul\n and the earthen shelter weighs down the mind that has many concerns.\n And scarce do we guess the things on earth,\n and what is within our grasp we find with difficulty;\n but when things are in heaven, who can search them out?\n Or who ever knew your counsel, except you had given wisdom\n and sent your holy spirit from on high?\n And thus were the paths of those on earth made straight.",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/Wisdom/9?13",
                                "text": "Wisdom 9:13-18b"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1) In every age, O Lord, you have been our refuge.\nYou turn man back to dust,\nsaying, “Return, O children of men.”\nFor a thousand years in your sight\n are as yesterday, now that it is past,\nor as a watch of the night.\nR. In every age, O Lord, you have been our refuge.\nYou make an end of them in their sleep;\n the next morning they are like the changing grass,\nWhich at dawn springs up anew,\n but by evening wilts and fades.\nR. In every age, O Lord, you have been our refuge.\nTeach us to number our days aright,\n that we may gain wisdom of heart.\nReturn, O LORD! How long?\nHave pity on your servants!\nR. In every age, O Lord, you have been our refuge.\nFill us at daybreak with your kindness,\n that we may shout for joy and gladness all our days.\nAnd may the gracious care of the LORD our God be ours;\n prosper the work of our hands for us!\nProsper the work of our hands!\nR. In every age, O Lord, you have been our refuge.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/90?3",
                                "text": "Psalm 90:3-4, 5-6, 12-13, 14 and 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "I, Paul, an old man,\nand now also a prisoner for Christ Jesus,\nurge you on behalf of my child Onesimus,\nwhose father I have become in my imprisonment;\nI am sending him, that is, my own heart, back to you.\nI should have liked to retain him for myself,\nso that he might serve me on your behalf\nin my imprisonment for the gospel,\nbut I did not want to do anything without your consent,\nso that the good you do might not be forced but voluntary.\nPerhaps this is why he was away from you for a while,\nthat you might have him back forever,\nno longer as a slave\nbut more than a slave, a brother,\nbeloved especially to me, but even more so to you,\nas a man and in the Lord.\nSo if you regard me as a partner, welcome him as you would me.",
                        "verses": [
                            {
                                "book": "Philemon",
                                "link": "https://bible.usccb.org/bible/philemon/1?9",
                                "text": "Philemon 9-10, 12-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet your face shine upon your servant;\nand teach me your laws.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/119?135",
                                "text": "Psalm 119:135"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Great crowds were traveling with Jesus,\nand he turned and addressed them,\n“If anyone comes to me without hating his father and mother,\nwife and children, brothers and sisters,\nand even his own life,\nhe cannot be my disciple.\nWhoever does not carry his own cross and come after me\ncannot be my disciple.\nWhich of you wishing to construct a tower\ndoes not first sit down and calculate the cost\nto see if there is enough for its completion?\nOtherwise, after laying the foundation\nand finding himself unable to finish the work\nthe onlookers should laugh at him and say,\n‘This one began to build but did not have the resources to finish.’\nOr what king marching into battle would not first sit down\nand decide whether with ten thousand troops\nhe can successfully oppose another king\nadvancing upon him with twenty thousand troops?\nBut if not, while he is still far away,\nhe will send a delegation to ask for peace terms.\nIn the same way,\nanyone of you who does not renounce all his possessions\ncannot be my disciple.”",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/14?25",
                                "text": "Luke 14:25-33"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-third Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/090725.cfm"
    },
    {
        "date": "2025-09-14",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "With their patience worn out by the journey,\nthe people complained against God and Moses,\n\"Why have you brought us up from Egypt to die in this desert,\nwhere there is no food or water?\nWe are disgusted with this wretched food!\"\n\nIn punishment the LORD sent among the people saraph serpents,\nwhich bit the people so that many of them died.\nThen the people came to Moses and said,\n\"We have sinned in complaining against the LORD and you.\nPray the LORD to take the serpents from us.\"\nSo Moses prayed for the people, and the LORD said to Moses,\n\"Make a saraph and mount it on a pole,\nand if any who have been bitten look at it, they will live.\"\nMoses accordingly made a bronze serpent and mounted it on a pole,\nand whenever anyone who had been bitten by a serpent\nlooked at the bronze serpent, he lived.",
                        "verses": [
                            {
                                "book": "Numbers",
                                "link": "https://bible.usccb.org/bible/numbers/21?4",
                                "text": "Numbers 21:4b-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (see 7b) Do not forget the works of the Lord!\nHearken, my people, to my teaching;\nincline your ears to the words of my mouth.\nI will open my mouth in a parable,\nI will utter mysteries from of old.\nR. Do not forget the works of the Lord!\nWhile he slew them they sought him\nand inquired after God again,\nRemembering that God was their rock\nand the Most High God, their redeemer.\nR. Do not forget the works of the Lord!\nBut they flattered him with their mouths\nand lied to him with their tongues,\nThough their hearts were not steadfast toward him,\nnor were they faithful to his covenant.\nR. Do not forget the works of the Lord!\nBut he, being merciful, forgave their sin\nand destroyed them not;\nOften he turned back his anger\nand let none of his wrath be roused.\nR. Do not forget the works of the Lord!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/78?1",
                                "text": "Psalm 78:1bc-2, 34-35, 36-37, 38"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nChrist Jesus, though he was in the form of God,\ndid not regard equality with God something to be grasped.\nRather, he emptied himself,\ntaking the form of a slave,\ncoming in human likeness;\nand found human in appearance,\nhe humbled himself,\nbecoming obedient to death,\neven death on a cross.\nBecause of this, God greatly exalted him\nand bestowed on him the name\nthat is above every name,\nthat at the name of Jesus\nevery knee should bend,\nof those in heaven and on earth and under the earth,\nand every tongue confess that\nJesus Christ is Lord,\nto the glory of God the Father.",
                        "verses": [
                            {
                                "book": "Philippians",
                                "link": "https://bible.usccb.org/bible/philippians/2?6",
                                "text": "Philippians 2:6-11"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nWe adore you, O Christ, and we bless you,\nbecause by your Cross you have redeemed the world.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": null,
                                "link": "https://bible.usccb.orgroute?<nolink>",
                                "text": ""
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to Nicodemus:\n\"No one has gone up to heaven\nexcept the one who has come down from heaven, the Son of Man.\nAnd just as Moses lifted up the serpent in the desert,\nso must the Son of Man be lifted up,\nso that everyone who believes in him may have eternal life.\"\n\nFor God so loved the world that he gave his only Son,\nso that everyone who believes in him might not perish\nbut might have eternal life.\nFor God did not send his Son into the world to condemn the world,\nbut that the world might be saved through him.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/3?13",
                                "text": "John 3:13-17"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Exaltation of the Holy Cross",
        "url": "https://bible.usccb.org/bible/readings/091425.cfm"
    },
    {
        "date": "2025-09-21",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Hear this, you who trample upon the needy\n and destroy the poor of the land!\n \"When will the new moon be over,\" you ask,\n \"that we may sell our grain,\n and the sabbath, that we may display the wheat?\n We will diminish the ephah,\n add to the shekel,\n and fix our scales for cheating!\n We will buy the lowly for silver,\n and the poor for a pair of sandals;\n even the refuse of the wheat we will sell!\"\n The LORD has sworn by the pride of Jacob:\n Never will I forget a thing they have done!",
                        "verses": [
                            {
                                "book": "Amos",
                                "link": "https://bible.usccb.org/bible/Amos/8?4",
                                "text": "Amos 8:4-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1a, 7b) Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nPraise, you servants of the LORD,\n praise the name of the LORD.\nBlessed be the name of the LORD\n both now and forever.\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nHigh above all nations is the LORD;\n above the heavens is his glory.\nWho is like the LORD, our God, who is enthroned on high\n and looks upon the heavens and the earth below?\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.\nHe raises up the lowly from the dust;\n from the dunghill he lifts up the poor\nto seat them with princes,\n with the princes of his own people.\nR. Praise the Lord who lifts up the poor.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/113?1",
                                "text": "Psalm 113:1-2, 4-6, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Beloved:\nFirst of all, I ask that supplications, prayers,\npetitions, and thanksgivings be offered for everyone,\nfor kings and for all in authority,\nthat we may lead a quiet and tranquil life\nin all devotion and dignity.\nThis is good and pleasing to God our savior,\nwho wills everyone to be saved\nand to come to knowledge of the truth.\nFor there is one God.\nThere is also one mediator between God and men,\n     the man Christ Jesus,\nwho gave himself as ransom for all.\nThis was the testimony at the proper time.\nFor this I was appointed preacher and apostle\n— I am speaking the truth, I am not lying —,\nteacher of the Gentiles in faith and truth.\n\nIt is my wish, then, that in every place the men should pray,\nlifting up holy hands, without anger or argument.",
                        "verses": [
                            {
                                "book": "1 Timothy",
                                "link": "https://bible.usccb.org/bible/1timothy/2?1",
                                "text": "1 Timothy 2:1-8"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/8?9",
                                "text": "Cf. 2 Corinthians 8:9"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to his disciples,\n\"A rich man had a steward\nwho was reported to him for squandering his property.\nHe summoned him and said,\n'What is this I hear about you?\nPrepare a full account of your stewardship,\nbecause you can no longer be my steward.'\nThe steward said to himself, 'What shall I do,\nnow that my master is taking the position of steward away from me?\nI am not strong enough to dig and I am ashamed to beg.\nI know what I shall do so that,\nwhen I am removed from the stewardship,\nthey may welcome me into their homes.'\nHe called in his master's debtors one by one.\nTo the first he said,\n'How much do you owe my master?'\nHe replied, 'One hundred measures of olive oil.'\nHe said to him, 'Here is your promissory note.\nSit down and quickly write one for fifty.'\nThen to another the steward said, 'And you, how much do you owe?'\nHe replied, 'One hundred kors of wheat.'\nThe steward said to him, 'Here is your promissory note;\nwrite one for eighty.'\nAnd the master commended that dishonest steward for acting prudently.\n\"For the children of this world\nare more prudent in dealing with their own generation\nthan are the children of light.\nI tell you, make friends for yourselves with dishonest wealth,\nso that when it fails, you will be welcomed into eternal dwellings.\nThe person who is trustworthy in very small matters\nis also trustworthy in great ones;\nand the person who is dishonest in very small matters\nis also dishonest in great ones.\nIf, therefore, you are not trustworthy with dishonest wealth,\nwho will trust you with true wealth?\nIf you are not trustworthy with what belongs to another,\nwho will give you what is yours?\nNo servant can serve two masters.\nHe will either hate one and love the other,\nor be devoted to one and despise the other.\nYou cannot serve both God and mammon.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?1",
                                "text": "Luke 16:1-13"
                            }
                        ]
                    },
                    {
                        "text": "Jesus said to his disciples:\n\"The person who is trustworthy in very small matters\nis also trustworthy in great ones;\nand the person who is dishonest in very small matters\nis also dishonest in great ones.\nIf, therefore, you are not trustworthy with dishonest wealth,\nwho will trust you with true wealth?\nIf you are not trustworthy with what belongs to another,\nwho will give you what is yours?\nNo servant can serve two masters.\nHe will either hate one and love the other,\nor be devoted to one and despise the other.\nYou cannot serve both God and mammon.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?10",
                                "text": "Luke 16:10-13"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-fifth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/092125.cfm"
    },
    {
        "date": "2025-09-28",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Thus says the LORD the God of hosts:\n Woe to the complacent in Zion!\n Lying upon beds of ivory,\n stretched comfortably on their couches,\n they eat lambs taken from the flock,\n and calves from the stall!\n Improvising to the music of the harp,\n like David, they devise their own accompaniment.\n They drink wine from bowls\n and anoint themselves with the best oils;\n yet they are not made ill by the collapse of Joseph!\n Therefore, now they shall be the first to go into exile,\n and their wanton revelry shall be done away with.",
                        "verses": [
                            {
                                "book": "Amos",
                                "link": "https://bible.usccb.org/bible/Amos/6?1",
                                "text": "Amos 6:1a, 4-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (1b) Praise the Lord, my soul!\nor:\nR. Alleluia.\nBlessed is he who keeps faith forever,\n secures justice for the oppressed,\n gives food to the hungry.\nThe LORD sets captives free.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.\nThe LORD gives sight to the blind;\n the LORD raises up those who were bowed down.\nThe LORD loves the just;\n the LORD protects strangers.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.\nThe fatherless and the widow he sustains,\n but the way of the wicked he thwarts.\nThe LORD shall reign forever;\n your God, O Zion, through all generations. Alleluia.\nR. Praise the Lord, my soul!\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/146?7",
                                "text": "Psalm 146:7, 8-9, 9-10"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "But you, man of God, pursue righteousness,\ndevotion, faith, love, patience, and gentleness.\nCompete well for the faith.\nLay hold of eternal life, to which you were called\nwhen you made the noble confession in the presence of many witnesses.\nI charge you before God, who gives life to all things,\nand before Christ Jesus,\nwho gave testimony under Pontius Pilate for the noble confession,\nto keep the commandment without stain or reproach\nuntil the appearance of our Lord Jesus Christ\nthat the blessed and only ruler\nwill make manifest at the proper time,\nthe King of kings and Lord of lords,\nwho alone has immortality, who dwells in unapproachable light,\nand whom no human being has seen or can see.\nTo him be honor and eternal power.  Amen.",
                        "verses": [
                            {
                                "book": "1 Timothy",
                                "link": "https://bible.usccb.org/bible/1timothy/6?11",
                                "text": "1 Timothy 6:11-16"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThough our Lord Jesus Christ was rich, he became poor,\nso that by his poverty you might become rich.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/8?9",
                                "text": "Cf. 2 Corinthians 8:9"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to the Pharisees:\n\"There was a rich man who dressed in purple garments and fine linen\nand dined sumptuously each day.\nAnd lying at his door was a poor man named Lazarus, covered with sores,\nwho would gladly have eaten his fill of the scraps\nthat fell from the rich man's table.\nDogs even used to come and lick his sores.\nWhen the poor man died,\nhe was carried away by angels to the bosom of Abraham.\nThe rich man also died and was buried,\nand from the netherworld, where he was in torment,\nhe raised his eyes and saw Abraham far off\nand Lazarus at his side.\nAnd he cried out, 'Father Abraham, have pity on me.\nSend Lazarus to dip the tip of his finger in water and cool my tongue,\nfor I am suffering torment in these flames.'\nAbraham replied,\n'My child, remember that you received\nwhat was good during your lifetime\nwhile Lazarus likewise received what was bad;\nbut now he is comforted here, whereas you are tormented.\nMoreover, between us and you a great chasm is established\nto prevent anyone from crossing who might wish to go\nfrom our side to yours or from your side to ours.'\nHe said, 'Then I beg you, father,\nsend him to my father's house, for I have five brothers,\nso that he may warn them,\nlest they too come to this place of torment.'\nBut Abraham replied, 'They have Moses and the prophets.\nLet them listen to them.'\nHe said, 'Oh no, father Abraham,\nbut if someone from the dead goes to them, they will repent.'\nThen Abraham said, 'If they will not listen to Moses and the prophets,\nneither will they be persuaded if someone should rise from the dead.'\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/16?19",
                                "text": "Luke 16:19-31"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-sixth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/092825.cfm"
    },
    {
        "date": "2025-10-05",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "How long, O LORD?  I cry for help\n but you do not listen!\n I cry out to you, \"Violence!\"\n but you do not intervene.\n Why do you let me see ruin;\n why must I look at misery?\n Destruction and violence are before me;\n there is strife, and clamorous discord.\n Then the LORD answered me and said:\n Write down the vision clearly upon the tablets,\n so that one can read it readily.\n For the vision still has its time,\n presses on to fulfillment, and will not disappoint;\n if it delays, wait for it,\n it will surely come, it will not be late.\n The rash one has no integrity;\n but the just one, because of his faith, shall live.",
                        "verses": [
                            {
                                "book": "Habakkuk",
                                "link": "https://bible.usccb.org/bible/Habakkuk/1?2",
                                "text": "Habakkuk 1:2-3; 2:2-4"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (8) If today you hear his voice, harden not your hearts.\nCome, let us sing joyfully to the LORD;\n let us acclaim the Rock of our salvation.\nLet us come into his presence with thanksgiving;\n let us joyfully sing psalms to him.\nR. If today you hear his voice, harden not your hearts.\nCome, let us bow down in worship;\n let us kneel before the LORD who made us.\nFor he is our God,\n and we are the people he shepherds, the flock he guides.\nR. If today you hear his voice, harden not your hearts.\nOh, that today you would hear his voice:\n \"Harden not your hearts as at Meribah,\n as in the day of Massah in the desert,\nWhere your fathers tempted me;\n they tested me though they had seen my works.\"\nR. If today you hear his voice, harden not your hearts.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/95?1",
                                "text": "Psalm 95:1-2, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Beloved:\nI remind you, to stir into flame\nthe gift of God that you have through the imposition of my hands.\nFor God did not give us a spirit of cowardice\nbut rather of power and love and self-control.\nSo do not be ashamed of your testimony to our Lord,\nnor of me, a prisoner for his sake;\nbut bear your share of hardship for the gospel\nwith the strength that comes from God.\n\nTake as your norm the sound words that you heard from me,\nin the faith and love that are in Christ Jesus.\nGuard this rich trust with the help of the Holy Spirit\nthat dwells within us.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/1?6",
                                "text": "2 Timothy 1:6-8, 13-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe word of the Lord remains forever.\nThis is the word that has been proclaimed to you.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Peter",
                                "link": "https://bible.usccb.org/bible/1Peter/1?25",
                                "text": "1 Peter 1:25"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "The apostles said to the Lord, \"Increase our faith.\"\nThe Lord replied,\n\"If you have faith the size of a mustard seed,\nyou would say to this mulberry tree,\n'Be uprooted and planted in the sea,' and it would obey you.\n\n\"Who among you would say to your servant\nwho has just come in from plowing or tending sheep in the field,\n'Come here immediately and take your place at table'?\nWould he not rather say to him,\n'Prepare something for me to eat.\nPut on your apron and wait on me while I eat and drink.\nYou may eat and drink when I am finished'?\nIs he grateful to that servant because he did what was commanded?\nSo should it be with you.\nWhen you have done all you have been commanded,\nsay, 'We are unprofitable servants;\nwe have done what we were obliged to do.'\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/17?5",
                                "text": "Luke 17:5-10"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-seventh Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/100525.cfm"
    },
    {
        "date": "2025-10-12",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "Naaman went down and plunged into the Jordan seven times\nat the word of Elisha, the man of God.\nHis flesh became again like the flesh of a little child,\nand he was clean of his leprosy.\n\nNaaman returned with his whole retinue to the man of God.\nOn his arrival he stood before Elisha and said,\n\"Now I know that there is no God in all the earth,\nexcept in Israel.\nPlease accept a gift from your servant.\"\n\nElisha replied, \"As the LORD lives whom I serve, I will not take it;\"\nand despite Naaman's urging, he still refused.\nNaaman said: \"If you will not accept,\nplease let me, your servant, have two mule-loads of earth,\nfor I will no longer offer holocaust or sacrifice\nto any other god except to the LORD.\"",
                        "verses": [
                            {
                                "book": "2 Kings",
                                "link": "https://bible.usccb.org/bible/2kings/5?14",
                                "text": "2 Kings 5:14-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 2b) The Lord has revealed to the nations his saving power.\nSing to the LORD a new song,\nfor he has done wondrous deeds;\nhis right hand has won victory for him,\nhis holy arm.\nR. The Lord has revealed to the nations his saving power.\nThe LORD has made his salvation known:\nin the sight of the nations he has revealed his justice.\nHe has remembered his kindness and his faithfulness\ntoward the house of Israel.\nR. The Lord has revealed to the nations his saving power.\nAll the ends of the earth have seen\nthe salvation by our God.\nSing joyfully to the LORD, all you lands:\nbreak into song; sing praise.\nR. The Lord has revealed to the nations his saving power.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/98?1",
                                "text": "Psalm 98:1, 2-3, 3-4"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Beloved:\nRemember Jesus Christ, raised from the dead, a descendant of David:\nsuch is my gospel, for which I am suffering,\neven to the point of chains, like a criminal.\nBut the word of God is not chained.\nTherefore, I bear with everything for the sake of those who are chosen,\nso that they too may obtain the salvation that is in Christ Jesus,\ntogether with eternal glory.\nThis saying is trustworthy:\nIf we have died with him\nwe shall also live with him;\nif we persevere\nwe shall also reign with him.\nBut if we deny him\nhe will deny us.\nIf we are unfaithful\nhe remains faithful,\nfor he cannot deny himself.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/2?8",
                                "text": "2 Timothy 2:8-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nIn all circumstances, give thanks,\nfor this is the will of God for you in Christ Jesus.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Thessalonians",
                                "link": "https://bible.usccb.org/bible/1thessalonians/5?18",
                                "text": "1 Thessalonians 5:18"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "As Jesus continued his journey to Jerusalem,\nhe traveled through Samaria and Galilee.\nAs he was entering a village, ten lepers met him.\nThey stood at a distance from him and raised their voices, saying,\n\"Jesus, Master! Have pity on us!\"\nAnd when he saw them, he said,\n\"Go show yourselves to the priests.\"\nAs they were going they were cleansed.\nAnd one of them, realizing he had been healed,\nreturned, glorifying God in a loud voice;\nand he fell at the feet of Jesus and thanked him.\nHe was a Samaritan.\nJesus said in reply,\n\"Ten were cleansed, were they not?\nWhere are the other nine?\nHas none but this foreigner returned to give thanks to God?\"\nThen he said to him, \"Stand up and go;\nyour faith has saved you.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/17?11",
                                "text": "Luke 17:11-19"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-eighth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/101225.cfm"
    },
    {
        "date": "2025-10-19",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "In those days, Amalek came and waged war against Israel.\nMoses, therefore, said to Joshua,\n\"Pick out certain men,\nand tomorrow go out and engage Amalek in battle.\nI will be standing on top of the hill\nwith the staff of God in my hand.\"\nSo Joshua did as Moses told him:\nhe engaged Amalek in battle\nafter Moses had climbed to the top of the hill with Aaron and Hur.\nAs long as Moses kept his hands raised up,\nIsrael had the better of the fight,\nbut when he let his hands rest,\nAmalek had the better of the fight.\nMoses'hands, however, grew tired;\nso they put a rock in place for him to sit on.\nMeanwhile Aaron and Hur supported his hands,\none on one side and one on the other,\nso that his hands remained steady till sunset.\nAnd Joshua mowed down Amalek and his people\nwith the edge of the sword.",
                        "verses": [
                            {
                                "book": "Exodus",
                                "link": "https://bible.usccb.org/bible/Exodus/17?8",
                                "text": "Exodus 17:8-13"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.(cf. 2)  Our help is from the Lord, who made heaven and earth.\nI lift up my eyes toward the mountains;\nwhence shall help come to me?\nMy help is from the LORD,\nwho made heaven and earth.\nR. Our help is from the Lord, who made heaven and earth.\nMay he not suffer your foot to slip;\nmay he slumber not who guards you:\nindeed he neither slumbers nor sleeps,\nthe guardian of Israel.\nR. Our help is from the Lord, who made heaven and earth.\nThe LORD is your guardian; the LORD is your shade;\nhe is beside you at your right hand.\nThe sun shall not harm you by day,\nnor the moon by night.\nR. Our help is from the Lord, who made heaven and earth.\nThe LORD will guard you from all evil;\nhe will guard your life.\nThe LORD will guard your coming and your going,\nboth now and forever.\nR. Our help is from the Lord, who made heaven and earth.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/121?1",
                                "text": "Psalm 121:1-2, 3-4, 5-6, 7-8"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Beloved:\nRemain faithful to what you have learned and believed,\nbecause you know from whom you learned it,\nand that from infancy you have known the sacred Scriptures,\nwhich are capable of giving you wisdom for salvation\nthrough faith in Christ Jesus.\nAll Scripture is inspired by God\nand is useful for teaching, for refutation, for correction,\nand for training in righteousness,\nso that one who belongs to God may be competent,\nequipped for every good work.\n\nI charge you in the presence of God and of Christ Jesus,\nwho will judge the living and the dead,\nand by his appearing and his kingly power:\nproclaim the word;\nbe persistent whether it is convenient or inconvenient;\nconvince, reprimand, encourage through all patience and teaching.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/3?14",
                                "text": "2 Timothy 3:14-4:2"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe word of God is living and effective,\ndiscerning reflections and thoughts of the heart.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Hebrews",
                                "link": "https://bible.usccb.org/bible/hebrews/1",
                                "text": "Hebrews 4:12"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus told his disciples a parable\nabout the necessity for them to pray always without becoming weary.\nHe said, \"There was a judge in a certain town\nwho neither feared God nor respected any human being.\nAnd a widow in that town used to come to him and say,\n'Render a just decision for me against my adversary.'\nFor a long time the judge was unwilling, but eventually he thought,\n'While it is true that I neither fear God nor respect any human being,\nbecause this widow keeps bothering me\nI shall deliver a just decision for her\nlest she finally come and strike me.'\"\nThe Lord said, \"Pay attention to what the dishonest judge says.\nWill not God then secure the rights of his chosen ones\nwho call out to him day and night?\nWill he be slow to answer them?\nI tell you, he will see to it that justice is done for them speedily.\nBut when the Son of Man comes, will he find faith on earth?\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/18?1",
                                "text": "Luke 18:1-8"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Twenty-ninth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/101925.cfm"
    },
    {
        "date": "2025-10-26",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The LORD is a God of justice,\n who knows no favorites.\n Though not unduly partial toward the weak,\n yet he hears the cry of the oppressed.\n The Lord is not deaf to the wail of the orphan,\n nor to the widow when she pours out her complaint.\n The one who serves God willingly is heard;\n his petition reaches the heavens.\n The prayer of the lowly pierces the clouds;\n it does not rest till it reaches its goal,\n nor will it withdraw till the Most High responds,\n judges justly and affirms the right,\n and the Lord will not delay.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/Sirach/35?12",
                                "text": "Sirach 35:12-14, 16-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (7a)  The Lord hears the cry of the poor.\nI will bless the LORD at all times;\nhis praise shall be ever in my mouth.\nLet my soul glory in the LORD;\nthe lowly will hear me and be glad.\nR. The Lord hears the cry of the poor.\nThe LORD confronts the evildoers,\nto destroy remembrance of them from the earth.\nWhen the just cry out, the LORD hears them,\nand from all their distress he rescues them.\nR. The Lord hears the cry of the poor.\nThe LORD is close to the brokenhearted;\nand those who are crushed in spirit he saves.\nThe LORD redeems the lives of his servants;\nno one incurs guilt who takes refuge in him.\nR. The Lord hears the cry of the poor.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/34?2",
                                "text": "Psalm 34:2-3, 17-18, 19, 23"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Beloved:\nI am already being poured out like a libation,\nand the time of my departure is at hand.\nI have competed well; I have finished the race;\nI have kept the faith.\nFrom now on the crown of righteousness awaits me,\nwhich the Lord, the just judge,\nwill award to me on that day, and not only to me,\nbut to all who have longed for his appearance.\nAt my first defense no one appeared on my behalf,\nbut everyone deserted me.\nMay it not be held against them!\nBut the Lord stood by me and gave me strength,\nso that through me the proclamation might be completed\nand all the Gentiles might hear it.\nAnd I was rescued from the lion's mouth.\nThe Lord will rescue me from every evil threat\nand will bring me safe to his heavenly kingdom.\nTo him be glory forever and ever. Amen.",
                        "verses": [
                            {
                                "book": "2 Timothy",
                                "link": "https://bible.usccb.org/bible/2timothy/4?6",
                                "text": "2 Timothy 4:6-8, 16-18"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nGod was reconciling the world to himself in Christ,\nand entrusting to us the message of salvation.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "2 Corinthians",
                                "link": "https://bible.usccb.org/bible/2Corinthians/5?19",
                                "text": "2 Corinthians 5:19"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus addressed this parable\nto those who were convinced of their own righteousness\nand despised everyone else.\n\"Two people went up to the temple area to pray;\none was a Pharisee and the other was a tax collector.\nThe Pharisee took up his position and spoke this prayer to himself,\n'O God, I thank you that I am not like the rest of humanity --\ngreedy, dishonest, adulterous -- or even like this tax collector.\nI fast twice a week, and I pay tithes on my whole income.'\nBut the tax collector stood off at a distance\nand would not even raise his eyes to heaven\nbut beat his breast and prayed,\n'O God, be merciful to me a sinner.'\nI tell you, the latter went home justified, not the former;\nfor whoever exalts himself will be humbled,\nand the one who humbles himself will be exalted.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/18?9",
                                "text": "Luke 18:9-14"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Thirtieth Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/102625.cfm"
    },
    {
        "date": "2025-11-02",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "The souls of the just are in the hand of God,\n    and no torment shall touch them.\nThey seemed, in the view of the foolish, to be dead;\n    and their passing away was thought an affliction\n    and their going forth from us, utter destruction.\nBut they are in peace.\nFor if before men, indeed, they be punished,\n    yet is their hope full of immortality;\nchastised a little, they shall be greatly blessed,\n    because God tried them\n    and found them worthy of himself.\nAs gold in the furnace, he proved them,\n    and as sacrificial offerings he took them to himself.\nIn the time of their visitation they shall shine,\n    and shall dart about as sparks through stubble;\nthey shall judge nations and rule over peoples,\n    and the Lord shall be their King forever.\nThose who trust in him shall understand truth,\n    and the faithful shall abide with him in love:\nbecause grace and mercy are with his holy ones,\n    and his care is with his elect.",
                        "verses": [
                            {
                                "book": "Wisdom",
                                "link": "https://bible.usccb.org/bible/wisdom/3?1",
                                "text": "Wisdom 3:1-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R.    (1) The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nThe LORD is my shepherd; I shall not want.\n    In verdant pastures he gives me repose;\nbeside restful waters he leads me;\n    he refreshes my soul.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nHe guides me in right paths\n    for his name’s sake.\nEven though I walk in the dark valley\n    I fear no evil; for you are at my side\nwith your rod and your staff\n    that give me courage.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nYou spread the table before me\n    in the sight of my foes;\nYou anoint my head with oil;\n    my cup overflows.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.\nOnly goodness and kindness follow me\n    all the days of my life;\nand I shall dwell in the house of the LORD\n    for years to come.\nR.    The Lord is my shepherd; there is nothing I shall want.\nor:\nR.    Though I walk in the valley of darkness, I fear no evil, for you are with me.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/23?1",
                                "text": "Psalm 23:1-3a, 3b-4, 5, 6"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nHope does not disappoint,\nbecause the love of God has been poured out into our hearts\nthrough the Holy Spirit who has been given to us. \nFor Christ, while we were still helpless,\ndied at the appointed time for the ungodly.\nIndeed, only with difficulty does one die for a just person,\nthough perhaps for a good person\none might even find courage to die.\nBut God proves his love for us\nin that while we were still sinners Christ died for us.\nHow much more then, since we are now justified by his Blood,\nwill we be saved through him from the wrath.\nIndeed, if, while we were enemies,\nwe were reconciled to God through the death of his Son,\nhow much more, once reconciled,\nwill we be saved by his life.\nNot only that,\nbut we also boast of God through our Lord Jesus Christ,\nthrough whom we have now received reconciliation.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/5?5",
                                "text": "Romans 5:5-11"
                            }
                        ]
                    },
                    {
                        "text": "Brothers and sisters:\nAre you unaware that we who were baptized into Christ Jesus \nwere baptized into his death?\nWe were indeed buried with him through baptism into death, \nso that, just as Christ was raised from the dead \nby the glory of the Father, \nwe too might live in newness of life.For if we have grown into union with him through a death like his, \nwe shall also be united with him in the resurrection.\nWe know that our old self was crucified with him, \nso that our sinful body might be done away with, \nthat we might no longer be in slavery to sin.\nFor a dead person has been absolved from sin.\nIf, then, we have died with Christ,\nwe believe that we shall also live with him.\nWe know that Christ, raised from the dead, dies no more;\ndeath no longer has power over him.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/romans/6?3",
                                "text": "Romans 6:3-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nCome, you who are blessed by my Father;\ninherit the Kingdom prepared for you from the foundation of the world.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/25?34",
                                "text": "Matthew 25:34"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to the crowds:\n“Everything that the Father gives me will come to me,\nand I will not reject anyone who comes to me,\nbecause I came down from heaven not to do my own will\nbut the will of the one who sent me.\nAnd this is the will of the one who sent me,\nthat I should not lose anything of what he gave me,\nbut that I should raise it on the last day.\nFor this is the will of my Father,\nthat everyone who sees the Son and believes in him\nmay have eternal life,\nand I shall raise him on the last day.”",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/6?37",
                                "text": "John 6:37-40"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Commemoration of All the Faithful Departed",
        "url": "https://bible.usccb.org/bible/readings/110225.cfm"
    },
    {
        "date": "2025-11-09",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The angel brought me\nback to the entrance of the temple,\nand I saw water flowing out\nfrom beneath the threshold of the temple toward the east,\nfor the façade of the temple was toward the east;\nthe water flowed down from the southern side of the temple,\nsouth of the altar.\nHe led me outside by the north gate,\nand around to the outer gate facing the east,\nwhere I saw water trickling from the southern side.\nHe said to me,\n\"This water flows into the eastern district down upon the Arabah,\nand empties into the sea, the salt waters, which it makes fresh.\nWherever the river flows,\nevery sort of living creature that can multiply shall live,\nand there shall be abundant fish,\nfor wherever this water comes the sea shall be made fresh.\nAlong both banks of the river, fruit trees of every kind shall grow;\ntheir leaves shall not fade, nor their fruit fail.\nEvery month they shall bear fresh fruit,\nfor they shall be watered by the flow from the sanctuary.\nTheir fruit shall serve for food, and their leaves for medicine.\"",
                        "verses": [
                            {
                                "book": "Ezekiel",
                                "link": "https://bible.usccb.org/bible/ezekiel/47?1",
                                "text": "Ezekiel 47:1-2, 8-9, 12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (5) The waters of the river gladden the city of God, the holy dwelling of the Most High!\nGod is our refuge and our strength,\nan ever-present help in distress.\nTherefore, we fear not, though the earth be shaken\nand mountains plunge into the depths of the sea.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!\nThere is a stream whose runlets gladden the city of God,\nthe holy dwelling of the Most High.\nGod is in its midst; it shall not be disturbed;\nGod will help it at the break of dawn.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!\nThe LORD of hosts is with us;\nour stronghold is the God of Jacob.\nCome! behold the deeds of the LORD,\nthe astounding things he has wrought on earth.\nR. The waters of the river gladden the city of God, the holy dwelling of the Most High!",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/46?2",
                                "text": "Psalm 46:2-3, 5-6, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nYou are God's building.\nAccording to the grace of God given to me,\nlike a wise master builder I laid a foundation,\nand another is building upon it.\nBut each one must be careful how he builds upon it,\nfor no one can lay a foundation other than the one that is there,\nnamely, Jesus Christ.\n\nDo you not know that you are the temple of God,\nand that the Spirit of God dwells in you?\nIf anyone destroys God's temple,\nGod will destroy that person;\nfor the temple of God, which you are, is holy.",
                        "verses": [
                            {
                                "book": "1 Corinthians",
                                "link": "https://bible.usccb.org/bible/1corinthians/3?9",
                                "text": "1 Corinthians 3:9c-11, 16-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nI have chosen and consecrated this house, says the Lord,\nthat my name may be there forever.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "1 Chronicles",
                                "link": "https://bible.usccb.org/bible/1chronicles/3?9",
                                "text": "2 Chronicles 7:16"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Since the Passover of the Jews was near,\nJesus went up to Jerusalem.\nHe found in the temple area those who sold oxen, sheep, and doves,\nas well as the money-changers seated there.\nHe made a whip out of cords\nand drove them all out of the temple area, with the sheep and oxen,\nand spilled the coins of the money-changers\nand overturned their tables,\nand to those who sold doves he said,\n\"Take these out of here,\nand stop making my Father's house a marketplace.\"\nHis disciples recalled the words of Scripture,\nZeal for your house will consume me.\nAt this the Jews answered and said to him,\n\"What sign can you show us for doing this?\"\nJesus answered and said to them,\n\"Destroy this temple and in three days I will raise it up.\"\nThe Jews said,\n\"This temple has been under construction for forty-six years,\nand you will raise it up in three days?\"\nBut he was speaking about the temple of his Body.\nTherefore, when he was raised from the dead,\nhis disciples remembered that he had said this,\nand they came to believe the Scripture\nand the word Jesus had spoken.",
                        "verses": [
                            {
                                "book": "John",
                                "link": "https://bible.usccb.org/bible/john/2?13",
                                "text": "John 2:13-22"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Dedication of the Lateran Basilica in Rome",
        "url": "https://bible.usccb.org/bible/readings/110925.cfm"
    },
    {
        "date": "2025-11-16",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "Lo, the day is coming, blazing like an oven,\n when all the proud and all evildoers will be stubble,\n and the day that is coming will set them on fire,\n leaving them neither root nor branch,\n says the LORD of hosts.\n But for you who fear my name, there will arise\n the sun of justice with its healing rays.",
                        "verses": [
                            {
                                "book": "Malachi",
                                "link": "https://bible.usccb.org/bible/Malachi/3?19",
                                "text": "Malachi 3:19-20a"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 9)  The Lord comes to rule the earth with justice.\nSing praise to the LORD with the harp,\nwith the harp and melodious song.\nWith trumpets and the sound of the horn\nsing joyfully before the King, the LORD.\nR. The Lord comes to rule the earth with justice.\nLet the sea and what fills it resound,\nthe world and those who dwell in it;\nlet the rivers clap their hands,\nthe mountains shout with them for joy.\nR. The Lord comes to rule the earth with justice.\nBefore the LORD, for he comes,\nfor he comes to rule the earth,\nhe will rule the world with justice\nand the peoples with equity.\nR. The Lord comes to rule the earth with justice.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/98?5",
                                "text": "Psalm 98:5-6, 7-8, 9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nYou know how one must imitate us.\nFor we did not act in a disorderly way among you,\nnor did we eat food received free from anyone.\nOn the contrary, in toil and drudgery, night and day\nwe worked, so as not to burden any of you.\nNot that we do not have the right.\nRather, we wanted to present ourselves as a model for you,\nso that you might imitate us.\nIn fact, when we were with you,\nwe instructed you that if anyone was unwilling to work,\nneither should that one eat.\nWe hear that some are conducting themselves among you in a\ndisorderly way,\nby not keeping busy but minding the business of others.\nSuch people we instruct and urge in the Lord Jesus Christ to work quietly\nand to eat their own food.",
                        "verses": [
                            {
                                "book": "2 Thessalonians",
                                "link": "https://bible.usccb.org/bible/2thessalonians/3?7",
                                "text": "2 Thessalonians 3:7-12"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nStand erect and raise your heads\nbecause your redemption is at hand.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/21?28",
                                "text": "Luke 21:28"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "While some people were speaking about\nhow the temple was adorned with costly stones and votive offerings,\nJesus said, \"All that you see here--\nthe days will come when there will not be left\na stone upon another stone that will not be thrown down.\"\n\nThen they asked him,\n\"Teacher, when will this happen?\nAnd what sign will there be when all these things are about to happen?\"\nHe answered,\n\"See that you not be deceived,\nfor many will come in my name, saying,\n'I am he,' and 'The time has come.'\nDo not follow them!\nWhen you hear of wars and insurrections,\ndo not be terrified; for such things must happen first,\nbut it will not immediately be the end.\"\nThen he said to them,\n\"Nation will rise against nation, and kingdom against kingdom.\nThere will be powerful earthquakes, famines, and plagues\nfrom place to place;\nand awesome sights and mighty signs will come from the sky.\n\n\"Before all this happens, however,\nthey will seize and persecute you,\nthey will hand you over to the synagogues and to prisons,\nand they will have you led before kings and governors\nbecause of my name.\nIt will lead to your giving testimony.\nRemember, you are not to prepare your defense beforehand,\nfor I myself shall give you a wisdom in speaking\nthat all your adversaries will be powerless to resist or refute.\nYou will even be handed over by parents, brothers, relatives, and friends,\nand they will put some of you to death.\nYou will be hated by all because of my name,\nbut not a hair on your head will be destroyed.\nBy your perseverance you will secure your lives.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/21?5",
                                "text": "Luke 21:5-19"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Thirty-third Sunday in Ordinary Time",
        "url": "https://bible.usccb.org/bible/readings/111625.cfm"
    },
    {
        "date": "2025-11-23",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "In those days, all the tribes of Israel came to David in Hebron and said:\n\"Here we are, your bone and your flesh.\nIn days past, when Saul was our king,\nit was you who led the Israelites out and brought them back.\nAnd the LORD said to you,\n'You shall shepherd my people Israel\nand shall be commander of Israel.'\"\nWhen all the elders of Israel came to David in Hebron,\nKing David made an agreement with them there before the LORD,\nand they anointed him king of Israel.",
                        "verses": [
                            {
                                "book": "2 Samuel",
                                "link": "https://bible.usccb.org/bible/2Samuel/5?1",
                                "text": "2 Samuel 5:1-3"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1) Let us go rejoicing to the house of the Lord.\nI rejoiced because they said to me,\n\"We will go up to the house of the LORD.\"\nAnd now we have set foot\nwithin your gates, O Jerusalem.\nR. Let us go rejoicing to the house of the Lord.\nJerusalem, built as a city\nwith compact unity.\nTo it the tribes go up,\nthe tribes of the LORD.\nR. Let us go rejoicing to the house of the Lord.\nAccording to the decree for Israel,\nto give thanks to the name of the LORD.\nIn it are set up judgment seats,\nseats for the house of David.\nR. Let us go rejoicing to the house of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/122?1",
                                "text": "Psalm 122:1-2, 3-4, 4-5"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nLet us give thanks to the Father,\nwho has made you fit to share\nin the inheritance of the holy ones in light.\nHe delivered us from the power of darkness\nand transferred us to the kingdom of his beloved Son,\nin whom we have redemption, the forgiveness of sins.\n\nHe is the image of the invisible God,\nthe firstborn of all creation.\nFor in him were created all things in heaven and on earth,\nthe visible and the invisible,\nwhether thrones or dominions or principalities or powers;\nall things were created through him and for him.\nHe is before all things,\nand in him all things hold together.\nHe is the head of the body, the church.\nHe is the beginning, the firstborn from the dead,\nthat in all things he himself might be preeminent.\nFor in him all the fullness was pleased to dwell,\nand through him to reconcile all things for him,\nmaking peace by the blood of his cross\nthrough him, whether those on earth or those in heaven.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/Colossians/1?12",
                                "text": "Colossians 1:12-20"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nBlessed is he who comes in the name of the Lord!\nBlessed is the kingdom of our father David that is to come!\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Mark",
                                "link": "https://bible.usccb.org/bible/mark/11?9",
                                "text": "Mark 11:9, 10"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "The rulers sneered at Jesus and said,\n\"He saved others, let him save himself\nif he is the chosen one, the Christ of God.\"\nEven the soldiers jeered at him.\nAs they approached to offer him wine they called out,\n\"If you are King of the Jews, save yourself.\"\nAbove him there was an inscription that read,\n\"This is the King of the Jews.\"\n\nNow one of the criminals hanging there reviled Jesus, saying,\n\"Are you not the Christ?\nSave yourself and us.\"\nThe other, however, rebuking him, said in reply,\n\"Have you no fear of God,\nfor you are subject to the same condemnation?\nAnd indeed, we have been condemned justly,\nfor the sentence we received corresponds to our crimes,\nbut this man has done nothing criminal.\"\nThen he said,\n\"Jesus, remember me when you come into your kingdom.\"\nHe replied to him,\n\"Amen, I say to you,\ntoday you will be with me in Paradise.\"",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/23?35",
                                "text": "Luke 23:35-43"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "The Solemnity of Our Lord Jesus Christ, King of the Universe",
        "url": "https://bible.usccb.org/bible/readings/112325.cfm"
    },
    {
        "date": "2025-11-30",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "This is what Isaiah, son of Amoz,\nsaw concerning Judah and Jerusalem.\nIn days to come,\nthe mountain of the LORD's house\nshall be established as the highest mountain\nand raised above the hills.\nAll nations shall stream toward it;\nmany peoples shall come and say:\n\"Come, let us climb the LORD's mountain,\nto the house of the God of Jacob,\nthat he may instruct us in his ways,\nand we may walk in his paths.\"\nFor from Zion shall go forth instruction,\nand the word of the LORD from Jerusalem.\nHe shall judge between the nations,\nand impose terms on many peoples.\nThey shall beat their swords into plowshares\nand their spears into pruning hooks;\none nation shall not raise the sword against another,\nnor shall they train for war again.\nO house of Jacob, come,\nlet us walk in the light of the Lord!",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/2?1",
                                "text": "Isaiah 2:1-5"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. Let us go rejoicing to the house of the Lord.\nI rejoiced because they said to me,\n\"We will go up to the house of the LORD.\"\nAnd now we have set foot\nwithin your gates, O Jerusalem.\nR. Let us go rejoicing to the house of the Lord.\nJerusalem, built as a city\nwith compact unity.\nTo it the tribes go up,\nthe tribes of the LORD.\nR. Let us go rejoicing to the house of the Lord.\nAccording to the decree for Israel,\nto give thanks to the name of the LORD.\nIn it are set up judgment seats,\nseats for the house of David.\nR. Let us go rejoicing to the house of the Lord.\nPray for the peace of Jerusalem!\nMay those who love you prosper!\nMay peace be within your walls,\nprosperity in your buildings.\nR. Let us go rejoicing to the house of the Lord.\nBecause of my brothers and friends\nI will say, \"Peace be within you!\"\nBecause of the house of the LORD, our God,\nI will pray for your good.\nR. Let us go rejoicing to the house of the Lord.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/122?1",
                                "text": "Psalm 122: 1-2, 3-4, 4-5, 6-7, 8-9"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nYou know the time;\nit is the hour now for you to awake from sleep.\nFor our salvation is nearer now than when we first believed;\nthe night is advanced, the day is at hand.\nLet us then throw off the works of darkness\nand put on the armor of light;\nlet us conduct ourselves properly as in the day,\nnot in orgies and drunkenness,\nnot in promiscuity and lust,\nnot in rivalry and jealousy.\nBut put on the Lord Jesus Christ,\nand make no provision for the desires of the flesh.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/13?11",
                                "text": "Romans 13:11-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nShow us Lord, your love;\nand grant us your salvation.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/85?8",
                                "text": "Cf. Psalm 85:8"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "Jesus said to his disciples:\n\"As it was in the days of Noah,\nso it will be at the coming of the Son of Man.\nIn those days before the flood,\nthey were eating and drinking,\nmarrying and giving in marriage,\nup to the day that Noah entered the ark.\nThey did not know until the flood came and carried them all away.\nSo will it be also at the coming of the Son of Man.\nTwo men will be out in the field;\none will be taken, and one will be left.\nTwo women will be grinding at the mill;\none will be taken, and one will be left.\nTherefore, stay awake!\nFor you do not know on which day your Lord will come.\nBe sure of this: if the master of the house\nhad known the hour of night when the thief was coming,\nhe would have stayed awake\nand not let his house be broken into.\nSo too, you also must be prepared,\nfor at an hour you do not expect, the Son of Man will come.\"",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/24?37",
                                "text": "Matthew 24:37-44"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "First Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/113025.cfm"
    },
    {
        "date": "2025-12-07",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "On that day, a shoot shall sprout from the stump of Jesse,\nand from his roots a bud shall blossom.\nThe spirit of the LORD shall rest upon him:\na spirit of wisdom and of understanding,\na spirit of counsel and of strength,\na spirit of knowledge and of fear of the LORD,\nand his delight shall be the fear of the LORD.\nNot by appearance shall he judge,\nnor by hearsay shall he decide,\nbut he shall judge the poor with justice,\nand decide aright for the land's afflicted.\nHe shall strike the ruthless with the rod of his mouth,\nand with the breath of his lips he shall slay the wicked.\nJustice shall be the band around his waist,\nand faithfulness a belt upon his hips.\nThen the wolf shall be a guest of the lamb,\nand the leopard shall lie down with the kid;\nthe calf and the young lion shall browse together,\nwith a little child to guide them.\nThe cow and the bear shall be neighbors,\ntogether their young shall rest;\nthe lion shall eat hay like the ox.\nThe baby shall play by the cobra's den,\nand the child lay his hand on the adder's lair.\nThere shall be no harm or ruin on all my holy mountain;\nfor the earth shall be filled with knowledge of the LORD,\nas water covers the sea.\nOn that day, the root of Jesse,\nset up as a signal for the nations,\nthe Gentiles shall seek out,\nfor his dwelling shall be glorious.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/11?1",
                                "text": "Isaiah 11:1-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 7)  Justice shall flourish in his time, and fullness of peace for ever.\nO God, with your judgment endow the king,\nand with your justice, the king's son;\nhe shall govern your people with justice\nand your afflicted ones with judgment.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nJustice shall flower in his days,\nand profound peace, till the moon be no more.\nMay he rule from sea to sea,\nand from the River to the ends of the earth.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nFor he shall rescue the poor when he cries out,\nand the afflicted when he has no one to help him.\nHe shall have pity for the lowly and the poor;\nthe lives of the poor he shall save.\nR. Justice shall flourish in his time, and fullness of peace for ever.\nMay his name be blessed forever;\nas long as the sun his name shall remain.\nIn him shall all the tribes of the earth be blessed;\nall the nations shall proclaim his happiness.\nR. Justice shall flourish in his time, and fullness of peace for ever.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/72?1",
                                "text": "Psalm 72:1-2, 7-8, 12-13, 17"
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nWhatever was written previously was written for our instruction,\nthat by endurance and by the encouragement of the Scriptures\nwe might have hope.\nMay the God of endurance and encouragement\ngrant you to think in harmony with one another,\nin keeping with Christ Jesus,\nthat with one accord you may with one voice\nglorify the God and Father of our Lord Jesus Christ.\n\nWelcome one another, then, as Christ welcomed you,\nfor the glory of God.\nFor I say that Christ became a minister of the circumcised\nto show God's truthfulness,\nto confirm the promises to the patriarchs,\nbut so that the Gentiles might glorify God for his mercy.\nAs it is written:\nTherefore, I will praise you among the Gentiles\nand sing praises to your name.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/15?4",
                                "text": "Romans 15:4-9"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nPrepare the way of the Lord, make straight his paths:\nall flesh shall see the salvation of God.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Luke",
                                "link": "https://bible.usccb.org/bible/luke/3?4",
                                "text": "Luke 3:4, 6"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "John the Baptist appeared, preaching in the desert of Judea\nand saying, \"Repent, for the kingdom of heaven is at hand!\"\nIt was of him that the prophet Isaiah had spoken when he said:\nA voice of one crying out in the desert,\nPrepare the way of the Lord,\nmake straight his paths.\nJohn wore clothing made of camel's hair\nand had a leather belt around his waist.\nHis food was locusts and wild honey.\nAt that time Jerusalem, all Judea,\nand the whole region around the Jordan\nwere going out to him\nand were being baptized by him in the Jordan River\nas they acknowledged their sins.\n\nWhen he saw many of the Pharisees and Sadducees\ncoming to his baptism, he said to them, \"You brood of vipers!\nWho warned you to flee from the coming wrath?\nProduce good fruit as evidence of your repentance.\nAnd do not presume to say to yourselves,\n'We have Abraham as our father.'\nFor I tell you,\nGod can raise up children to Abraham from these stones.\nEven now the ax lies at the root of the trees.\nTherefore every tree that does not bear good fruit\nwill be cut down and thrown into the fire.\nI am baptizing you with water, for repentance,\nbut the one who is coming after me is mightier than I.\nI am not worthy to carry his sandals.\nHe will baptize you with the Holy Spirit and fire.\nHis winnowing fan is in his hand.\nHe will clear his threshing floor\nand gather his wheat into his barn,\nbut the chaff he will burn with unquenchable fire.\"",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/3?1",
                                "text": "Matthew 3:1-12"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Second Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/120725.cfm"
    },
    {
        "date": "2025-12-14",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The desert and the parched land will exult;\nthe steppe will rejoice and bloom.\nThey will bloom with abundant flowers,\nand rejoice with joyful song.\nThe glory of Lebanon will be given to them,\nthe splendor of Carmel and Sharon;\nthey will see the glory of the LORD,\nthe splendor of our God.\nStrengthen the hands that are feeble,\nmake firm the knees that are weak,\nsay to those whose hearts are frightened:\nBe strong, fear not!\nHere is your God,\nhe comes with vindication;\nwith divine recompense\nhe comes to save you.\nThen will the eyes of the blind be opened,\nthe ears of the deaf be cleared;\nthen will the lame leap like a stag,\nthen the tongue of the mute will sing.\n\nThose whom the LORD has ransomed will return\nand enter Zion singing,\ncrowned with everlasting joy;\nthey will meet with joy and gladness,\nsorrow and mourning will flee.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/35?1",
                                "text": "Isaiah 35:1-6a, 10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. Is 35:4)  Lord, come and save us.\nor:\nR. Alleluia.\nThe LORD God keeps faith forever,\nsecures justice for the oppressed,\ngives food to the hungry.\nThe LORD sets captives free.\nR. Lord, come and save us.\nor:\nR. Alleluia.\nThe LORD gives sight to the blind;\nthe LORD raises up those who were bowed down.\nThe LORD loves the just;\nthe LORD protects strangers.\nR. Lord, come and save us.\nor:\nR. Alleluia.\nThe fatherless and the widow he sustains,\nbut the way of the wicked he thwarts.\nThe LORD shall reign forever;\nyour God, O Zion, through all generations.\nR. Lord, come and save us.\nor:\nR. Alleluia.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/146?6",
                                "text": "Psalm 146:6-7, 8-9, 9-10."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Be patient, brothers and sisters,\nuntil the coming of the Lord.\nSee how the farmer waits for the precious fruit of the earth,\nbeing patient with it\nuntil it receives the early and the late rains.\nYou too must be patient.\nMake your hearts firm,\nbecause the coming of the Lord is at hand.\nDo not complain, brothers and sisters, about one another,\nthat you may not be judged.\nBehold, the Judge is standing before the gates.\nTake as an example of hardship and patience, brothers and sisters,\nthe prophets who spoke in the name of the Lord.",
                        "verses": [
                            {
                                "book": "James",
                                "link": "https://bible.usccb.org/bible/james/5?7",
                                "text": "James 5:7-10"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe Spirit of the Lord is upon me,\nbecause he has anointed me\nto bring glad tidings to the poor.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/61?1",
                                "text": "Isaiah 61:1 (cited in Lk 4:18)"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "When John the Baptist heard in prison of the works of the Christ,\nhe sent his disciples to Jesus with this question,\n\"Are you the one who is to come,\nor should we look for another?\"\nJesus said to them in reply,\n\"Go and tell John what you hear and see:\nthe blind regain their sight,\nthe lame walk,\nlepers are cleansed,\nthe deaf hear,\nthe dead are raised,\nand the poor have the good news proclaimed to them.\nAnd blessed is the one who takes no offense at me.\"\n\nAs they were going off,\nJesus began to speak to the crowds about John,\n\"What did you go out to the desert to see?\nA reed swayed by the wind?\nThen what did you go out to see?\nSomeone dressed in fine clothing?\nThose who wear fine clothing are in royal palaces.\nThen why did you go out?  To see a prophet?\nYes, I tell you, and more than a prophet.\nThis is the one about whom it is written:\nBehold, I am sending my messenger ahead of you;\nhe will prepare your way before you.\nAmen, I say to you,\namong those born of women\nthere has been none greater than John the Baptist;\nyet the least in the kingdom of heaven is greater than he.\"",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/11?2",
                                "text": "Matthew 11:2-11"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Third Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/121425.cfm"
    },
    {
        "date": "2025-12-21",
        "sections": [
            {
                "header": "Reading 1",
                "readings": [
                    {
                        "text": "The LORD spoke to Ahaz, saying:\nAsk for a sign from the LORD, your God;\nlet it be deep as the netherworld, or high as the sky!\nBut Ahaz answered,\n\"I will not ask!  I will not tempt the LORD!\"\nThen Isaiah said:\nListen, O house of David!\nIs it not enough for you to weary people,\nmust you also weary my God?\nTherefore the Lord himself will give you this sign:\nthe virgin shall conceive, and bear a son,\nand shall name him Emmanuel.",
                        "verses": [
                            {
                                "book": "Isaiah",
                                "link": "https://bible.usccb.org/bible/Isaiah/7?10",
                                "text": "Isaiah 7:10-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (7c and 10b) Let the Lord enter; he is king of glory.\nThe LORD's are the earth and its fullness;\nthe world and those who dwell in it.\nFor he founded it upon the seas\nand established it upon the rivers.\nR. Let the Lord enter; he is king of glory.\nWho can ascend the mountain of the LORD?\nor who may stand in his holy place?\nOne whose hands are sinless, whose heart is clean,\nwho desires not what is vain.\nR. Let the Lord enter; he is king of glory.\nHe shall receive a blessing from the LORD,\na reward from God his savior.\nSuch is the race that seeks for him,\nthat seeks the face of the God of Jacob.\nR. Let the Lord enter; he is king of glory.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/Psalms/24?1",
                                "text": "Psalm 24:1-2, 3-4, 5-6."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading 2",
                "readings": [
                    {
                        "text": "Paul, a slave of Christ Jesus,\ncalled to be an apostle and set apart for the gospel of God,\nwhich he promised previously through his prophets in the holy Scriptures,\nthe gospel about his Son, descended from David according to the flesh,\nbut established as Son of God in power\naccording to the Spirit of holiness\nthrough resurrection from the dead, Jesus Christ our Lord.\nThrough him we have received the grace of apostleship,\nto bring about the obedience of faith,\nfor the sake of his name, among all the Gentiles,\namong whom are you also, who are called to belong to Jesus Christ;\nto all the beloved of God in Rome, called to be holy.\nGrace to you and peace from God our Father\nand the Lord Jesus Christ.",
                        "verses": [
                            {
                                "book": "Romans",
                                "link": "https://bible.usccb.org/bible/Romans/1?1",
                                "text": "Romans 1:1-7"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nThe virgin shall conceive, and bear a son,\nand they shall name him Emmanuel.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/1?23",
                                "text": "Matthew 1:23"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "This is how the birth of Jesus Christ came about.\nWhen his mother Mary was betrothed to Joseph,\nbut before they lived together,\nshe was found with child through the Holy Spirit.\nJoseph her husband, since he was a righteous man,\nyet unwilling to expose her to shame,\ndecided to divorce her quietly.\nSuch was his intention when, behold,\nthe angel of the Lord appeared to him in a dream and said,\n\"Joseph, son of David,\ndo not be afraid to take Mary your wife into your home.\nFor it is through the Holy Spirit\nthat this child has been conceived in her.\nShe will bear a son and you are to name him Jesus,\nbecause he will save his people from their sins.\"\nAll this took place to fulfill what the Lord had said through the prophet:\nBehold, the virgin shall conceive and bear a son,\nand they shall name him Emmanuel, \nwhich means \"God is with us.\"\nWhen Joseph awoke,\nhe did as the angel of the Lord had commanded him\nand took his wife into his home.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/1?18",
                                "text": "Matthew 1:18-24"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Fourth Sunday of Advent",
        "url": "https://bible.usccb.org/bible/readings/122125.cfm"
    },
    {
        "date": "2025-12-28",
        "sections": [
            {
                "header": "Reading I",
                "readings": [
                    {
                        "text": "God sets a father in honor over his children;\n    a mother’s authority he confirms over her sons.\nWhoever honors his father atones for sins,\n    and preserves himself from them.\nWhen he prays, he is heard;\n    he stores up riches who reveres his mother.\nWhoever honors his father is gladdened by children,\n    and, when he prays, is heard.\nWhoever reveres his father will live a long life;\n    he who obeys his father brings comfort to his mother.My son, take care of your father when he is old;\n    grieve him not as long as he lives.\nEven if his mind fail, be considerate of him;\n    revile him not all the days of his life;\nkindness to a father will not be forgotten,\n    firmly planted against the debt of your sins\n    —a house raised in justice to you.",
                        "verses": [
                            {
                                "book": "Sirach",
                                "link": "https://bible.usccb.org/bible/sirach/3?2",
                                "text": "Sirach 3:2-6, 12-14"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Responsorial Psalm",
                "readings": [
                    {
                        "text": "R. (cf. 1)  Blessed are those who fear the Lord and walk in his ways.\nBlessed is everyone who fears the LORD,\n   who walks in his ways!\nFor you shall eat the fruit of your handiwork;\n   blessed shall you be, and favored.\nR. Blessed are those who fear the Lord and walk in his ways.\nYour wife shall be like a fruitful vine\n   in the recesses of your home;\nyour children like olive plants\n   around your table.\nR. Blessed are those who fear the Lord and walk in his ways.\nBehold, thus is the man blessed\n   who fears the LORD.\nThe LORD bless you from Zion:\n   may you see the prosperity of Jerusalem\n   all the days of your life.\nR. Blessed are those who fear the Lord and walk in his ways.",
                        "verses": [
                            {
                                "book": "Psalms",
                                "link": "https://bible.usccb.org/bible/psalms/128?1",
                                "text": "Psalm 128:1-2, 3, 4-5."
                            }
                        ]
                    }
                ],
                "type": "PSALM"
            },
            {
                "header": "Reading II",
                "readings": [
                    {
                        "text": "Brothers and sisters:\nPut on, as God’s chosen ones, holy and beloved,\nheartfelt compassion, kindness, humility, gentleness, and patience,\nbearing with one another and forgiving one another, \nif one has a grievance against another; \nas the Lord has forgiven you, so must you also do.\nAnd over all these put on love, \nthat is, the bond of perfection.\nAnd let the peace of Christ control your hearts, \nthe peace into which you were also called in one body.\nAnd be thankful.\nLet the word of Christ dwell in you richly, \nas in all wisdom you teach and admonish one another, \nsinging psalms, hymns, and spiritual songs \nwith gratitude in your hearts to God.\nAnd whatever you do, in word or in deed, \ndo everything in the name of the Lord Jesus, \ngiving thanks to God the Father through him.  Wives, be subordinate to your husbands, \nas is proper in the Lord.\nHusbands, love your wives, \nand avoid any bitterness toward them.\nChildren, obey your parents in everything, \nfor this is pleasing to the Lord.\nFathers, do not provoke your children, \nso they may not become discouraged.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?12",
                                "text": "Colossians 3:12-21"
                            }
                        ]
                    },
                    {
                        "text": "Brothers and sisters:\nPut on, as God’s chosen ones, holy and beloved,\nheartfelt compassion, kindness, humility, gentleness, and patience,\nbearing with one another and forgiving one another, \nif one has a grievance against another; \nas the Lord has forgiven you, so must you also do.\nAnd over all these put on love, \nthat is, the bond of perfection.\nAnd let the peace of Christ control your hearts, \nthe peace into which you were also called in one body.\nAnd be thankful.\nLet the word of Christ dwell in you richly, \nas in all wisdom you teach and admonish one another, \nsinging psalms, hymns, and spiritual songs \nwith gratitude in your hearts to God.\nAnd whatever you do, in word or in deed, \ndo everything in the name of the Lord Jesus, \ngiving thanks to God the Father through him.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?12",
                                "text": "Colossians 3:12-17"
                            }
                        ]
                    }
                ],
                "type": "READING"
            },
            {
                "header": "Alleluia",
                "readings": [
                    {
                        "text": "R. Alleluia, alleluia.\nLet the peace of Christ control your hearts;\nLet the word of Christ dwell in you richly.\nR. Alleluia, alleluia.",
                        "verses": [
                            {
                                "book": "Colossians",
                                "link": "https://bible.usccb.org/bible/colossians/3?15",
                                "text": "Colossians 3:15a, 16a"
                            }
                        ]
                    }
                ],
                "type": "ALLELUIA"
            },
            {
                "header": "Gospel",
                "readings": [
                    {
                        "text": "When the magi had departed, behold,\nthe angel of the Lord appeared to Joseph in a dream and said,\n“Rise, take the child and his mother, flee to Egypt,\nand stay there until I tell you.\nHerod is going to search for the child to destroy him.”\nJoseph rose and took the child and his mother by night\nand departed for Egypt.\nHe stayed there until the death of Herod,\nthat what the Lord had said through the prophet might be fulfilled,\nOut of Egypt I called my son.\n\nWhen Herod had died, behold,\nthe angel of the Lord appeared in a dream\nto Joseph in Egypt and said,\n“Rise, take the child and his mother and go to the land of Israel,\nfor those who sought the child’s life are dead.”\nHe rose, took the child and his mother,\nand went to the land of Israel.\nBut when he heard that Archelaus was ruling over Judea\nin place of his father Herod,\nhe was afraid to go back there.\nAnd because he had been warned in a dream,\nhe departed for the region of Galilee.\nHe went and dwelt in a town called Nazareth,\nso that what had been spoken through the prophets\nmight be fulfilled,\nHe shall be called a Nazorean.",
                        "verses": [
                            {
                                "book": "Matthew",
                                "link": "https://bible.usccb.org/bible/matthew/2?13",
                                "text": "Mt 2:13-15, 19-23"
                            }
                        ]
                    }
                ],
                "type": "GOSPEL"
            }
        ],
        "title": "Feast of the Holy Family of Jesus, Mary and Joseph",
        "url": "https://bible.usccb.org/bible/readings/122825.cfm"
    }
]